#pragma once

#include "FrostbiteGeneral.h"
#include "FrostbiteEnumDump.h"
#include "FrostbiteStructDump.h"


namespace fb
{
	////////////////////////////////////////
	// ClassId:   01357
	// RuntimeId: 03617
	// TypeInfo:  0x000000014276BF80
#ifndef _DataContainer_
#define _DataContainer_
#pragma pack(push, 8)
	class DataContainer
	{
	public:
		static __inline DataContainer* DefaultInstance()
		{
			return (DataContainer*)0x00000000462E0080;
		}
		static __inline unsigned int ClassId()
		{
			return 1357;
		}
		char _0x0000[16];
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01428
	// RuntimeId: 03643
	// TypeInfo:  0x000000014276D570
#ifndef _Asset_
#define _Asset_
#pragma pack(push, 8)
	class Asset : public DataContainer
	{
	public:
		static __inline Asset* DefaultInstance()
		{
			return (Asset*)0x0000000046381D40;
		}
		static __inline unsigned int ClassId()
		{
			return 1428;
		}
		char* m_Name; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01836
	// RuntimeId: 09737
	// TypeInfo:  0x00000001427F9EA0
#ifndef _WebBrowserLocalURLAsset_
#define _WebBrowserLocalURLAsset_
#pragma pack(push, 8)
	class WebBrowserLocalURLAsset : public Asset
	{
	public:
		static __inline WebBrowserLocalURLAsset* DefaultInstance()
		{
			return (WebBrowserLocalURLAsset*)0x000000004638AB10;
		}
		static __inline unsigned int ClassId()
		{
			return 1836;
		}
		char* m_LocalPath; //0x0018
		RawFileDataAsset* m_File; //0x0020
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03107
	// RuntimeId: 06702
	// TypeInfo:  0x00000001427B8510
#ifndef _LevelDescriptionComponent_
#define _LevelDescriptionComponent_
#pragma pack(push, 8)
	class LevelDescriptionComponent : public DataContainer
	{
	public:
		static __inline LevelDescriptionComponent* DefaultInstance()
		{
			return (LevelDescriptionComponent*)0x00000000463B7890;
		}
		static __inline unsigned int ClassId()
		{
			return 3107;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03687
	// RuntimeId: 03653
	// TypeInfo:  0x000000014276D450
#ifndef _SystemSettings_
#define _SystemSettings_
#pragma pack(push, 8)
	class SystemSettings : public DataContainer
	{
	public:
		static __inline SystemSettings* DefaultInstance()
		{
			return (SystemSettings*)0x00000000463C42B0;
		}
		static __inline unsigned int ClassId()
		{
			return 3687;
		}
		char* m_Name; //0x0010
		GamePlatform m_Platform; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02104
	// RuntimeId: 03649
	// TypeInfo:  0x000000014276D510
#ifndef _GameDataContainer_
#define _GameDataContainer_
#pragma pack(push, 8)
	class GameDataContainer : public DataContainer
	{
	public:
		static __inline GameDataContainer* DefaultInstance()
		{
			return (GameDataContainer*)0x0000000046390740;
		}
		static __inline unsigned int ClassId()
		{
			return 2104;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02106
	// RuntimeId: 03651
	// TypeInfo:  0x000000014276D4B0
#ifndef _DataBusPeer_
#define _DataBusPeer_
#pragma pack(push, 8)
	class DataBusPeer : public GameDataContainer
	{
	public:
		static __inline DataBusPeer* DefaultInstance()
		{
			return (DataBusPeer*)0x00000000463908B0;
		}
		static __inline unsigned int ClassId()
		{
			return 2106;
		}
		unsigned __int32 m_Flags; //0x0010
		char _0x0014[4];
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02107
	// RuntimeId: 04923
	// TypeInfo:  0x000000014278D950
#ifndef _GameObjectData_
#define _GameObjectData_
#pragma pack(push, 8)
	class GameObjectData : public DataBusPeer
	{
	public:
		static __inline GameObjectData* DefaultInstance()
		{
			return (GameObjectData*)0x00000000463908E0;
		}
		static __inline unsigned int ClassId()
		{
			return 2107;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02880
	// RuntimeId: 04939
	// TypeInfo:  0x000000014278D710
#ifndef _ComponentData_
#define _ComponentData_
#pragma pack(push, 16)
	class ComponentData : public GameObjectData
	{
	public:
		static __inline ComponentData* DefaultInstance()
		{
			return (ComponentData*)0x00000000463ABBB0;
		}
		static __inline unsigned int ClassId()
		{
			return 2880;
		}
		Array<GameObjectData*> m_Components; //0x0018
		LinearTransform m_Transform; //0x0020
		bool m_Excluded; //0x0060
		char _0x0061[15];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02140
	// RuntimeId: 04929
	// TypeInfo:  0x000000014278D8F0
#ifndef _EntityData_
#define _EntityData_
#pragma pack(push, 8)
	class EntityData : public GameObjectData
	{
	public:
		static __inline EntityData* DefaultInstance()
		{
			return (EntityData*)0x0000000046391D50;
		}
		static __inline unsigned int ClassId()
		{
			return 2140;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01856
	// RuntimeId: 09719
	// TypeInfo:  0x00000001427F9AA0
#ifndef _WaterEffectSetup_
#define _WaterEffectSetup_
#pragma pack(push, 8)
	class WaterEffectSetup : public Asset
	{
	public:
		static __inline WaterEffectSetup* DefaultInstance()
		{
			return (WaterEffectSetup*)0x000000004638B150;
		}
		static __inline unsigned int ClassId()
		{
			return 1856;
		}
		Array<WaterAmbientFoamEffectSpawner> m_AmbientEffects; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00295
	// RuntimeId: 05233
	// TypeInfo:  0x0000000142791150
#ifndef _EntityBusPeer_
#define _EntityBusPeer_
	class EntityBusPeer
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 295;
		}
		char _0x0000[8];
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00579
	// RuntimeId: 04759
	// TypeInfo:  0x0000000142785590
#ifndef _Entity_
#define _Entity_
	class Entity : public EntityBusPeer
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 579;
		}
		char _0x0008[24];
	};//Size=0x0020
#endif

	////////////////////////////////////////
	// ClassId:   00296
	// RuntimeId: 05251
	// TypeInfo:  0x0000000142791800
#ifndef _Component_
#define _Component_
	class Component : public EntityBusPeer
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 296;
		}
		char _0x0008[24];
	};//Size=0x0020
#endif

	////////////////////////////////////////
	// ClassId:   00624
	// RuntimeId: 05139
	// TypeInfo:  0x0000000142790CF0
#ifndef _SpatialEntity_
#define _SpatialEntity_
	class SpatialEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 624;
		}
		char _0x0020[8];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00518
	// RuntimeId: 08016
	// TypeInfo:  0x00000001427D3BF0
#ifndef _PhysicsComponent_
#define _PhysicsComponent_
	class PhysicsComponent : public Component
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 518;
		}
		char _0x0020[8];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00645
	// RuntimeId: 05252
	// TypeInfo:  0x0000000142791990
#ifndef _ComponentEntity_
#define _ComponentEntity_
	class ComponentEntity : public SpatialEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 645;
		}
		char _0x0028[24];
	};//Size=0x0040
#endif

	////////////////////////////////////////
	// ClassId:   00631
	// RuntimeId: 09707
	// TypeInfo:  0x00000001427F9440
#ifndef _WaterInteractTurbulenceDisturbEntity_
#define _WaterInteractTurbulenceDisturbEntity_
	class WaterInteractTurbulenceDisturbEntity : public SpatialEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 631;
		}
		char _0x0028[72];
	};//Size=0x0070
#endif

	////////////////////////////////////////
	// ClassId:   02335
	// RuntimeId: 09705
	// TypeInfo:  0x00000001427F8F70
#ifndef _VoipEntityData_
#define _VoipEntityData_
#pragma pack(push, 8)
	class VoipEntityData : public EntityData
	{
	public:
		static __inline VoipEntityData* DefaultInstance()
		{
			return (VoipEntityData*)0x00000000463964A0;
		}
		static __inline unsigned int ClassId()
		{
			return 2335;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01298
	// RuntimeId: 09703
	// TypeInfo:  0x00000001427F8FD0
#ifndef _VoipEntity_
#define _VoipEntity_
	class VoipEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1298;
		}
		char _0x0020[32];
	};//Size=0x0040
#endif

	////////////////////////////////////////
	// ClassId:   03345
	// RuntimeId: 07615
	// TypeInfo:  0x00000001427CC3F0
#ifndef _ToolData_
#define _ToolData_
#pragma pack(push, 8)
	class ToolData : public DataContainer
	{
	public:
		static __inline ToolData* DefaultInstance()
		{
			return (ToolData*)0x00000000463BD440;
		}
		static __inline unsigned int ClassId()
		{
			return 3345;
		}
		bool m_IsAlwaysActive; //0x0010
		char _0x0011[7];
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02915
	// RuntimeId: 04941
	// TypeInfo:  0x000000014278D6B0
#ifndef _GameComponentData_
#define _GameComponentData_
#pragma pack(push, 16)
	class GameComponentData : public ComponentData
	{
	public:
		static __inline GameComponentData* DefaultInstance()
		{
			return (GameComponentData*)0x00000000463AD140;
		}
		static __inline unsigned int ClassId()
		{
			return 2915;
		}
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01395
	// RuntimeId: 07631
	// TypeInfo:  0x00000001427CC150
#ifndef _WeaponModifierBase_
#define _WeaponModifierBase_
#pragma pack(push, 8)
	class WeaponModifierBase : public DataContainer
	{
	public:
		static __inline WeaponModifierBase* DefaultInstance()
		{
			return (WeaponModifierBase*)0x0000000046381410;
		}
		static __inline unsigned int ClassId()
		{
			return 1395;
		}
		__int32 m_ApplyOrder; //0x0010
		char _0x0014[4];
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03451
	// RuntimeId: 07667
	// TypeInfo:  0x00000001427CBCD0
#ifndef _WeaponSwayData_
#define _WeaponSwayData_
#pragma pack(push, 8)
	class WeaponSwayData : public DataContainer
	{
	public:
		static __inline WeaponSwayData* DefaultInstance()
		{
			return (WeaponSwayData*)0x00000000463BF790;
		}
		static __inline unsigned int ClassId()
		{
			return 3451;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01857
	// RuntimeId: 09690
	// TypeInfo:  0x00000001427F8DC0
#ifndef _GunSwayModifierData_
#define _GunSwayModifierData_
#pragma pack(push, 8)
	class GunSwayModifierData : public Asset
	{
	public:
		static __inline GunSwayModifierData* DefaultInstance()
		{
			return (GunSwayModifierData*)0x000000004638B190;
		}
		static __inline unsigned int ClassId()
		{
			return 1857;
		}
		GunSwayStanceZoomModifierData m_StandZoomModifier; //0x0018
		GunSwayStanceZoomModifierData m_StandNoZoomModifier; //0x005C
		GunSwayStanceZoomModifierData m_CrouchZoomModifier; //0x00A0
		GunSwayStanceZoomModifierData m_CrouchNoZoomModifier; //0x00E4
		GunSwayStanceZoomModifierData m_ProneZoomModifier; //0x0128
		GunSwayStanceZoomModifierData m_ProneNoZoomModifier; //0x016C
		bool m_OnlyInSupportedShooting; //0x01B0
		bool m_OnlyOnWeaponLightEnabled; //0x01B1
		char _0x01B2[6];
	};//Size=0x01B8
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03251
	// RuntimeId: 09672
	// TypeInfo:  0x00000001427F8E20
#ifndef _CameraRecoilData_
#define _CameraRecoilData_
#pragma pack(push, 8)
	class CameraRecoilData : public DataContainer
	{
	public:
		static __inline CameraRecoilData* DefaultInstance()
		{
			return (CameraRecoilData*)0x00000000463BB290;
		}
		static __inline unsigned int ClassId()
		{
			return 3251;
		}
		float m_SpringConstant; //0x0010
		float m_SpringDamping; //0x0014
		float m_SpringMinThresholdAngle; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02337
	// RuntimeId: 09664
	// TypeInfo:  0x00000001427F59E0
#ifndef _WeaponLagEntityData_
#define _WeaponLagEntityData_
#pragma pack(push, 8)
	class WeaponLagEntityData : public EntityData
	{
	public:
		static __inline WeaponLagEntityData* DefaultInstance()
		{
			return (WeaponLagEntityData*)0x0000000046396590;
		}
		static __inline unsigned int ClassId()
		{
			return 2337;
		}
		WeaponLagBinding m_Binding; //0x0018
		char _0x007C[4];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03516
	// RuntimeId: 09660
	// TypeInfo:  0x00000001427F5A40
#ifndef _WeaponStateData1p_
#define _WeaponStateData1p_
#pragma pack(push, 8)
	class WeaponStateData1p : public DataContainer
	{
	public:
		static __inline WeaponStateData1p* DefaultInstance()
		{
			return (WeaponStateData1p*)0x00000000463C1020;
		}
		static __inline unsigned int ClassId()
		{
			return 3516;
		}
		Array<WeaponMesh1p> m_WeaponMesh1p; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03155
	// RuntimeId: 09656
	// TypeInfo:  0x00000001427F5AA0
#ifndef _SoldierWeaponBlueprintPipelineSettings_
#define _SoldierWeaponBlueprintPipelineSettings_
#pragma pack(push, 8)
	class SoldierWeaponBlueprintPipelineSettings : public DataContainer
	{
	public:
		static __inline SoldierWeaponBlueprintPipelineSettings* DefaultInstance()
		{
			return (SoldierWeaponBlueprintPipelineSettings*)0x00000000463B8D80;
		}
		static __inline unsigned int ClassId()
		{
			return 3155;
		}
		bool m_DisableOnDemandLoading; //0x0010
		char _0x0011[7];
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03638
	// RuntimeId: 09555
	// TypeInfo:  0x00000001427F6A60
#ifndef _ExplosionPackTrigger_
#define _ExplosionPackTrigger_
#pragma pack(push, 8)
	class ExplosionPackTrigger : public DataContainer
	{
	public:
		static __inline ExplosionPackTrigger* DefaultInstance()
		{
			return (ExplosionPackTrigger*)0x00000000463C3670;
		}
		static __inline unsigned int ClassId()
		{
			return 3638;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02348
	// RuntimeId: 04931
	// TypeInfo:  0x000000014278D890
#ifndef _SpatialEntityData_
#define _SpatialEntityData_
#pragma pack(push, 16)
	class SpatialEntityData : public EntityData
	{
	public:
		static __inline SpatialEntityData* DefaultInstance()
		{
			return (SpatialEntityData*)0x0000000046396990;
		}
		static __inline unsigned int ClassId()
		{
			return 2348;
		}
		char _0x0018[8];
		LinearTransform m_Transform; //0x0020
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01812
	// RuntimeId: 05101
	// TypeInfo:  0x000000014278BCD0
#ifndef _SharedBundleBaseAsset_
#define _SharedBundleBaseAsset_
#pragma pack(push, 8)
	class SharedBundleBaseAsset : public Asset
	{
	public:
		static __inline SharedBundleBaseAsset* DefaultInstance()
		{
			return (SharedBundleBaseAsset*)0x000000004638A2F0;
		}
		static __inline unsigned int ClassId()
		{
			return 1812;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03174
	// RuntimeId: 09335
	// TypeInfo:  0x00000001427F8020
#ifndef _SocketObjectDataBase_
#define _SocketObjectDataBase_
#pragma pack(push, 8)
	class SocketObjectDataBase : public DataContainer
	{
	public:
		static __inline SocketObjectDataBase* DefaultInstance()
		{
			return (SocketObjectDataBase*)0x00000000463B9560;
		}
		static __inline unsigned int ClassId()
		{
			return 3174;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03175
	// RuntimeId: 09644
	// TypeInfo:  0x00000001427F5CE0
#ifndef _WeaponSocketObjectData_
#define _WeaponSocketObjectData_
#pragma pack(push, 8)
	class WeaponSocketObjectData : public SocketObjectDataBase
	{
	public:
		static __inline WeaponSocketObjectData* DefaultInstance()
		{
			return (WeaponSocketObjectData*)0x00000000463B9590;
		}
		static __inline unsigned int ClassId()
		{
			return 3175;
		}
		Asset* m_Used1p; //0x0010
		Asset* m_Used1pZoom; //0x0018
		Asset* m_Used3p; //0x0020
		Asset* m_Used3pZoom; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03176
	// RuntimeId: 09648
	// TypeInfo:  0x00000001427F5C20
#ifndef _WeaponSkinnedSocketObjectData_
#define _WeaponSkinnedSocketObjectData_
#pragma pack(push, 8)
	class WeaponSkinnedSocketObjectData : public WeaponSocketObjectData
	{
	public:
		static __inline WeaponSkinnedSocketObjectData* DefaultInstance()
		{
			return (WeaponSkinnedSocketObjectData*)0x00000000463B95E0;
		}
		static __inline unsigned int ClassId()
		{
			return 3176;
		}
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01406
	// RuntimeId: 09638
	// TypeInfo:  0x00000001427F5D40
#ifndef _CustomWeaponTypeModifier_
#define _CustomWeaponTypeModifier_
#pragma pack(push, 8)
	class CustomWeaponTypeModifier : public WeaponModifierBase
	{
	public:
		static __inline CustomWeaponTypeModifier* DefaultInstance()
		{
			return (CustomWeaponTypeModifier*)0x00000000463816D0;
		}
		static __inline unsigned int ClassId()
		{
			return 1406;
		}
		WeaponData* m_CustomWeaponType; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01407
	// RuntimeId: 09636
	// TypeInfo:  0x00000001427F5DA0
#ifndef _WeaponZoomLevelModifier_
#define _WeaponZoomLevelModifier_
#pragma pack(push, 8)
	class WeaponZoomLevelModifier : public WeaponModifierBase
	{
	public:
		static __inline WeaponZoomLevelModifier* DefaultInstance()
		{
			return (WeaponZoomLevelModifier*)0x0000000046381710;
		}
		static __inline unsigned int ClassId()
		{
			return 1407;
		}
		__int32 m_ZoomLevelIndex; //0x0018
		char _0x001C[4];
		ZoomLevelData* m_ZoomLevel; //0x0020
		WeaponZoomLevelData* m_WeaponZoomLevel; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01408
	// RuntimeId: 09634
	// TypeInfo:  0x00000001427F5E00
#ifndef _WeaponZoomModifier_
#define _WeaponZoomModifier_
#pragma pack(push, 8)
	class WeaponZoomModifier : public WeaponModifierBase
	{
	public:
		static __inline WeaponZoomModifier* DefaultInstance()
		{
			return (WeaponZoomModifier*)0x0000000046381760;
		}
		static __inline unsigned int ClassId()
		{
			return 1408;
		}
		float m_ZoomRenderFov; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01400
	// RuntimeId: 09632
	// TypeInfo:  0x00000001427F5E60
#ifndef _WeaponClassModifier_
#define _WeaponClassModifier_
#pragma pack(push, 8)
	class WeaponClassModifier : public WeaponModifierBase
	{
	public:
		static __inline WeaponClassModifier* DefaultInstance()
		{
			return (WeaponClassModifier*)0x0000000046381540;
		}
		static __inline unsigned int ClassId()
		{
			return 1400;
		}
		WeaponClassEnum m_WeaponClass; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01401
	// RuntimeId: 09630
	// TypeInfo:  0x00000001427F5EC0
#ifndef _WeaponAnimatedFireTypeModifier_
#define _WeaponAnimatedFireTypeModifier_
#pragma pack(push, 8)
	class WeaponAnimatedFireTypeModifier : public WeaponModifierBase
	{
	public:
		static __inline WeaponAnimatedFireTypeModifier* DefaultInstance()
		{
			return (WeaponAnimatedFireTypeModifier*)0x0000000046381580;
		}
		static __inline unsigned int ClassId()
		{
			return 1401;
		}
		AnimatedFireEnum m_AnimatedFireType; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01397
	// RuntimeId: 09628
	// TypeInfo:  0x00000001427F5F20
#ifndef _WeaponAnimTypeModifier_
#define _WeaponAnimTypeModifier_
#pragma pack(push, 8)
	class WeaponAnimTypeModifier : public WeaponModifierBase
	{
	public:
		static __inline WeaponAnimTypeModifier* DefaultInstance()
		{
			return (WeaponAnimTypeModifier*)0x0000000046381480;
		}
		static __inline unsigned int ClassId()
		{
			return 1397;
		}
		WeaponAnimType m_WeaponAnimType; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01409
	// RuntimeId: 09624
	// TypeInfo:  0x00000001427F5F80
#ifndef _WeaponAnimationConfigurationModifier_
#define _WeaponAnimationConfigurationModifier_
#pragma pack(push, 8)
	class WeaponAnimationConfigurationModifier : public WeaponModifierBase
	{
	public:
		static __inline WeaponAnimationConfigurationModifier* DefaultInstance()
		{
			return (WeaponAnimationConfigurationModifier*)0x00000000463817A0;
		}
		static __inline unsigned int ClassId()
		{
			return 1409;
		}
		AnimatedFireEnum m_AnimatedFireType; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02358
	// RuntimeId: 04935
	// TypeInfo:  0x000000014278D7D0
#ifndef _ComponentEntityData_
#define _ComponentEntityData_
#pragma pack(push, 16)
	class ComponentEntityData : public SpatialEntityData
	{
	public:
		static __inline ComponentEntityData* DefaultInstance()
		{
			return (ComponentEntityData*)0x0000000046396FF0;
		}
		static __inline unsigned int ClassId()
		{
			return 2358;
		}
		Array<GameObjectData*> m_Components; //0x0060
		unsigned __int8 m_ClientRuntimeComponentCount; //0x0068
		unsigned __int8 m_ServerRuntimeComponentCount; //0x0069
		unsigned __int8 m_ClientRuntimeTransformationCount; //0x006A
		unsigned __int8 m_ServerRuntimeTransformationCount; //0x006B
		char _0x006C[4];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02359
	// RuntimeId: 04937
	// TypeInfo:  0x000000014278D770
#ifndef _GameComponentEntityData_
#define _GameComponentEntityData_
#pragma pack(push, 16)
	class GameComponentEntityData : public ComponentEntityData
	{
	public:
		static __inline GameComponentEntityData* DefaultInstance()
		{
			return (GameComponentEntityData*)0x0000000046397080;
		}
		static __inline unsigned int ClassId()
		{
			return 2359;
		}
		bool m_Enabled; //0x0070
		char _0x0071[15];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02370
	// RuntimeId: 07963
	// TypeInfo:  0x00000001427D22C0
#ifndef _GamePhysicsEntityData_
#define _GamePhysicsEntityData_
#pragma pack(push, 16)
	class GamePhysicsEntityData : public GameComponentEntityData
	{
	public:
		static __inline GamePhysicsEntityData* DefaultInstance()
		{
			return (GamePhysicsEntityData*)0x0000000046397CC0;
		}
		static __inline unsigned int ClassId()
		{
			return 2370;
		}
		PhysicsEntityData* m_PhysicsData; //0x0080
		char _0x0088[8];
	};//Size=0x0090
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03346
	// RuntimeId: 07617
	// TypeInfo:  0x00000001427CC390
#ifndef _WeaponData_
#define _WeaponData_
#pragma pack(push, 8)
	class WeaponData : public ToolData
	{
	public:
		static __inline WeaponData* DefaultInstance()
		{
			return (WeaponData*)0x00000000463BD470;
		}
		static __inline unsigned int ClassId()
		{
			return 3346;
		}
		bool m_ShowLaserPaintedVehicles; //0x0018
		char _0x0019[7];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01983
	// RuntimeId: 09606
	// TypeInfo:  0x00000001427F6220
#ifndef _SupplyUnitSphereData_
#define _SupplyUnitSphereData_
#pragma pack(push, 8)
	class SupplyUnitSphereData : public DataContainer
	{
	public:
		static __inline SupplyUnitSphereData* DefaultInstance()
		{
			return (SupplyUnitSphereData*)0x000000004638DE80;
		}
		static __inline unsigned int ClassId()
		{
			return 1983;
		}
		float m_Radius; //0x0010
		float m_MaxRadius; //0x0014
		float m_RadiusChangeTime; //0x0018
		float m_SupplyIncSpeed; //0x001C
		float m_InstantRefill; //0x0020
		float m_SupplyPointsRefillSpeed; //0x0024
		float m_SupplyPointsCapacity; //0x0028
		bool m_ForceUseInstantRefill; //0x002C
		bool m_InfiniteCapacity; //0x002D
		char _0x002E[2];
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01985
	// RuntimeId: 09608
	// TypeInfo:  0x00000001427F61C0
#ifndef _HealingSupplyUnitSphereData_
#define _HealingSupplyUnitSphereData_
#pragma pack(push, 8)
	class HealingSupplyUnitSphereData : public SupplyUnitSphereData
	{
	public:
		static __inline HealingSupplyUnitSphereData* DefaultInstance()
		{
			return (HealingSupplyUnitSphereData*)0x000000004638DF20;
		}
		static __inline unsigned int ClassId()
		{
			return 1985;
		}
		float m_DistributeHealingOverTime; //0x0030
		char _0x0034[4];
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01984
	// RuntimeId: 09610
	// TypeInfo:  0x00000001427F6160
#ifndef _AmmoSupplyUnitSphereData_
#define _AmmoSupplyUnitSphereData_
#pragma pack(push, 8)
	class AmmoSupplyUnitSphereData : public SupplyUnitSphereData
	{
	public:
		static __inline AmmoSupplyUnitSphereData* DefaultInstance()
		{
			return (AmmoSupplyUnitSphereData*)0x000000004638DED0;
		}
		static __inline unsigned int ClassId()
		{
			return 1984;
		}
		Array<WeaponClassEnum> m_IgnoredWeaponClasses; //0x0030
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01403
	// RuntimeId: 09604
	// TypeInfo:  0x00000001427F6280
#ifndef _WeaponAimingSimulationModifier_
#define _WeaponAimingSimulationModifier_
#pragma pack(push, 8)
	class WeaponAimingSimulationModifier : public WeaponModifierBase
	{
	public:
		static __inline WeaponAimingSimulationModifier* DefaultInstance()
		{
			return (WeaponAimingSimulationModifier*)0x0000000046381600;
		}
		static __inline unsigned int ClassId()
		{
			return 1403;
		}
		SoldierAimingSimulationData* m_AimingController; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03083
	// RuntimeId: 09602
	// TypeInfo:  0x00000001427F62E0
#ifndef _SoldierAimingSimulationData_
#define _SoldierAimingSimulationData_
#pragma pack(push, 8)
	class SoldierAimingSimulationData : public GameDataContainer
	{
	public:
		static __inline SoldierAimingSimulationData* DefaultInstance()
		{
			return (SoldierAimingSimulationData*)0x00000000463B6E50;
		}
		static __inline unsigned int ClassId()
		{
			return 3083;
		}
		Array<ZoomLevelData*> m_ZoomLevels; //0x0010
		SoldierAimAssistData* m_AimAssist; //0x0018
		AimingPoseData m_StandPose; //0x0020
		AimingPoseData m_CrouchPose; //0x0038
		AimingPoseData m_PronePose; //0x0050
		float m_ZoomTransitionTime; //0x0068
		char _0x006C[4];
		Array<ZoomLevelSpecificTransitionTime> m_ZoomTransitionTimeArray; //0x0070
		float m_FovDelayTime; //0x0078
		float m_FovTransitionTime; //0x007C
		float m_AimingRange; //0x0080
		float m_LockAimToTargetSpeed; //0x0084
		Array<AimerModifierData*> m_Modifiers; //0x0088
		bool m_ReturnToZoomAfterReload; //0x0090
		char _0x0091[7];
	};//Size=0x0098
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03182
	// RuntimeId: 09600
	// TypeInfo:  0x00000001427F6340
#ifndef _ZoomLevelData_
#define _ZoomLevelData_
#pragma pack(push, 8)
	class ZoomLevelData : public DataContainer
	{
	public:
		static __inline ZoomLevelData* DefaultInstance()
		{
			return (ZoomLevelData*)0x00000000463B97E0;
		}
		static __inline unsigned int ClassId()
		{
			return 3182;
		}
		float m_FieldOfView; //0x0010
		float m_FieldOfViewSP; //0x0014
		FOVTransitionData* m_FieldOfViewTransition; //0x0018
		float m_LookSpeedMultiplier; //0x0020
		float m_SprintLookSpeedMultiplier; //0x0024
		float m_MoveSpeedMultiplier; //0x0028
		float m_SwayPitchMagnitude; //0x002C
		float m_SwayYawMagnitude; //0x0030
		float m_SupportedSwayPitchMagnitude; //0x0034
		float m_SupportedSwayYawMagnitude; //0x0038
		float m_SuppressedSwayPitchMagnitude; //0x003C
		float m_SuppressedSwayYawMagnitude; //0x0040
		float m_SuppressedSwayMinFactor; //0x0044
		float m_TimePitchMultiplier; //0x0048
		float m_TimeYawMultiplier; //0x004C
		float m_DispersionMultiplier; //0x0050
		float m_DispersionRotation; //0x0054
		float m_RecoilMultiplier; //0x0058
		float m_RecoilFovMultiplier; //0x005C
		float m_CameraImpulseMultiplier; //0x0060
		float m_StartFadeToBlackAtTime; //0x0064
		float m_FadeToBlackDuration; //0x0068
		float m_StartFadeFromBlackAtTime; //0x006C
		float m_FadeFromBlackDuration; //0x0070
		float m_ScreenExposureAreaScale; //0x0074
		ZoomLevelActivateEventType m_OnActivateEventType; //0x0078
		float m_AttractYawStrength; //0x007C
		float m_AttractPitchStrength; //0x0080
		bool m_AllowFieldOfViewScaling; //0x0084
		bool m_FadeToBlackInZoomTransition; //0x0085
		bool m_UseFovSpecialisation; //0x0086
		bool m_UseWeaponMeshZoom1p; //0x0087
	};//Size=0x0088
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02105
	// RuntimeId: 09594
	// TypeInfo:  0x00000001427F63A0
#ifndef _SoldierAimAssistData_
#define _SoldierAimAssistData_
#pragma pack(push, 16)
	class SoldierAimAssistData : public GameDataContainer
	{
	public:
		static __inline SoldierAimAssistData* DefaultInstance()
		{
			return (SoldierAimAssistData*)0x0000000046390770;
		}
		static __inline unsigned int ClassId()
		{
			return 2105;
		}
		Array<float> m_InputPolynomial; //0x0010
		Array<float> m_ZoomedInputPolynomial; //0x0018
		Vec3 m_StickyBoxScale; //0x0020
		Vec3 m_StickyDistanceScale; //0x0030
		Vec3 m_SnapBoxScale; //0x0040
		Vec3 m_SnapDistanceScale; //0x0050
		Vec3 m_EyePosOffset; //0x0060
		float m_AccelerationInputThreshold; //0x0070
		float m_AccelerationMultiplier; //0x0074
		float m_AccelerationDamping; //0x0078
		float m_AccelerationTimeThreshold; //0x007C
		float m_SquaredAcceleration; //0x0080
		Vec2 m_MaxAcceleration; //0x0084
		float m_YawSpeedStrength; //0x008C
		float m_PitchSpeedStrength; //0x0090
		Vec2 m_AttractDistanceFallOffs; //0x0094
		float m_AttractSoftZone; //0x009C
		float m_AttractUserInputMultiplier; //0x00A0
		float m_AttractUserInputMultiplier_NoZoom; //0x00A4
		float m_AttractOwnSpeedInfluence; //0x00A8
		float m_AttractTargetSpeedInfluence; //0x00AC
		float m_AttractOwnRequiredMovementForMaximumAttract; //0x00B0
		float m_AttractStartInputThreshold; //0x00B4
		float m_AttractMoveInputCap; //0x00B8
		float m_AttractYawStrength; //0x00BC
		float m_AttractPitchStrength; //0x00C0
		float m_MaxToTargetAngle; //0x00C4
		float m_MaxToTargetXZAngle; //0x00C8
		float m_ViewObstructedKeepTime; //0x00CC
		float m_SnapZoomLateralSpeedLimit; //0x00D0
		float m_SnapZoomTime; //0x00D4
		float m_SnapZoomPostTimeNoInput; //0x00D8
		float m_SnapZoomPostTime; //0x00DC
		unsigned __int32 m_SnapZoomReticlePointPriority; //0x00E0
		float m_SnapZoomAutoEngageTime; //0x00E4
		float m_SnapZoomBreakTimeAtMaxInput; //0x00E8
		float m_SnapZoomBreakMaxInput; //0x00EC
		float m_SnapZoomBreakMinAngle; //0x00F0
		float m_SnapZoomSpamGuardTime; //0x00F4
		SkeletonCollisionData* m_SoldierBackupSkeletonCollisionData; //0x00F8
		float m_CheckBoneCenterOnlyDistance; //0x0100
		float m_DisableForcedTargetRecalcDistance; //0x0104
		float m_OverrideAimingRange; //0x0108
		float m_OverrideAimingRangeCrouch; //0x010C
		float m_OverrideAimingRangeProne; //0x0110
		bool m_UseYawAcceleration; //0x0114
		bool m_UsePitchAcceleration; //0x0115
		bool m_SnapZoomUserShorterWeaponTime; //0x0116
		bool m_SnapZoomPostTimeDynamicPoint; //0x0117
		bool m_ForceSoldierBackupSkeletonCollisionUse; //0x0118
		char _0x0119[7];
	};//Size=0x0120
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03357
	// RuntimeId: 09592
	// TypeInfo:  0x00000001427F6400
#ifndef _ThrowAtTargetWeaponData_
#define _ThrowAtTargetWeaponData_
#pragma pack(push, 8)
	class ThrowAtTargetWeaponData : public WeaponData
	{
	public:
		static __inline ThrowAtTargetWeaponData* DefaultInstance()
		{
			return (ThrowAtTargetWeaponData*)0x00000000463BD8C0;
		}
		static __inline unsigned int ClassId()
		{
			return 3357;
		}
		float m_DefaultPowerModifier; //0x0020
		float m_ThrowToSoldierDistance; //0x0024
		float m_MaxTravelTime; //0x0028
		float m_MinTravelTime; //0x002C
		float m_MaxQueryAngle; //0x0030
		float m_MaxAimAdjustmentAngle; //0x0034
		float m_WeightCurrentDistance; //0x0038
		float m_WeightTargetDistance; //0x003C
		float m_WeightCurrentAngle; //0x0040
		float m_WeightTargetAngle; //0x0044
		bool m_ClampMaximumVelocity; //0x0048
		char _0x0049[7];
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03359
	// RuntimeId: 09590
	// TypeInfo:  0x00000001427F6460
#ifndef _MeleeWeaponData_
#define _MeleeWeaponData_
#pragma pack(push, 8)
	class MeleeWeaponData : public WeaponData
	{
	public:
		static __inline MeleeWeaponData* DefaultInstance()
		{
			return (MeleeWeaponData*)0x00000000463BD980;
		}
		static __inline unsigned int ClassId()
		{
			return 3359;
		}
		bool m_UseCannedAnimation; //0x0020
		bool m_UseSphereDamage; //0x0021
		char _0x0022[6];
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03363
	// RuntimeId: 09588
	// TypeInfo:  0x00000001427F64C0
#ifndef _FlashlightWeaponData_
#define _FlashlightWeaponData_
#pragma pack(push, 8)
	class FlashlightWeaponData : public WeaponData
	{
	public:
		static __inline FlashlightWeaponData* DefaultInstance()
		{
			return (FlashlightWeaponData*)0x00000000463BDA90;
		}
		static __inline unsigned int ClassId()
		{
			return 3363;
		}
		float m_UpdateFrequency; //0x0020
		float m_Range; //0x0024
		float m_Angle; //0x0028
		char _0x002C[4];
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03355
	// RuntimeId: 09585
	// TypeInfo:  0x00000001427F6520
#ifndef _DefibrillatorWeaponData_
#define _DefibrillatorWeaponData_
#pragma pack(push, 8)
	class DefibrillatorWeaponData : public WeaponData
	{
	public:
		static __inline DefibrillatorWeaponData* DefaultInstance()
		{
			return (DefibrillatorWeaponData*)0x00000000463BD7A0;
		}
		static __inline unsigned int ClassId()
		{
			return 3355;
		}
		float m_AttackTime; //0x0020
		float m_FullHealthTime; //0x0024
		float m_InitialStartHealth; //0x0028
		float m_MaxAngleToVictimXZ; //0x002C
		float m_DefibActionCooldownTime; //0x0030
		float m_MaxClientBodyDistance; //0x0034
		DefibrillatorUpgradeWeaponData m_UpgradeWeaponData; //0x0038
		bool m_ClientSideRevive; //0x0050
		char _0x0051[7];
	};//Size=0x0058
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03367
	// RuntimeId: 09579
	// TypeInfo:  0x00000001427F65E0
#ifndef _PowerToolWeaponData_
#define _PowerToolWeaponData_
#pragma pack(push, 8)
	class PowerToolWeaponData : public WeaponData
	{
	public:
		static __inline PowerToolWeaponData* DefaultInstance()
		{
			return (PowerToolWeaponData*)0x00000000463BDBE0;
		}
		static __inline unsigned int ClassId()
		{
			return 3367;
		}
		SoundAsset* m_RepairSound; //0x0020
		SoundAsset* m_RepairCompletedSound; //0x0028
		SoundAsset* m_DamageSound; //0x0030
		MaterialDecl m_RepairMaterialPair; //0x0038
		bool m_PlayFireEffectOnRepairOnly; //0x003C
		char _0x003D[3];
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03368
	// RuntimeId: 09581
	// TypeInfo:  0x00000001427F6580
#ifndef _RepairToolWeaponData_
#define _RepairToolWeaponData_
#pragma pack(push, 8)
	class RepairToolWeaponData : public PowerToolWeaponData
	{
	public:
		static __inline RepairToolWeaponData* DefaultInstance()
		{
			return (RepairToolWeaponData*)0x00000000463BDC40;
		}
		static __inline unsigned int ClassId()
		{
			return 3368;
		}
		float m_RechargeSpeed; //0x0040
		char _0x0044[4];
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03358
	// RuntimeId: 09577
	// TypeInfo:  0x00000001427F6640
#ifndef _MedicBagHealingSphereWeaponData_
#define _MedicBagHealingSphereWeaponData_
#pragma pack(push, 8)
	class MedicBagHealingSphereWeaponData : public WeaponData
	{
	public:
		static __inline MedicBagHealingSphereWeaponData* DefaultInstance()
		{
			return (MedicBagHealingSphereWeaponData*)0x00000000463BD930;
		}
		static __inline unsigned int ClassId()
		{
			return 3358;
		}
		HealingSphereData m_Healer; //0x0020
		float m_HealthPointsRefillSpeed; //0x0028
		float m_HealthPointsPerBag; //0x002C
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03360
	// RuntimeId: 09575
	// TypeInfo:  0x00000001427F66A0
#ifndef _MedkitWeaponData_
#define _MedkitWeaponData_
#pragma pack(push, 8)
	class MedkitWeaponData : public WeaponData
	{
	public:
		static __inline MedkitWeaponData* DefaultInstance()
		{
			return (MedkitWeaponData*)0x00000000463BD9C0;
		}
		static __inline unsigned int ClassId()
		{
			return 3360;
		}
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03348
	// RuntimeId: 09573
	// TypeInfo:  0x00000001427F6700
#ifndef _DetonatedWeaponData_
#define _DetonatedWeaponData_
#pragma pack(push, 8)
	class DetonatedWeaponData : public WeaponData
	{
	public:
		static __inline DetonatedWeaponData* DefaultInstance()
		{
			return (DetonatedWeaponData*)0x00000000463BD500;
		}
		static __inline unsigned int ClassId()
		{
			return 3348;
		}
		LockingControllerData* m_LockingController; //0x0020
		float m_Range; //0x0028
		char _0x002C[4];
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02371
	// RuntimeId: 07545
	// TypeInfo:  0x00000001427CC810
#ifndef _ProjectileEntityData_
#define _ProjectileEntityData_
#pragma pack(push, 16)
	class ProjectileEntityData : public GamePhysicsEntityData
	{
	public:
		static __inline ProjectileEntityData* DefaultInstance()
		{
			return (ProjectileEntityData*)0x0000000046397D70;
		}
		static __inline unsigned int ClassId()
		{
			return 2371;
		}
		float m_InitialSpeed; //0x0090
		float m_TimeToLive; //0x0094
		unsigned __int32 m_MaxCount; //0x0098
		float m_InitMeshHideTime; //0x009C
		float m_VisualConvergeDistance; //0x00A0
		float m_VisualConvergenceDelay; //0x00A4
		float m_VisualConvergenceDuration; //0x00A8
		float m_ProxyVisualConvergenceDelay; //0x00AC
		float m_ProxyVisualConvergenceDuration; //0x00B0
		char _0x00B4[4];
		ExplosionEntityData* m_Explosion; //0x00B8
		WeaponSuppressionData* m_SuppressionData; //0x00C0
		char* m_AmmunitionType; //0x00C8
		MaterialDecl m_MaterialPair; //0x00D0
		AntHitReactionWeaponType m_HitReactionWeaponType; //0x00D4
		bool m_DetonateOnTimeout; //0x00D8
		bool m_ServerProjectileDisabled; //0x00D9
		bool m_HideOnDetonation; //0x00DA
		char _0x00DB[5];
	};//Size=0x00E0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02901
	// RuntimeId: 07959
	// TypeInfo:  0x00000001427D2380
#ifndef _HealthComponentData_
#define _HealthComponentData_
#pragma pack(push, 16)
	class HealthComponentData : public ComponentData
	{
	public:
		static __inline HealthComponentData* DefaultInstance()
		{
			return (HealthComponentData*)0x00000000463AC8D0;
		}
		static __inline unsigned int ClassId()
		{
			return 2901;
		}
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02881
	// RuntimeId: 07957
	// TypeInfo:  0x00000001427D23E0
#ifndef _PhysicsComponentData_
#define _PhysicsComponentData_
#pragma pack(push, 16)
	class PhysicsComponentData : public ComponentData
	{
	public:
		static __inline PhysicsComponentData* DefaultInstance()
		{
			return (PhysicsComponentData*)0x00000000463ABC40;
		}
		static __inline unsigned int ClassId()
		{
			return 2881;
		}
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02373
	// RuntimeId: 07549
	// TypeInfo:  0x00000001427CC750
#ifndef _MeshProjectileEntityData_
#define _MeshProjectileEntityData_
#pragma pack(push, 16)
	class MeshProjectileEntityData : public ProjectileEntityData
	{
	public:
		static __inline MeshProjectileEntityData* DefaultInstance()
		{
			return (MeshProjectileEntityData*)0x0000000046397F90;
		}
		static __inline unsigned int ClassId()
		{
			return 2373;
		}
		Vec3 m_InitialAngularVelocity; //0x00E0
		MeshAsset* m_Mesh; //0x00F0
		EffectBlueprint* m_TrailEffect; //0x00F8
		float m_InstantAttachableTestDistance; //0x0100
		float m_InstantAttachableVisualConvergenceDelay; //0x0104
		float m_InstantAttachableVisualConvergenceDuration; //0x0108
		float m_MaxAttachableInclination; //0x010C
		float m_UnspawnAfterDetonationDelay; //0x0110
		bool m_IsAttachable; //0x0114
		bool m_InstantAttachableTestUnderReticule; //0x0115
		bool m_ExtraDamping; //0x0116
		char _0x0117[9];
	};//Size=0x0120
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03640
	// RuntimeId: 09563
	// TypeInfo:  0x00000001427F68E0
#ifndef _ExplosionPackRemoteDetonatorTrigger_
#define _ExplosionPackRemoteDetonatorTrigger_
#pragma pack(push, 8)
	class ExplosionPackRemoteDetonatorTrigger : public ExplosionPackTrigger
	{
	public:
		static __inline ExplosionPackRemoteDetonatorTrigger* DefaultInstance()
		{
			return (ExplosionPackRemoteDetonatorTrigger*)0x00000000463C36D0;
		}
		static __inline unsigned int ClassId()
		{
			return 3640;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03639
	// RuntimeId: 09561
	// TypeInfo:  0x00000001427F6940
#ifndef _ExplosionPackInfantryTrigger_
#define _ExplosionPackInfantryTrigger_
#pragma pack(push, 8)
	class ExplosionPackInfantryTrigger : public ExplosionPackTrigger
	{
	public:
		static __inline ExplosionPackInfantryTrigger* DefaultInstance()
		{
			return (ExplosionPackInfantryTrigger*)0x00000000463C36A0;
		}
		static __inline unsigned int ClassId()
		{
			return 3639;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03643
	// RuntimeId: 09559
	// TypeInfo:  0x00000001427F69A0
#ifndef _ExplosionPackVehicleRayTrigger_
#define _ExplosionPackVehicleRayTrigger_
#pragma pack(push, 8)
	class ExplosionPackVehicleRayTrigger : public ExplosionPackTrigger
	{
	public:
		static __inline ExplosionPackVehicleRayTrigger* DefaultInstance()
		{
			return (ExplosionPackVehicleRayTrigger*)0x00000000463C3770;
		}
		static __inline unsigned int ClassId()
		{
			return 3643;
		}
		float m_ActivationDelay; //0x0010
		float m_Distance; //0x0014
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03642
	// RuntimeId: 09557
	// TypeInfo:  0x00000001427F6A00
#ifndef _ExplosionPackVehicleProximityTrigger_
#define _ExplosionPackVehicleProximityTrigger_
#pragma pack(push, 8)
	class ExplosionPackVehicleProximityTrigger : public ExplosionPackTrigger
	{
	public:
		static __inline ExplosionPackVehicleProximityTrigger* DefaultInstance()
		{
			return (ExplosionPackVehicleProximityTrigger*)0x00000000463C3730;
		}
		static __inline unsigned int ClassId()
		{
			return 3642;
		}
		float m_ActivationDelay; //0x0010
		float m_Radius; //0x0014
		bool m_UseDetailedCollisionCheck; //0x0018
		char _0x0019[7];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03641
	// RuntimeId: 09654
	// TypeInfo:  0x00000001427F5B00
#ifndef _ExplosionPackTripwireTrigger_
#define _ExplosionPackTripwireTrigger_
#pragma pack(push, 8)
	class ExplosionPackTripwireTrigger : public ExplosionPackTrigger
	{
	public:
		static __inline ExplosionPackTripwireTrigger* DefaultInstance()
		{
			return (ExplosionPackTripwireTrigger*)0x00000000463C3700;
		}
		static __inline unsigned int ClassId()
		{
			return 3641;
		}
		TripwireEntityData* m_Tripwire; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02902
	// RuntimeId: 06991
	// TypeInfo:  0x00000001427BEC30
#ifndef _GameHealthComponentData_
#define _GameHealthComponentData_
#pragma pack(push, 16)
	class GameHealthComponentData : public HealthComponentData
	{
	public:
		static __inline GameHealthComponentData* DefaultInstance()
		{
			return (GameHealthComponentData*)0x00000000463AC960;
		}
		static __inline unsigned int ClassId()
		{
			return 2902;
		}
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02882
	// RuntimeId: 06985
	// TypeInfo:  0x00000001427BED50
#ifndef _GamePhysicsComponentData_
#define _GamePhysicsComponentData_
#pragma pack(push, 16)
	class GamePhysicsComponentData : public PhysicsComponentData
	{
	public:
		static __inline GamePhysicsComponentData* DefaultInstance()
		{
			return (GamePhysicsComponentData*)0x00000000463ABCD0;
		}
		static __inline unsigned int ClassId()
		{
			return 2882;
		}
		Realm m_Realm; //0x0070
		char _0x0074[4];
		Array<EffectParameter*> m_EffectParameters; //0x0078
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02366
	// RuntimeId: 09524
	// TypeInfo:  0x00000001427F6CA0
#ifndef _WeaponEntityData_
#define _WeaponEntityData_
#pragma pack(push, 16)
	class WeaponEntityData : public GameComponentEntityData
	{
	public:
		static __inline WeaponEntityData* DefaultInstance()
		{
			return (WeaponEntityData*)0x00000000463977C0;
		}
		static __inline unsigned int ClassId()
		{
			return 2366;
		}
		WeaponClassEnum m_WeaponClass; //0x0080
		char _0x0084[4];
		Array<WeaponStateData> m_WeaponStates; //0x0088
		WeaponFiringData* m_WeaponFiring; //0x0090
		WeaponData* m_CustomWeaponType; //0x0098
		GameAIWeaponData* m_AIData; //0x00A0
		char _0x00A8[8];
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03303
	// RuntimeId: 09538
	// TypeInfo:  0x00000001427F6BE0
#ifndef _WeaponZoomLevelData_
#define _WeaponZoomLevelData_
#pragma pack(push, 8)
	class WeaponZoomLevelData : public DataContainer
	{
	public:
		static __inline WeaponZoomLevelData* DefaultInstance()
		{
			return (WeaponZoomLevelData*)0x00000000463BC350;
		}
		static __inline unsigned int ClassId()
		{
			return 3303;
		}
		float m_RenderFov; //0x0010
		char _0x0014[4];
		FOVTransitionData* m_RenderFovTransition; //0x0018
		Array<float> m_ZoomInOutMeshTransitionFactors; //0x0020
		float m_ZoomDisabledTransitionTimer; //0x0028
		SightType m_SightType; //0x002C
		WeaponAnimationSettingsData m_AnimationSettings; //0x0030
		char _0x004C[4];
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03615
	// RuntimeId: 09532
	// TypeInfo:  0x00000001427F6C40
#ifndef _WeaponOverrideData_
#define _WeaponOverrideData_
#pragma pack(push, 8)
	class WeaponOverrideData : public DataContainer
	{
	public:
		static __inline WeaponOverrideData* DefaultInstance()
		{
			return (WeaponOverrideData*)0x00000000463C2FF0;
		}
		static __inline unsigned int ClassId()
		{
			return 3615;
		}
		DataContainer* m_Data; //0x0010
		Array<WeaponOverrideValue> m_Values; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02367
	// RuntimeId: 09542
	// TypeInfo:  0x00000001427F6B80
#ifndef _SoldierWeaponData_
#define _SoldierWeaponData_
#pragma pack(push, 16)
	class SoldierWeaponData : public WeaponEntityData
	{
	public:
		static __inline SoldierWeaponData* DefaultInstance()
		{
			return (SoldierWeaponData*)0x0000000046397890;
		}
		static __inline unsigned int ClassId()
		{
			return 2367;
		}
		PickupSettingsData m_PickupSettings; //0x00B0
		Vec3 m_InteractionOffset; //0x00D0
		CustomizationAccessoryPivots m_CustomizationAccessoryPivots; //0x00E0
		char* m_DamageGiverName; //0x0130
		Array<WeaponZoomLevelData*> m_ZoomLevels; //0x0138
		Array<WeaponModifierData> m_WeaponModifierData; //0x0140
		SoldierAimingSimulationData* m_AimingController; //0x0148
		FirstPersonCameraData* m_FirstPersonCamera; //0x0150
		HudData m_Hud; //0x0158
		WeaponAnimBaseSetEnum m_AnimBaseSet; //0x01C8
		QuickThrowTypeEnum m_QuickThrowType; //0x01CC
		SoldierWeaponBlueprint* m_SoldierWeaponBlueprint; //0x01D0
		char* m_PersistenceId; //0x01D8
		__int32 m_SecondaryActionInputAction; //0x01E0
		char _0x01E4[4];
		EntityVoiceOverInfo* m_VoiceOverInfo; //0x01E8
		float m_WeaponFloatParam; //0x01F0
		float m_MaxRangeMeterDistance; //0x01F4
		Array<SocketData*> m_SocketsInWeapon; //0x01F8
		bool m_HideWhenOutOfAmmo; //0x0200
		bool m_AllowSwitchingToWeaponOutOfAmmo; //0x0201
		bool m_AllowSwitchingToWeaponReloading; //0x0202
		bool m_SwitchToPrimaryWhenOutOfAmmo; //0x0203
		bool m_WaitForFireBeforeSwitchToPrimaryWhenOutOfAmmo; //0x0204
		bool m_FireAndSwitchBackToPrevSupported; //0x0205
		bool m_AllowSwitchingToWeaponInVehicles; //0x0206
		bool m_AllowSwitchingToWeaponInWater; //0x0207
		bool m_LowerOnOwnTeam; //0x0208
		bool m_RedeployWhenSwitchingWeaponStates; //0x0209
		bool m_UseQuickThrowOnAutomaticSwitchback; //0x020A
		bool m_EnableBreathControl; //0x020B
		bool m_CanBeInSupportedShooting; //0x020C
		bool m_UseDetailedRangeMeterQuery; //0x020D
		bool m_IsSilenced; //0x020E
		bool m_SkipFirstZoomLevel; //0x020F
	};//Size=0x0210
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02944
	// RuntimeId: 09522
	// TypeInfo:  0x00000001427F6D00
#ifndef _SoldierWeaponsComponentData_
#define _SoldierWeaponsComponentData_
#pragma pack(push, 16)
	class SoldierWeaponsComponentData : public GameComponentData
	{
	public:
		static __inline SoldierWeaponsComponentData* DefaultInstance()
		{
			return (SoldierWeaponsComponentData*)0x00000000463AEAE0;
		}
		static __inline unsigned int ClassId()
		{
			return 2944;
		}
		LinearTransform m_AimDir; //0x0070
		__int32 m_PrimaryWeaponId; //0x00B0
		char _0x00B4[4];
		SoldierAimingSimulationData* m_DefaultAimingController; //0x00B8
		AnimatedWeaponBinding m_AnimatedWeaponBinding; //0x00C0
		Animated1pOnlyWeaponBinding m_Animated1pOnlyWeaponBinding; //0x0638
		Animated3pOnlyWeaponBinding m_Animated3pOnlyWeaponBinding; //0x0688
		char _0x06C4[4];
		SkeletonAsset* m_WeaponSkeleton; //0x06C8
		float m_AmmoClipIncreaseMultiplier; //0x06D0
		__int32 m_GrenadeIncrease; //0x06D4
		__int32 m_UnderslungGrenadeIncrease; //0x06D8
		float m_ExplosiveIncreaseMultiplier; //0x06DC
		PickupEntityAsset* m_DropWeaponPickup; //0x06E0
		bool m_UseExternalAimDir; //0x06E8
		bool m_UnlimitedAmmo; //0x06E9
		bool m_UnlimitedMags; //0x06EA
		bool m_IsOwnedByAI; //0x06EB
		char _0x06EC[4];
	};//Size=0x06F0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02010
	// RuntimeId: 09504
	// TypeInfo:  0x00000001427F6D60
#ifndef _FirstPersonCameraData_
#define _FirstPersonCameraData_
#pragma pack(push, 16)
	class FirstPersonCameraData : public DataContainer
	{
	public:
		static __inline FirstPersonCameraData* DefaultInstance()
		{
			return (FirstPersonCameraData*)0x000000004638E800;
		}
		static __inline unsigned int ClassId()
		{
			return 2010;
		}
		WeaponLagSpringEffectData* m_WeaponSpringEffect; //0x0010
		WeaponLagSpringEffectData* m_CameraSpringEffect; //0x0018
		Vec3 m_Offset; //0x0020
		Vec3 m_WeaponBaseOffset; //0x0030
		Vec3 m_WeaponLagRotationOffset; //0x0040
		Vec3 m_Rotation; //0x0050
		float m_MoveStrafeModifier; //0x0060
		float m_MoveForwardModifier; //0x0064
		float m_RotateYawModifier; //0x0068
		float m_RotatePitchModifier; //0x006C
		float m_RotateRollModifier; //0x0070
		float m_ZoomMoveStrafeModifier; //0x0074
		float m_ZoomMoveForwardModifier; //0x0078
		float m_ZoomRotateYawModifier; //0x007C
		float m_ZoomRotatePitchModifier; //0x0080
		float m_ZoomRotateRollModifier; //0x0084
		float m_ReleaseModifier; //0x0088
		float m_ReleaseModifierPitch; //0x008C
		float m_ReleaseModifierYaw; //0x0090
		float m_ReleaseModifierRoll; //0x0094
		float m_OffsetReleaseModifier; //0x0098
		float m_ZoomReleaseModifierPitch; //0x009C
		float m_ZoomReleaseModifierYaw; //0x00A0
		float m_ZoomReleaseModifierRoll; //0x00A4
		float m_ZoomOffsetReleaseModifier; //0x00A8
		float m_RotationAdditionToOffset; //0x00AC
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03583
	// RuntimeId: 09502
	// TypeInfo:  0x00000001427F6DC0
#ifndef _WeaponLagSpringEffectData_
#define _WeaponLagSpringEffectData_
#pragma pack(push, 16)
	class WeaponLagSpringEffectData : public DataContainer
	{
	public:
		static __inline WeaponLagSpringEffectData* DefaultInstance()
		{
			return (WeaponLagSpringEffectData*)0x00000000463C2690;
		}
		static __inline unsigned int ClassId()
		{
			return 3583;
		}
		WeaponLagEffectSpringVector m_OffsetSprings; //0x0010
		char _0x0028[8];
		WeaponLagEffectForceData m_JumpForces; //0x0030
		WeaponLagEffectForceData m_LandForces; //0x0050
		WeaponLagEffectForceData m_PoseUpForces; //0x0070
		WeaponLagEffectForceData m_PoseDownForces; //0x0090
		WeaponLagEffectSpringVector m_RotationSprings; //0x00B0
		float m_ZoomForceModifier; //0x00C8
		char _0x00CC[4];
	};//Size=0x00D0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03443
	// RuntimeId: 09494
	// TypeInfo:  0x00000001427F6E20
#ifndef _WeaponSpeedData_
#define _WeaponSpeedData_
#pragma pack(push, 8)
	class WeaponSpeedData : public DataContainer
	{
	public:
		static __inline WeaponSpeedData* DefaultInstance()
		{
			return (WeaponSpeedData*)0x00000000463BF4F0;
		}
		static __inline unsigned int ClassId()
		{
			return 3443;
		}
		float m_ZoomOutSpeed; //0x0010
		float m_ZoomInSpeed; //0x0014
		float m_UnDeploySpeed; //0x0018
		float m_DeploySpeed; //0x001C
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03850
	// RuntimeId: 09492
	// TypeInfo:  0x00000001427F6E80
#ifndef _WeaponOffsetData_
#define _WeaponOffsetData_
#pragma pack(push, 8)
	class WeaponOffsetData : public DataContainer
	{
	public:
		static __inline WeaponOffsetData* DefaultInstance()
		{
			return (WeaponOffsetData*)0x00000000463C8900;
		}
		static __inline unsigned int ClassId()
		{
			return 3850;
		}
		float m_WeaponOffsetX; //0x0010
		float m_WeaponOffsetY; //0x0014
		float m_WeaponOffsetZ; //0x0018
		float m_WeaponZoomedOffsetX; //0x001C
		float m_WeaponZoomedOffsetY; //0x0020
		float m_WeaponZoomedOffsetZ; //0x0024
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01738
	// RuntimeId: 09486
	// TypeInfo:  0x00000001427F6EE0
#ifndef _AimerModifierData_
#define _AimerModifierData_
#pragma pack(push, 8)
	class AimerModifierData : public Asset
	{
	public:
		static __inline AimerModifierData* DefaultInstance()
		{
			return (AimerModifierData*)0x00000000463884E0;
		}
		static __inline unsigned int ClassId()
		{
			return 1738;
		}
		float m_LookSpeedMultiplier; //0x0018
		bool m_OnlyInSupportedShooting; //0x001C
		char _0x001D[3];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01742
	// RuntimeId: 04945
	// TypeInfo:  0x000000014278D5F0
#ifndef _DataContainerPolicyAsset_
#define _DataContainerPolicyAsset_
#pragma pack(push, 8)
	class DataContainerPolicyAsset : public Asset
	{
	public:
		static __inline DataContainerPolicyAsset* DefaultInstance()
		{
			return (DataContainerPolicyAsset*)0x0000000046388600;
		}
		static __inline unsigned int ClassId()
		{
			return 1742;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01744
	// RuntimeId: 07375
	// TypeInfo:  0x00000001427C74E0
#ifndef _UnlockAssetBase_
#define _UnlockAssetBase_
#pragma pack(push, 8)
	class UnlockAssetBase : public DataContainerPolicyAsset
	{
	public:
		static __inline UnlockAssetBase* DefaultInstance()
		{
			return (UnlockAssetBase*)0x00000000463886B0;
		}
		static __inline unsigned int ClassId()
		{
			return 1744;
		}
		UnlockUserDataBase* m_UnlockUserData; //0x0018
		char* m_DebugUnlockId; //0x0020
		unsigned __int32 m_Identifier; //0x0028
		unsigned __int32 m_UnlockScore; //0x002C
		UnlockAssetBase* m_NextLevelUnlockAsset; //0x0030
		UnlockAvailability m_AvailableForPlayer; //0x0038
		bool m_AutoAvailable; //0x003C
		bool m_HiddenInProgression; //0x003D
		char _0x003E[2];
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01759
	// RuntimeId: 07371
	// TypeInfo:  0x00000001427C7540
#ifndef _UnlockUserDataBase_
#define _UnlockUserDataBase_
#pragma pack(push, 8)
	class UnlockUserDataBase : public DataContainerPolicyAsset
	{
	public:
		static __inline UnlockUserDataBase* DefaultInstance()
		{
			return (UnlockUserDataBase*)0x0000000046388DD0;
		}
		static __inline unsigned int ClassId()
		{
			return 1759;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02449
	// RuntimeId: 07197
	// TypeInfo:  0x00000001427C8A40
#ifndef _TriggerEntityData_
#define _TriggerEntityData_
#pragma pack(push, 16)
	class TriggerEntityData : public SpatialEntityData
	{
	public:
		static __inline TriggerEntityData* DefaultInstance()
		{
			return (TriggerEntityData*)0x000000004639C940;
		}
		static __inline unsigned int ClassId()
		{
			return 2449;
		}
		float m_Delay; //0x0060
		bool m_RunOnce; //0x0064
		bool m_Enabled; //0x0065
		char _0x0066[10];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02451
	// RuntimeId: 07207
	// TypeInfo:  0x00000001427C88C0
#ifndef _TriggerEventEntityData_
#define _TriggerEventEntityData_
#pragma pack(push, 16)
	class TriggerEventEntityData : public TriggerEntityData
	{
	public:
		static __inline TriggerEventEntityData* DefaultInstance()
		{
			return (TriggerEventEntityData*)0x000000004639CA80;
		}
		static __inline unsigned int ClassId()
		{
			return 2451;
		}
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02268
	// RuntimeId: 06298
	// TypeInfo:  0x00000001427B3DE0
#ifndef _CustomizeBaseEntityData_
#define _CustomizeBaseEntityData_
#pragma pack(push, 8)
	class CustomizeBaseEntityData : public EntityData
	{
	public:
		static __inline CustomizeBaseEntityData* DefaultInstance()
		{
			return (CustomizeBaseEntityData*)0x0000000046394A70;
		}
		static __inline unsigned int ClassId()
		{
			return 2268;
		}
		Realm m_Realm; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01904
	// RuntimeId: 09466
	// TypeInfo:  0x00000001427F7120
#ifndef _SoldierSpawnAppearanceTemplateData_
#define _SoldierSpawnAppearanceTemplateData_
#pragma pack(push, 8)
	class SoldierSpawnAppearanceTemplateData : public Asset
	{
	public:
		static __inline SoldierSpawnAppearanceTemplateData* DefaultInstance()
		{
			return (SoldierSpawnAppearanceTemplateData*)0x000000004638C5A0;
		}
		static __inline unsigned int ClassId()
		{
			return 1904;
		}
		unsigned __int32 m_Body; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01821
	// RuntimeId: 09464
	// TypeInfo:  0x00000001427F7180
#ifndef _SoldierSpawnKitTemplateData_
#define _SoldierSpawnKitTemplateData_
#pragma pack(push, 8)
	class SoldierSpawnKitTemplateData : public Asset
	{
	public:
		static __inline SoldierSpawnKitTemplateData* DefaultInstance()
		{
			return (SoldierSpawnKitTemplateData*)0x000000004638A580;
		}
		static __inline unsigned int ClassId()
		{
			return 1821;
		}
		unsigned __int32 m_Kit; //0x0018
		unsigned __int32 m_MainGun; //0x001C
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01508
	// RuntimeId: 09462
	// TypeInfo:  0x00000001427F71E0
#ifndef _SoldierWeaponSwitchingData_
#define _SoldierWeaponSwitchingData_
#pragma pack(push, 8)
	class SoldierWeaponSwitchingData : public Asset
	{
	public:
		static __inline SoldierWeaponSwitchingData* DefaultInstance()
		{
			return (SoldierWeaponSwitchingData*)0x0000000046383990;
		}
		static __inline unsigned int ClassId()
		{
			return 1508;
		}
		Array<WeaponSwitchingMapData> m_SwitchMap; //0x0018
		Array<DirectWeaponSwitchingMapData> m_DirectSwitchMap; //0x0020
		Array<WeaponSwitchingEnum> m_AutoDropSlots; //0x0028
		__int32 m_ToggleAction; //0x0030
		float m_ToggleMaxHoldTime; //0x0034
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02909
	// RuntimeId: 06993
	// TypeInfo:  0x00000001427BEBD0
#ifndef _ControllableHealthComponentData_
#define _ControllableHealthComponentData_
#pragma pack(push, 16)
	class ControllableHealthComponentData : public GameHealthComponentData
	{
	public:
		static __inline ControllableHealthComponentData* DefaultInstance()
		{
			return (ControllableHealthComponentData*)0x00000000463ACD50;
		}
		static __inline unsigned int ClassId()
		{
			return 2909;
		}
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02891
	// RuntimeId: 06987
	// TypeInfo:  0x00000001427BECF0
#ifndef _ControllablePhysicsComponentData_
#define _ControllablePhysicsComponentData_
#pragma pack(push, 16)
	class ControllablePhysicsComponentData : public GamePhysicsComponentData
	{
	public:
		static __inline ControllablePhysicsComponentData* DefaultInstance()
		{
			return (ControllablePhysicsComponentData*)0x00000000463AC280;
		}
		static __inline unsigned int ClassId()
		{
			return 2891;
		}
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01870
	// RuntimeId: 07050
	// TypeInfo:  0x00000001427BE450
#ifndef _CustomizeCharacterData_
#define _CustomizeCharacterData_
#pragma pack(push, 8)
	class CustomizeCharacterData : public Asset
	{
	public:
		static __inline CustomizeCharacterData* DefaultInstance()
		{
			return (CustomizeCharacterData*)0x000000004638B7A0;
		}
		static __inline unsigned int ClassId()
		{
			return 1870;
		}
		Array<CustomizeVisual> m_VisualGroups; //0x0018
		Array<UnlockAssetBase*> m_Unlocks; //0x0020
		float m_OverrideMaxHealth; //0x0028
		float m_OverrideCriticalHealthThreshold; //0x002C
		bool m_RestoreToOriginalVisualState; //0x0030
		bool m_ClearVisualState; //0x0031
		char _0x0032[6];
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03720
	// RuntimeId: 09442
	// TypeInfo:  0x00000001427F7360
#ifndef _SoldierSettings_
#define _SoldierSettings_
#pragma pack(push, 8)
	class SoldierSettings : public SystemSettings
	{
	public:
		static __inline SoldierSettings* DefaultInstance()
		{
			return (SoldierSettings*)0x00000000463C5BC0;
		}
		static __inline unsigned int ClassId()
		{
			return 3720;
		}
		SoldierWeaponSwitchingData* m_SoldierWeaponSwitching; //0x0020
		unsigned __int32 m_MaxNumberDroppedPickups; //0x0028
		unsigned __int32 m_MaxVisiblePickupWeapons; //0x002C
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02393
	// RuntimeId: 06551
	// TypeInfo:  0x00000001427B96B0
#ifndef _ControllableEntityData_
#define _ControllableEntityData_
#pragma pack(push, 16)
	class ControllableEntityData : public GamePhysicsEntityData
	{
	public:
		static __inline ControllableEntityData* DefaultInstance()
		{
			return (ControllableEntityData*)0x0000000046399AF0;
		}
		static __inline unsigned int ClassId()
		{
			return 2393;
		}
		TeamId m_DefaultTeam; //0x0090
		float m_LowHealthThreshold; //0x0094
		MaterialDecl m_MaterialPair; //0x0098
		bool m_UsePrediction; //0x009C
		bool m_ResetTeamOnLastPlayerExits; //0x009D
		bool m_Immortal; //0x009E
		bool m_FakeImmortal; //0x009F
		bool m_ForceForegroundRendering; //0x00A0
		char _0x00A1[15];
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01996
	// RuntimeId: 09431
	// TypeInfo:  0x00000001427F7420
#ifndef _SoldierHealthModuleData_
#define _SoldierHealthModuleData_
#pragma pack(push, 8)
	class SoldierHealthModuleData : public DataContainer
	{
	public:
		static __inline SoldierHealthModuleData* DefaultInstance()
		{
			return (SoldierHealthModuleData*)0x000000004638E270;
		}
		static __inline unsigned int ClassId()
		{
			return 1996;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03847
	// RuntimeId: 09429
	// TypeInfo:  0x00000001427F7480
#ifndef _BreathControlData_
#define _BreathControlData_
#pragma pack(push, 8)
	class BreathControlData : public DataContainer
	{
	public:
		static __inline BreathControlData* DefaultInstance()
		{
			return (BreathControlData*)0x00000000463C87F0;
		}
		static __inline unsigned int ClassId()
		{
			return 3847;
		}
		float m_BreathControlTime; //0x0010
		float m_BreathControlReleaseTime; //0x0014
		float m_BreathControlPenaltyMultiplier; //0x0018
		float m_BreathControlPenaltyTimeout; //0x001C
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03459
	// RuntimeId: 09427
	// TypeInfo:  0x00000001427F74E0
#ifndef _CollisionData_
#define _CollisionData_
#pragma pack(push, 8)
	class CollisionData : public DataContainer
	{
	public:
		static __inline CollisionData* DefaultInstance()
		{
			return (CollisionData*)0x00000000463BFD10;
		}
		static __inline unsigned int ClassId()
		{
			return 3459;
		}
		Array<ValueAtX> m_DamageAtVerticalVelocity; //0x0010
		Array<ValueAtX> m_DamageAtHorizVelocity; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03419
	// RuntimeId: 09423
	// TypeInfo:  0x00000001427F7540
#ifndef _SoldierWeaponOverrideData_
#define _SoldierWeaponOverrideData_
#pragma pack(push, 8)
	class SoldierWeaponOverrideData : public DataContainer
	{
	public:
		static __inline SoldierWeaponOverrideData* DefaultInstance()
		{
			return (SoldierWeaponOverrideData*)0x00000000463BEC50;
		}
		static __inline unsigned int ClassId()
		{
			return 3419;
		}
		Array<WeaponOverrideData*> m_Overrides; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03855
	// RuntimeId: 09421
	// TypeInfo:  0x00000001427F75A0
#ifndef _SoldierSprintSettingsData_
#define _SoldierSprintSettingsData_
#pragma pack(push, 8)
	class SoldierSprintSettingsData : public DataContainer
	{
	public:
		static __inline SoldierSprintSettingsData* DefaultInstance()
		{
			return (SoldierSprintSettingsData*)0x00000000463C8A40;
		}
		static __inline unsigned int ClassId()
		{
			return 3855;
		}
		float m_Fov; //0x0010
		float m_FovInDelay; //0x0014
		float m_FovInTime; //0x0018
		float m_FovOutDelay; //0x001C
		float m_FovOutTime; //0x0020
		float m_RecoverTime; //0x0024
		float m_SprintToProneRecoverTime; //0x0028
		char _0x002C[4];
		Array<__int32> m_InterruptingActions; //0x0030
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03183
	// RuntimeId: 09415
	// TypeInfo:  0x00000001427F7600
#ifndef _SoldierHeadCollisionData_
#define _SoldierHeadCollisionData_
#pragma pack(push, 8)
	class SoldierHeadCollisionData : public DataContainer
	{
	public:
		static __inline SoldierHeadCollisionData* DefaultInstance()
		{
			return (SoldierHeadCollisionData*)0x00000000463B9880;
		}
		static __inline unsigned int ClassId()
		{
			return 3183;
		}
		float m_HeadRadius; //0x0010
		char _0x0014[4];
		Array<SoldierHeadCollisionPoseData> m_PoseStates; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03202
	// RuntimeId: 09411
	// TypeInfo:  0x00000001427F7660
#ifndef _SoldierAutoAimData_
#define _SoldierAutoAimData_
#pragma pack(push, 8)
	class SoldierAutoAimData : public DataContainer
	{
	public:
		static __inline SoldierAutoAimData* DefaultInstance()
		{
			return (SoldierAutoAimData*)0x00000000463BA130;
		}
		static __inline unsigned int ClassId()
		{
			return 3202;
		}
		Array<AutoAimData> m_Poses; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03740
	// RuntimeId: 06869
	// TypeInfo:  0x00000001427BF950
#ifndef _CharacterSoundData_
#define _CharacterSoundData_
#pragma pack(push, 8)
	class CharacterSoundData : public DataContainer
	{
	public:
		static __inline CharacterSoundData* DefaultInstance()
		{
			return (CharacterSoundData*)0x00000000463C63C0;
		}
		static __inline unsigned int ClassId()
		{
			return 3740;
		}
		SoundAsset* m_Movement; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03200
	// RuntimeId: 09403
	// TypeInfo:  0x00000001427F7720
#ifndef _SoldierAimingConstraintsData_
#define _SoldierAimingConstraintsData_
#pragma pack(push, 8)
	class SoldierAimingConstraintsData : public DataContainer
	{
	public:
		static __inline SoldierAimingConstraintsData* DefaultInstance()
		{
			return (SoldierAimingConstraintsData*)0x00000000463BA0B0;
		}
		static __inline unsigned int ClassId()
		{
			return 3200;
		}
		AimingConstraintsData m_SwimmingConstraints; //0x0010
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02885
	// RuntimeId: 09401
	// TypeInfo:  0x00000001427F7780
#ifndef _PickupPhysicsComponentData_
#define _PickupPhysicsComponentData_
#pragma pack(push, 16)
	class PickupPhysicsComponentData : public GamePhysicsComponentData
	{
	public:
		static __inline PickupPhysicsComponentData* DefaultInstance()
		{
			return (PickupPhysicsComponentData*)0x00000000463ABEB0;
		}
		static __inline unsigned int ClassId()
		{
			return 2885;
		}
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02388
	// RuntimeId: 09386
	// TypeInfo:  0x00000001427F7960
#ifndef _PickupEntityData_
#define _PickupEntityData_
#pragma pack(push, 16)
	class PickupEntityData : public GamePhysicsEntityData
	{
	public:
		static __inline PickupEntityData* DefaultInstance()
		{
			return (PickupEntityData*)0x00000000463995A0;
		}
		static __inline unsigned int ClassId()
		{
			return 2388;
		}
		ObjectBlueprint* m_PhysicsBlueprint; //0x0090
		MeshAsset* m_Mesh; //0x0098
		float m_TimeToShowWeaponMesh; //0x00A0
		unsigned __int32 m_PreferredWeaponSlot; //0x00A4
		float m_TimeToLive; //0x00A8
		char _0x00AC[4];
		char* m_IconName; //0x00B0
		__int32 m_MinRandomSpareAmmoPercent; //0x00B8
		__int32 m_MaxRandomSpareAmmoPercent; //0x00BC
		__int32 m_MinRandomClipAmmoPercent; //0x00C0
		__int32 m_MaxRandomClipAmmoPercent; //0x00C4
		PickupPlayerEnum m_RandomizeAmmoOnDropForPlayer; //0x00C8
		float m_InteractionRadius; //0x00CC
		float m_DisplayWithinRadius; //0x00D0
		float m_TacticalRadius; //0x00D4
		bool m_UseWeaponMesh; //0x00D8
		bool m_UnspawnOnPickup; //0x00D9
		bool m_UnspawnOnAmmoPickup; //0x00DA
		bool m_ContentIsStatic; //0x00DB
		bool m_PositionIsStatic; //0x00DC
		bool m_AllowPickup; //0x00DD
		bool m_IgnoreNullWeaponSlots; //0x00DE
		bool m_ForceWeaponSlotSelection; //0x00DF
		bool m_DisplayInMiniMap; //0x00E0
		bool m_HasAutomaticAmmoPickup; //0x00E1
		bool m_ReplaceAllContent; //0x00E2
		bool m_RemoveWeaponOnDrop; //0x00E3
		bool m_UseDisplayWithinRadius; //0x00E4
		bool m_KeepAmmoState; //0x00E5
		char _0x00E6[10];
	};//Size=0x00F0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01773
	// RuntimeId: 09394
	// TypeInfo:  0x00000001427F7840
#ifndef _PickupEntityAsset_
#define _PickupEntityAsset_
#pragma pack(push, 8)
	class PickupEntityAsset : public DataContainerPolicyAsset
	{
	public:
		static __inline PickupEntityAsset* DefaultInstance()
		{
			return (PickupEntityAsset*)0x0000000046389370;
		}
		static __inline unsigned int ClassId()
		{
			return 1773;
		}
		PickupEntityData* m_Data; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02390
	// RuntimeId: 09392
	// TypeInfo:  0x00000001427F78A0
#ifndef _KitPickupEntityData_
#define _KitPickupEntityData_
#pragma pack(push, 16)
	class KitPickupEntityData : public PickupEntityData
	{
	public:
		static __inline KitPickupEntityData* DefaultInstance()
		{
			return (KitPickupEntityData*)0x00000000463997D0;
		}
		static __inline unsigned int ClassId()
		{
			return 2390;
		}
		bool m_KeepAdditionalWeapons; //0x00F0
		char _0x00F1[15];
	};//Size=0x0100
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02391
	// RuntimeId: 09390
	// TypeInfo:  0x00000001427F7900
#ifndef _WeaponUnlockPickupEntityData_
#define _WeaponUnlockPickupEntityData_
#pragma pack(push, 16)
	class WeaponUnlockPickupEntityData : public PickupEntityData
	{
	public:
		static __inline WeaponUnlockPickupEntityData* DefaultInstance()
		{
			return (WeaponUnlockPickupEntityData*)0x00000000463998F0;
		}
		static __inline unsigned int ClassId()
		{
			return 2391;
		}
		Array<WeaponUnlockPickupData> m_Weapons; //0x00F0
		bool m_UseForPersistence; //0x00F8
		char _0x00F9[7];
	};//Size=0x0100
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02389
	// RuntimeId: 09398
	// TypeInfo:  0x00000001427F77E0
#ifndef _DynamicWeaponPickupEntityData_
#define _DynamicWeaponPickupEntityData_
#pragma pack(push, 16)
	class DynamicWeaponPickupEntityData : public PickupEntityData
	{
	public:
		static __inline DynamicWeaponPickupEntityData* DefaultInstance()
		{
			return (DynamicWeaponPickupEntityData*)0x00000000463996B0;
		}
		static __inline unsigned int ClassId()
		{
			return 2389;
		}
		Array<DynamicWeaponPickupSlotData> m_WeaponSlots; //0x00F0
		char _0x00F8[8];
	};//Size=0x0100
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02146
	// RuntimeId: 09382
	// TypeInfo:  0x00000001427F79C0
#ifndef _WeaponStateEntityData_
#define _WeaponStateEntityData_
#pragma pack(push, 8)
	class WeaponStateEntityData : public EntityData
	{
	public:
		static __inline WeaponStateEntityData* DefaultInstance()
		{
			return (WeaponStateEntityData*)0x0000000046391EE0;
		}
		static __inline unsigned int ClassId()
		{
			return 2146;
		}
		Realm m_Realm; //0x0018
		__int32 m_WeaponSlot; //0x001C
		__int32 m_Ammo; //0x0020
		__int32 m_AmmoInMags; //0x0024
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02308
	// RuntimeId: 09380
	// TypeInfo:  0x00000001427F7A20
#ifndef _StateEventGateEntityData_
#define _StateEventGateEntityData_
#pragma pack(push, 8)
	class StateEventGateEntityData : public EntityData
	{
	public:
		static __inline StateEventGateEntityData* DefaultInstance()
		{
			return (StateEventGateEntityData*)0x0000000046395860;
		}
		static __inline unsigned int ClassId()
		{
			return 2308;
		}
		EventGateState m_CheckedState; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02193
	// RuntimeId: 09376
	// TypeInfo:  0x00000001427F7A80
#ifndef _CoverPrepareFireEntityData_
#define _CoverPrepareFireEntityData_
#pragma pack(push, 8)
	class CoverPrepareFireEntityData : public EntityData
	{
	public:
		static __inline CoverPrepareFireEntityData* DefaultInstance()
		{
			return (CoverPrepareFireEntityData*)0x0000000046392FC0;
		}
		static __inline unsigned int ClassId()
		{
			return 2193;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02189
	// RuntimeId: 09374
	// TypeInfo:  0x00000001427F7AE0
#ifndef _PlayerLookAtEntityData_
#define _PlayerLookAtEntityData_
#pragma pack(push, 16)
	class PlayerLookAtEntityData : public EntityData
	{
	public:
		static __inline PlayerLookAtEntityData* DefaultInstance()
		{
			return (PlayerLookAtEntityData*)0x0000000046392E40;
		}
		static __inline unsigned int ClassId()
		{
			return 2189;
		}
		char _0x0018[8];
		LinearTransform m_TargetTransform; //0x0020
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03041
	// RuntimeId: 09372
	// TypeInfo:  0x00000001427F7B40
#ifndef _HitReactionComponentData_
#define _HitReactionComponentData_
#pragma pack(push, 16)
	class HitReactionComponentData : public GameComponentData
	{
	public:
		static __inline HitReactionComponentData* DefaultInstance()
		{
			return (HitReactionComponentData*)0x00000000463B4970;
		}
		static __inline unsigned int ClassId()
		{
			return 3041;
		}
		HitReactionComponentBinding m_HitReactionBinding; //0x0070
		bool m_Enabled; //0x0124
		char _0x0125[11];
	};//Size=0x0130
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02481
	// RuntimeId: 09366
	// TypeInfo:  0x00000001427F7BA0
#ifndef _BlockAimAssistEntityData_
#define _BlockAimAssistEntityData_
#pragma pack(push, 16)
	class BlockAimAssistEntityData : public SpatialEntityData
	{
	public:
		static __inline BlockAimAssistEntityData* DefaultInstance()
		{
			return (BlockAimAssistEntityData*)0x000000004639E120;
		}
		static __inline unsigned int ClassId()
		{
			return 2481;
		}
		BlockAimAssistData m_BlockData; //0x0060
		char _0x0068[8];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01769
	// RuntimeId: 07041
	// TypeInfo:  0x00000001427BE0F0
#ifndef _CharacterCustomizationAsset_
#define _CharacterCustomizationAsset_
#pragma pack(push, 8)
	class CharacterCustomizationAsset : public DataContainerPolicyAsset
	{
	public:
		static __inline CharacterCustomizationAsset* DefaultInstance()
		{
			return (CharacterCustomizationAsset*)0x0000000046389060;
		}
		static __inline unsigned int ClassId()
		{
			return 1769;
		}
		UIHudIcon m_UIHudIcon; //0x0018
		char _0x001C[4];
		char* m_UIKitIconName; //0x0020
		char* m_LabelSid; //0x0028
		CustomizationTable* m_VisualTable; //0x0030
		CustomizationTable* m_SpecializationTable; //0x0038
		Array<VoiceOverLabel*> m_VoiceOverLabels; //0x0040
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03178
	// RuntimeId: 09360
	// TypeInfo:  0x00000001427F7C60
#ifndef _SoldierWeaponSocketObjectData_
#define _SoldierWeaponSocketObjectData_
#pragma pack(push, 16)
	class SoldierWeaponSocketObjectData : public SocketObjectDataBase
	{
	public:
		static __inline SoldierWeaponSocketObjectData* DefaultInstance()
		{
			return (SoldierWeaponSocketObjectData*)0x00000000463B96D0;
		}
		static __inline unsigned int ClassId()
		{
			return 3178;
		}
		Guid m_SoldierWeaponGuid; //0x0010
		char _0x0010[16];
		LinearTransform m_Transform; //0x0020
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02278
	// RuntimeId: 09357
	// TypeInfo:  0x00000001427F7CC0
#ifndef _CoverPeekEntityData_
#define _CoverPeekEntityData_
#pragma pack(push, 8)
	class CoverPeekEntityData : public EntityData
	{
	public:
		static __inline CoverPeekEntityData* DefaultInstance()
		{
			return (CoverPeekEntityData*)0x0000000046394DA0;
		}
		static __inline unsigned int ClassId()
		{
			return 2278;
		}
		CoverPeekBinding m_Binding; //0x0018
		float m_DetectDistanceForward; //0x007C
		float m_DetectDistanceHorizontal; //0x0080
		bool m_OverEnabled; //0x0084
		bool m_HorizEnabled; //0x0085
		char _0x0086[2];
	};//Size=0x0088
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02959
	// RuntimeId: 09353
	// TypeInfo:  0x00000001427F7D20
#ifndef _BlockAimAssistComponentData_
#define _BlockAimAssistComponentData_
#pragma pack(push, 16)
	class BlockAimAssistComponentData : public GameComponentData
	{
	public:
		static __inline BlockAimAssistComponentData* DefaultInstance()
		{
			return (BlockAimAssistComponentData*)0x00000000463B0100;
		}
		static __inline unsigned int ClassId()
		{
			return 2959;
		}
		BlockAimAssistData m_BlockData; //0x0070
		char _0x0078[8];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02934
	// RuntimeId: 09351
	// TypeInfo:  0x00000001427F7D80
#ifndef _EntryAimAssistTargetOptionsComponentData_
#define _EntryAimAssistTargetOptionsComponentData_
#pragma pack(push, 16)
	class EntryAimAssistTargetOptionsComponentData : public GameComponentData
	{
	public:
		static __inline EntryAimAssistTargetOptionsComponentData* DefaultInstance()
		{
			return (EntryAimAssistTargetOptionsComponentData*)0x00000000463ADFF0;
		}
		static __inline unsigned int ClassId()
		{
			return 2934;
		}
		float m_NotSnapZoomTargetAngle; //0x0070
		bool m_AllowSoldierAsTarget; //0x0074
		char _0x0075[11];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02946
	// RuntimeId: 09349
	// TypeInfo:  0x00000001427F7DE0
#ifndef _AimAssistNodeSnapPointComponentData_
#define _AimAssistNodeSnapPointComponentData_
#pragma pack(push, 16)
	class AimAssistNodeSnapPointComponentData : public GameComponentData
	{
	public:
		static __inline AimAssistNodeSnapPointComponentData* DefaultInstance()
		{
			return (AimAssistNodeSnapPointComponentData*)0x00000000463AF2D0;
		}
		static __inline unsigned int ClassId()
		{
			return 2946;
		}
		unsigned __int32 m_Priority; //0x0070
		float m_UnderReticleSphereRadius; //0x0074
		float m_UnderReticleCapsuleLength; //0x0078
		unsigned __int32 m_Priority_UnderReticle; //0x007C
		bool m_Enabled; //0x0080
		char _0x0081[15];
	};//Size=0x0090
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02937
	// RuntimeId: 09347
	// TypeInfo:  0x00000001427F7E40
#ifndef _AimAssistNodeComponentData_
#define _AimAssistNodeComponentData_
#pragma pack(push, 16)
	class AimAssistNodeComponentData : public GameComponentData
	{
	public:
		static __inline AimAssistNodeComponentData* DefaultInstance()
		{
			return (AimAssistNodeComponentData*)0x00000000463AE1E0;
		}
		static __inline unsigned int ClassId()
		{
			return 2937;
		}
		Vec3 m_StickyCenterOffset; //0x0070
		TeamId m_Team; //0x0080
		bool m_Enabled; //0x0084
		bool m_GetTeamFromOwner; //0x0085
		bool m_ColorPlayerReticle; //0x0086
		char _0x0087[9];
	};//Size=0x0090
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02992
	// RuntimeId: 09345
	// TypeInfo:  0x00000001427F7EA0
#ifndef _SoldierBreathControlComponentData_
#define _SoldierBreathControlComponentData_
#pragma pack(push, 16)
	class SoldierBreathControlComponentData : public GameComponentData
	{
	public:
		static __inline SoldierBreathControlComponentData* DefaultInstance()
		{
			return (SoldierBreathControlComponentData*)0x00000000463B19B0;
		}
		static __inline unsigned int ClassId()
		{
			return 2992;
		}
		float m_Time; //0x0070
		float m_TransitionTime; //0x0074
		float m_TransitionCurveShape; //0x0078
		float m_ReleaseTime; //0x007C
		float m_PenaltyMultiplier; //0x0080
		float m_PenaltyTimeout; //0x0084
		char _0x0088[8];
	};//Size=0x0090
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02989
	// RuntimeId: 06965
	// TypeInfo:  0x00000001427BF050
#ifndef _CharacterCustomizationComponentData_
#define _CharacterCustomizationComponentData_
#pragma pack(push, 16)
	class CharacterCustomizationComponentData : public GameComponentData
	{
	public:
		static __inline CharacterCustomizationComponentData* DefaultInstance()
		{
			return (CharacterCustomizationComponentData*)0x00000000463B1780;
		}
		static __inline unsigned int ClassId()
		{
			return 2989;
		}
		MeshLodGroup* m_SharedLodGroup; //0x0070
		char _0x0078[8];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01901
	// RuntimeId: 09341
	// TypeInfo:  0x00000001427F7F60
#ifndef _CharacterSocketListAsset_
#define _CharacterSocketListAsset_
#pragma pack(push, 8)
	class CharacterSocketListAsset : public Asset
	{
	public:
		static __inline CharacterSocketListAsset* DefaultInstance()
		{
			return (CharacterSocketListAsset*)0x000000004638C4D0;
		}
		static __inline unsigned int ClassId()
		{
			return 1901;
		}
		Array<SocketData*> m_GameplaySockets; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01995
	// RuntimeId: 09339
	// TypeInfo:  0x00000001427F7FC0
#ifndef _SocketData_
#define _SocketData_
#pragma pack(push, 16)
	class SocketData : public DataContainer
	{
	public:
		static __inline SocketData* DefaultInstance()
		{
			return (SocketData*)0x000000004638E170;
		}
		static __inline unsigned int ClassId()
		{
			return 1995;
		}
		Guid m_UnlockAssetGuid; //0x0010
		char _0x0010[16];
		Guid m_BelongsToUnlockAssetGuid; //0x0020
		char _0x0020[16];
		char* m_BoneName; //0x0030
		__int32 m_BoneId; //0x0038
		char _0x003C[4];
		LinearTransform m_BoneRigidTransform; //0x0040
		LinearTransform m_Transform; //0x0080
		Array<SocketObjectDataBase*> m_AvailableObjects; //0x00C0
		GearSlot m_GearSlot; //0x00C8
		SocketType m_SocketType; //0x00CC
		bool m_Excluded; //0x00D0
		bool m_UsesDefaultObject; //0x00D1
		bool m_DefaultEnableSocketEntities; //0x00D2
		bool m_ForceSocketEntitiesEnabled; //0x00D3
		bool m_HideByZoomTransition; //0x00D4
		bool m_HideByLightToggle; //0x00D5
		char _0x00D6[10];
	};//Size=0x00E0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03177
	// RuntimeId: 09646
	// TypeInfo:  0x00000001427F5C80
#ifndef _WeaponRegularSocketObjectData_
#define _WeaponRegularSocketObjectData_
#pragma pack(push, 16)
	class WeaponRegularSocketObjectData : public WeaponSocketObjectData
	{
	public:
		static __inline WeaponRegularSocketObjectData* DefaultInstance()
		{
			return (WeaponRegularSocketObjectData*)0x00000000463B9630;
		}
		static __inline unsigned int ClassId()
		{
			return 3177;
		}
		Array<LinearTransform> m_Mesh3pTransforms; //0x0030
		char _0x0038[8];
		LinearTransform m_Transform; //0x0040
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03048
	// RuntimeId: 09333
	// TypeInfo:  0x00000001427F8080
#ifndef _MovementComponentData_
#define _MovementComponentData_
#pragma pack(push, 16)
	class MovementComponentData : public GameComponentData
	{
	public:
		static __inline MovementComponentData* DefaultInstance()
		{
			return (MovementComponentData*)0x00000000463B4EB0;
		}
		static __inline unsigned int ClassId()
		{
			return 3048;
		}
		MovementComponentBinding m_MovementBinding; //0x0070
		bool m_ClientSidePhysicsControlled; //0x00D4
		char _0x00D5[11];
	};//Size=0x00E0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02955
	// RuntimeId: 06852
	// TypeInfo:  0x00000001427BFBF0
#ifndef _CharacterCameraComponentData_
#define _CharacterCameraComponentData_
#pragma pack(push, 16)
	class CharacterCameraComponentData : public GameComponentData
	{
	public:
		static __inline CharacterCameraComponentData* DefaultInstance()
		{
			return (CharacterCameraComponentData*)0x00000000463AFB10;
		}
		static __inline unsigned int ClassId()
		{
			return 2955;
		}
		Array<TargetCameraData*> m_Cameras; //0x0070
		CharacterCameraForwardAxis m_CameraForwardAxis; //0x0078
		char _0x007C[4];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02926
	// RuntimeId: 09323
	// TypeInfo:  0x00000001427F8140
#ifndef _SoldierBodyComponentData_
#define _SoldierBodyComponentData_
#pragma pack(push, 16)
	class SoldierBodyComponentData : public GameComponentData
	{
	public:
		static __inline SoldierBodyComponentData* DefaultInstance()
		{
			return (SoldierBodyComponentData*)0x00000000463AD9F0;
		}
		static __inline unsigned int ClassId()
		{
			return 2926;
		}
		float m_OverrideGravityValue; //0x0070
		float m_OverrideVelocityY; //0x0074
		float m_SprintMultiplier; //0x0078
		bool m_OverrideGravity; //0x007C
		bool m_OverrideVelocity; //0x007D
		bool m_DisableParachute; //0x007E
		char _0x007F[1];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02969
	// RuntimeId: 09321
	// TypeInfo:  0x00000001427F81A0
#ifndef _BoneCollisionComponentData_
#define _BoneCollisionComponentData_
#pragma pack(push, 16)
	class BoneCollisionComponentData : public GameComponentData
	{
	public:
		static __inline BoneCollisionComponentData* DefaultInstance()
		{
			return (BoneCollisionComponentData*)0x00000000463B0910;
		}
		static __inline unsigned int ClassId()
		{
			return 2969;
		}
		SkeletonCollisionData* m_SkeletonCollisionData; //0x0070
		char _0x0078[8];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03022
	// RuntimeId: 06906
	// TypeInfo:  0x00000001427BF470
#ifndef _EntryComponentData_
#define _EntryComponentData_
#pragma pack(push, 16)
	class EntryComponentData : public GameComponentData
	{
	public:
		static __inline EntryComponentData* DefaultInstance()
		{
			return (EntryComponentData*)0x00000000463B3660;
		}
		static __inline unsigned int ClassId()
		{
			return 3022;
		}
		Vec3 m_SoldierOffset; //0x0070
		EntryClass m_EntryClass; //0x0080
		char _0x0084[4];
		GameAIEntryData* m_AIData; //0x0088
		EntryInputActionMapsData* m_InputConceptDefinition; //0x0090
		InputActionMappingsData* m_InputMapping; //0x0098
		Array<InputCurveData*> m_InputCurves; //0x00A0
		EntryComponentHudData m_HudData; //0x00A8
		__int32 m_EntryOrderNumber; //0x00B4
		float m_EnterImpulse; //0x00B8
		float m_EntryRadius; //0x00BC
		float m_SoldierTransitionInvisbleTime; //0x00C0
		__int32 m_NumberOfStances; //0x00C4
		EntrySpottingSettings m_EntrySpottingSettings; //0x00C8
		char _0x00CC[4];
		EntryComponentSoundData* m_EntryComponentSound; //0x00D0
		__int32 m_TriggerEventOnKey; //0x00D8
		bool m_ForbiddenForHuman; //0x00DC
		bool m_IsAllowedToExitInAir; //0x00DD
		bool m_IsShielded; //0x00DE
		bool m_LockSoldierAimingToEntry; //0x00DF
		bool m_ShowSoldierInEntry; //0x00E0
		bool m_Show1pSoldierInEntry; //0x00E1
		bool m_StancesEnabled; //0x00E2
		bool m_ShowSoldierWeaponInEntry; //0x00E3
		bool m_Show1pSoldierInEntryForPlayerOnly; //0x00E4
		bool m_Show3pSoldierWeaponInEntry; //0x00E5
		bool m_ShowSoldierGearInEntry; //0x00E6
		PoseConstraintsData m_PoseConstraints; //0x00E7
		bool m_AllowRagdollFromEntry; //0x00EA
		char _0x00EB[5];
	};//Size=0x00F0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01776
	// RuntimeId: 03667
	// TypeInfo:  0x000000014276D330
#ifndef _DataBusData_
#define _DataBusData_
#pragma pack(push, 8)
	class DataBusData : public Asset
	{
	public:
		static __inline DataBusData* DefaultInstance()
		{
			return (DataBusData*)0x0000000046389510;
		}
		static __inline unsigned int ClassId()
		{
			return 1776;
		}
		Array<PropertyConnection> m_PropertyConnections; //0x0018
		Array<LinkConnection> m_LinkConnections; //0x0020
		DynamicDataContainer* m_Interface; //0x0028
		unsigned __int16 m_Flags; //0x0030
		char _0x0032[6];
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01777
	// RuntimeId: 04885
	// TypeInfo:  0x000000014278DE30
#ifndef _EntityBusData_
#define _EntityBusData_
#pragma pack(push, 8)
	class EntityBusData : public DataBusData
	{
	public:
		static __inline EntityBusData* DefaultInstance()
		{
			return (EntityBusData*)0x0000000046389560;
		}
		static __inline unsigned int ClassId()
		{
			return 1777;
		}
		Array<EventConnection> m_EventConnections; //0x0038
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01778
	// RuntimeId: 04887
	// TypeInfo:  0x000000014278DDD0
#ifndef _Blueprint_
#define _Blueprint_
#pragma pack(push, 8)
	class Blueprint : public EntityBusData
	{
	public:
		static __inline Blueprint* DefaultInstance()
		{
			return (Blueprint*)0x00000000463895C0;
		}
		static __inline unsigned int ClassId()
		{
			return 1778;
		}
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01786
	// RuntimeId: 04889
	// TypeInfo:  0x000000014278DD70
#ifndef _ObjectBlueprint_
#define _ObjectBlueprint_
#pragma pack(push, 8)
	class ObjectBlueprint : public Blueprint
	{
	public:
		static __inline ObjectBlueprint* DefaultInstance()
		{
			return (ObjectBlueprint*)0x0000000046389A00;
		}
		static __inline unsigned int ClassId()
		{
			return 1786;
		}
		GameObjectData* m_Object; //0x0040
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00297
	// RuntimeId: 05707
	// TypeInfo:  0x00000001427A0690
#ifndef _GameComponent_
#define _GameComponent_
	class GameComponent : public Component
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 297;
		}
		char _0x0020[16];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00519
	// RuntimeId: 05615
	// TypeInfo:  0x000000014279E010
#ifndef _ClientGamePhysicsComponent_
#define _ClientGamePhysicsComponent_
	class ClientGamePhysicsComponent : public PhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 519;
		}
		char _0x0028[32];
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   00554
	// RuntimeId: 08008
	// TypeInfo:  0x00000001427D3C40
#ifndef _HealthComponent_
#define _HealthComponent_
	class HealthComponent : public Component
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 554;
		}
		char _0x0020[8];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00298
	// RuntimeId: 05667
	// TypeInfo:  0x000000014279ED70
#ifndef _ClientGameComponent_
#define _ClientGameComponent_
	class ClientGameComponent : public GameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 298;
		}
		char _0x0030[8];
	};//Size=0x0038
#endif

	////////////////////////////////////////
	// ClassId:   00363
	// RuntimeId: 05499
	// TypeInfo:  0x00000001427997E0
#ifndef _ClientCharacterCameraComponent_
#define _ClientCharacterCameraComponent_
	class ClientCharacterCameraComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 363;
		}
		char _0x0038[88];
	};//Size=0x0090
#endif

	////////////////////////////////////////
	// ClassId:   00174
	// RuntimeId: 05891
	// TypeInfo:  0x00000001427A49A0
#ifndef _TargetCameraCallback_
#define _TargetCameraCallback_
	class TargetCameraCallback
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 174;
		}
		char _0x0000[8];
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00311
	// RuntimeId: 09289
	// TypeInfo:  0x00000001427F0830
#ifndef _ClientSoldierBreathControlComponent_
#define _ClientSoldierBreathControlComponent_
	class ClientSoldierBreathControlComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 311;
		}
		char _0x0038[144];
	};//Size=0x00C8
#endif

	////////////////////////////////////////
	// ClassId:   00395
	// RuntimeId: 09288
	// TypeInfo:  0x00000001427F0880
#ifndef _ClientSoldierBodyComponent_
#define _ClientSoldierBodyComponent_
	class ClientSoldierBodyComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 395;
		}
		char _0x0038[232];
	};//Size=0x0120
#endif

	////////////////////////////////////////
	// ClassId:   00404
	// RuntimeId: 09287
	// TypeInfo:  0x00000001427F08D0
#ifndef _ClientRagdollComponent_
#define _ClientRagdollComponent_
	class ClientRagdollComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 404;
		}
		char _0x0038[536];
	};//Size=0x0250
#endif

	////////////////////////////////////////
	// ClassId:   00521
	// RuntimeId: 09286
	// TypeInfo:  0x00000001427F0920
#ifndef _ClientPickupPhysicsComponent_
#define _ClientPickupPhysicsComponent_
	class ClientPickupPhysicsComponent : public ClientGamePhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 521;
		}
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   00398
	// RuntimeId: 09285
	// TypeInfo:  0x00000001427F0970
#ifndef _ClientPhantomComponent_
#define _ClientPhantomComponent_
	class ClientPhantomComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 398;
		}
		char _0x0038[1288];
	};//Size=0x0540
#endif

	////////////////////////////////////////
	// ClassId:   00307
	// RuntimeId: 09284
	// TypeInfo:  0x00000001427F09C0
#ifndef _ClientMovementComponent_
#define _ClientMovementComponent_
	class ClientMovementComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 307;
		}
		char _0x0038[136];
	};//Size=0x00C0
#endif

	////////////////////////////////////////
	// ClassId:   00374
	// RuntimeId: 09283
	// TypeInfo:  0x00000001427F0A10
#ifndef _ClientHitReactionComponent_
#define _ClientHitReactionComponent_
	class ClientHitReactionComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 374;
		}
		char _0x0038[120];
	};//Size=0x00B0
#endif

	////////////////////////////////////////
	// ClassId:   00367
	// RuntimeId: 09282
	// TypeInfo:  0x00000001427F0A60
#ifndef _ClientFaceposerComponent_
#define _ClientFaceposerComponent_
	class ClientFaceposerComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 367;
		}
		char _0x0038[312];
	};//Size=0x0170
#endif

	////////////////////////////////////////
	// ClassId:   00389
	// RuntimeId: 09281
	// TypeInfo:  0x00000001427F0AB0
#ifndef _ClientBoneCollisionComponent_
#define _ClientBoneCollisionComponent_
	class ClientBoneCollisionComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 389;
		}
		char _0x0038[784];
	};//Size=0x0348
#endif

	////////////////////////////////////////
	// ClassId:   00355
	// RuntimeId: 09280
	// TypeInfo:  0x00000001427F0B00
#ifndef _ClientBlockAimAssistComponent_
#define _ClientBlockAimAssistComponent_
	class ClientBlockAimAssistComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 355;
		}
		char _0x0038[8];
	};//Size=0x0040
#endif

	////////////////////////////////////////
	// ClassId:   00424
	// RuntimeId: 09279
	// TypeInfo:  0x00000001427F0600
#ifndef _ClientEntryAimAssistTargetOptionsComponent_
#define _ClientEntryAimAssistTargetOptionsComponent_
	class ClientEntryAimAssistTargetOptionsComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 424;
		}
	};//Size=0x0038
#endif

	////////////////////////////////////////
	// ClassId:   00390
	// RuntimeId: 09278
	// TypeInfo:  0x00000001427F0650
#ifndef _ClientAimAssistNodeSnapPointComponent_
#define _ClientAimAssistNodeSnapPointComponent_
	class ClientAimAssistNodeSnapPointComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 390;
		}
		char _0x0038[8];
	};//Size=0x0040
#endif

	////////////////////////////////////////
	// ClassId:   00423
	// RuntimeId: 09277
	// TypeInfo:  0x00000001427F0B50
#ifndef _ClientAimAssistNodeComponent_
#define _ClientAimAssistNodeComponent_
	class ClientAimAssistNodeComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 423;
		}
		char _0x0038[1088];
	};//Size=0x0478
#endif

	////////////////////////////////////////
	// ClassId:   01225
	// RuntimeId: 09276
	// TypeInfo:  0x00000001427F0BF0
#ifndef _ClientWeaponLagEntity_
#define _ClientWeaponLagEntity_
	class ClientWeaponLagEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1225;
		}
		char _0x0020[72];
	};//Size=0x0068
#endif

	////////////////////////////////////////
	// ClassId:   01285
	// RuntimeId: 09275
	// TypeInfo:  0x00000001427F0C90
#ifndef _ClientCoverPeekEntity_
#define _ClientCoverPeekEntity_
	class ClientCoverPeekEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1285;
		}
		char _0x0020[448];
	};//Size=0x01E0
#endif

	////////////////////////////////////////
	// ClassId:   00202
	// RuntimeId: 05773
	// TypeInfo:  0x00000001427A1F10
#ifndef _Tool_
#define _Tool_
	class Tool
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 202;
		}
		char _0x0000[24];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00646
	// RuntimeId: 05708
	// TypeInfo:  0x00000001427A06E0
#ifndef _GameComponentEntity_
#define _GameComponentEntity_
	class GameComponentEntity : public ComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 646;
		}
		char _0x0040[32];
	};//Size=0x0060
#endif

	////////////////////////////////////////
	// ClassId:   00409
	// RuntimeId: 09272
	// TypeInfo:  0x00000001427EFA30
#ifndef _ClientSoldierGripComponent_
#define _ClientSoldierGripComponent_
	class ClientSoldierGripComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 409;
		}
		char _0x0038[168];
	};//Size=0x00E0
#endif

	////////////////////////////////////////
	// ClassId:   00357
	// RuntimeId: 09271
	// TypeInfo:  0x00000001427EFA80
#ifndef _ClientAnimationTurretRotationComponent_
#define _ClientAnimationTurretRotationComponent_
	class ClientAnimationTurretRotationComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 357;
		}
		char _0x0038[88];
	};//Size=0x0090
#endif

	////////////////////////////////////////
	// ClassId:   00647
	// RuntimeId: 05669
	// TypeInfo:  0x000000014279EF00
#ifndef _ClientGameComponentEntity_
#define _ClientGameComponentEntity_
	class ClientGameComponentEntity : public GameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 647;
		}
	};//Size=0x0060
#endif

	////////////////////////////////////////
	// ClassId:   00649
	// RuntimeId: 05671
	// TypeInfo:  0x000000014279EDC0
#ifndef _ClientPhysicsEntity_
#define _ClientPhysicsEntity_
	class ClientPhysicsEntity : public ClientGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 649;
		}
		char _0x0060[8];
	};//Size=0x0068
#endif

	////////////////////////////////////////
	// ClassId:   00660
	// RuntimeId: 05494
	// TypeInfo:  0x0000000142798D20
#ifndef _ClientProjectileEntity_
#define _ClientProjectileEntity_
	class ClientProjectileEntity : public ClientPhysicsEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 660;
		}
		char _0x0068[136];
	};//Size=0x00F0
#endif

	////////////////////////////////////////
	// ClassId:   00665
	// RuntimeId: 05492
	// TypeInfo:  0x0000000142798FA0
#ifndef _ClientGhostProjectileEntity_
#define _ClientGhostProjectileEntity_
	class ClientGhostProjectileEntity : public ClientProjectileEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 665;
		}
		char _0x00F0[496];
	};//Size=0x02E0
#endif

	////////////////////////////////////////
	// ClassId:   00668
	// RuntimeId: 09266
	// TypeInfo:  0x00000001427EFF80
#ifndef _ClientGrenadeEntity_
#define _ClientGrenadeEntity_
	class ClientGrenadeEntity : public ClientGhostProjectileEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 668;
		}
		char _0x02E0[208];
	};//Size=0x03B0
#endif

	////////////////////////////////////////
	// ClassId:   00669
	// RuntimeId: 09265
	// TypeInfo:  0x00000001427F0020
#ifndef _ClientFlareEntity_
#define _ClientFlareEntity_
	class ClientFlareEntity : public ClientGrenadeEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 669;
		}
	};//Size=0x03B0
#endif

	////////////////////////////////////////
	// ClassId:   00670
	// RuntimeId: 09264
	// TypeInfo:  0x00000001427F00C0
#ifndef _ClientExplosionPackEntity_
#define _ClientExplosionPackEntity_
	class ClientExplosionPackEntity : public ClientGhostProjectileEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 670;
		}
		char _0x02E0[208];
	};//Size=0x03B0
#endif

	////////////////////////////////////////
	// ClassId:   00528
	// RuntimeId: 09263
	// TypeInfo:  0x00000001427EFAD0
#ifndef _ClientMissilePhysicsComponent_
#define _ClientMissilePhysicsComponent_
	class ClientMissilePhysicsComponent : public ClientGamePhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 528;
		}
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   00523
	// RuntimeId: 09262
	// TypeInfo:  0x00000001427EFB20
#ifndef _ClientExplosionPackPhysicsComponent_
#define _ClientExplosionPackPhysicsComponent_
	class ClientExplosionPackPhysicsComponent : public ClientGamePhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 523;
		}
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   00339
	// RuntimeId: 05511
	// TypeInfo:  0x0000000142799B50
#ifndef _ClientEntryComponent_
#define _ClientEntryComponent_
	class ClientEntryComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 339;
		}
		char _0x0038[680];
	};//Size=0x02E0
#endif

	////////////////////////////////////////
	// ClassId:   00340
	// RuntimeId: 09260
	// TypeInfo:  0x00000001427EFB70
#ifndef _ClientRemoteEntryComponent_
#define _ClientRemoteEntryComponent_
	class ClientRemoteEntryComponent : public ClientEntryComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 340;
		}
		char _0x02E0[16];
	};//Size=0x02F0
#endif

	////////////////////////////////////////
	// ClassId:   00369
	// RuntimeId: 09259
	// TypeInfo:  0x00000001427EFBC0
#ifndef _ClientWeaponZeroingComponent_
#define _ClientWeaponZeroingComponent_
	class ClientWeaponZeroingComponent : public ClientGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 369;
		}
		char _0x0038[40];
	};//Size=0x0060
#endif

	////////////////////////////////////////
	// ClassId:   00425
	// RuntimeId: 06103
	// TypeInfo:  0x00000001427AA4A0
#ifndef _ServerGameComponent_
#define _ServerGameComponent_
	class ServerGameComponent : public GameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 425;
		}
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00496
	// RuntimeId: 06144
	// TypeInfo:  0x00000001427ABF10
#ifndef _ServerEntryComponent_
#define _ServerEntryComponent_
	class ServerEntryComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 496;
		}
		char _0x0030[320];
	};//Size=0x0170
#endif

	////////////////////////////////////////
	// ClassId:   00501
	// RuntimeId: 09256
	// TypeInfo:  0x00000001427EF2A0
#ifndef _ServerWeaponZeroingComponent_
#define _ServerWeaponZeroingComponent_
	class ServerWeaponZeroingComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 501;
		}
		char _0x0030[40];
	};//Size=0x0058
#endif

	////////////////////////////////////////
	// ClassId:   00451
	// RuntimeId: 09255
	// TypeInfo:  0x00000001427EF2F0
#ifndef _ServerSoldierWeaponsComponent_
#define _ServerSoldierWeaponsComponent_
	class ServerSoldierWeaponsComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 451;
		}
		char _0x0030[2400];
	};//Size=0x0990
#endif

	////////////////////////////////////////
	// ClassId:   00537
	// RuntimeId: 06147
	// TypeInfo:  0x00000001427AC620
#ifndef _ServerGamePhysicsComponent_
#define _ServerGamePhysicsComponent_
	class ServerGamePhysicsComponent : public PhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 537;
		}
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00555
	// RuntimeId: 06146
	// TypeInfo:  0x00000001427AC670
#ifndef _ServerGameHealthComponent_
#define _ServerGameHealthComponent_
	class ServerGameHealthComponent : public HealthComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 555;
		}
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00470
	// RuntimeId: 06130
	// TypeInfo:  0x00000001427ABE20
#ifndef _ServerCharacterCustomizationComponent_
#define _ServerCharacterCustomizationComponent_
	class ServerCharacterCustomizationComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 470;
		}
		char _0x0030[648];
	};//Size=0x02B8
#endif

	////////////////////////////////////////
	// ClassId:   00505
	// RuntimeId: 09251
	// TypeInfo:  0x00000001427EF430
#ifndef _ServerSoldierCameraComponent_
#define _ServerSoldierCameraComponent_
	class ServerSoldierCameraComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 505;
		}
		char _0x0030[112];
	};//Size=0x00A0
#endif

	////////////////////////////////////////
	// ClassId:   00426
	// RuntimeId: 09250
	// TypeInfo:  0x00000001427EF480
#ifndef _ServerSoldierBodyComponent_
#define _ServerSoldierBodyComponent_
	class ServerSoldierBodyComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 426;
		}
		char _0x0030[272];
	};//Size=0x0140
#endif

	////////////////////////////////////////
	// ClassId:   00476
	// RuntimeId: 09249
	// TypeInfo:  0x00000001427EF4D0
#ifndef _ServerRagdollComponent_
#define _ServerRagdollComponent_
	class ServerRagdollComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 476;
		}
		char _0x0030[480];
	};//Size=0x0210
#endif

	////////////////////////////////////////
	// ClassId:   00546
	// RuntimeId: 09248
	// TypeInfo:  0x00000001427EF520
#ifndef _ServerPickupPhysicsComponent_
#define _ServerPickupPhysicsComponent_
	class ServerPickupPhysicsComponent : public ServerGamePhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 546;
		}
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00463
	// RuntimeId: 09247
	// TypeInfo:  0x00000001427EF570
#ifndef _ServerMovementComponent_
#define _ServerMovementComponent_
	class ServerMovementComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 463;
		}
		char _0x0030[24];
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   00487
	// RuntimeId: 09246
	// TypeInfo:  0x00000001427EF5C0
#ifndef _ServerHitReactionComponent_
#define _ServerHitReactionComponent_
	class ServerHitReactionComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 487;
		}
		char _0x0030[112];
	};//Size=0x00A0
#endif

	////////////////////////////////////////
	// ClassId:   00486
	// RuntimeId: 09245
	// TypeInfo:  0x00000001427EF610
#ifndef _ServerBoneCollisionComponent_
#define _ServerBoneCollisionComponent_
	class ServerBoneCollisionComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 486;
		}
		char _0x0030[784];
	};//Size=0x0340
#endif

	////////////////////////////////////////
	// ClassId:   00609
	// RuntimeId: 09244
	// TypeInfo:  0x00000001427EEB30
#ifndef _ServerStateEventGateEntity_
#define _ServerStateEventGateEntity_
	class ServerStateEventGateEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 609;
		}
		char _0x0020[16];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   01115
	// RuntimeId: 09243
	// TypeInfo:  0x00000001427EEBD0
#ifndef _ServerCustomizeSoldierEntity_
#define _ServerCustomizeSoldierEntity_
	class ServerCustomizeSoldierEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1115;
		}
		char _0x0020[1696];
	};//Size=0x06C0
#endif

	////////////////////////////////////////
	// ClassId:   00688
	// RuntimeId: 06106
	// TypeInfo:  0x00000001427AA8B0
#ifndef _ServerGameComponentEntity_
#define _ServerGameComponentEntity_
	class ServerGameComponentEntity : public GameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 688;
		}
	};//Size=0x0060
#endif

	////////////////////////////////////////
	// ClassId:   00697
	// RuntimeId: 06109
	// TypeInfo:  0x00000001427AA4F0
#ifndef _ServerPhysicsEntity_
#define _ServerPhysicsEntity_
	class ServerPhysicsEntity : public ServerGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 697;
		}
		char _0x0060[8];
	};//Size=0x0068
#endif

	////////////////////////////////////////
	// ClassId:   00690
	// RuntimeId: 09240
	// TypeInfo:  0x00000001427EED10
#ifndef _ServerPickupEntity_
#define _ServerPickupEntity_
	class ServerPickupEntity : public ServerGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 690;
		}
		char _0x0060[384];
	};//Size=0x01E0
#endif

	////////////////////////////////////////
	// ClassId:   00203
	// RuntimeId: 05774
	// TypeInfo:  0x00000001427A1EC0
#ifndef _Weapon_
#define _Weapon_
	class Weapon : public Tool
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 203;
		}
		char _0x0018[328];
	};//Size=0x0160
#endif

	////////////////////////////////////////
	// ClassId:   00696
	// RuntimeId: 09238
	// TypeInfo:  0x00000001427EEDB0
#ifndef _ServerSoldierWeapon_
#define _ServerSoldierWeapon_
	class ServerSoldierWeapon : public ServerGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 696;
		}
		char _0x0060[448];
	};//Size=0x0220
#endif

	////////////////////////////////////////
	// ClassId:   00450
	// RuntimeId: 09237
	// TypeInfo:  0x00000001427EE7C0
#ifndef _ServerSoldierGripComponent_
#define _ServerSoldierGripComponent_
	class ServerSoldierGripComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 450;
		}
		char _0x0030[104];
	};//Size=0x0098
#endif

	////////////////////////////////////////
	// ClassId:   00483
	// RuntimeId: 09236
	// TypeInfo:  0x00000001427EE810
#ifndef _ServerAnimationTurretRotationComponent_
#define _ServerAnimationTurretRotationComponent_
	class ServerAnimationTurretRotationComponent : public ServerGameComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 483;
		}
		char _0x0030[80];
	};//Size=0x0080
#endif

	////////////////////////////////////////
	// ClassId:   00707
	// RuntimeId: 06100
	// TypeInfo:  0x00000001427A9DF0
#ifndef _ServerProjectileEntity_
#define _ServerProjectileEntity_
	class ServerProjectileEntity : public ServerPhysicsEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 707;
		}
		char _0x0068[232];
	};//Size=0x0150
#endif

	////////////////////////////////////////
	// ClassId:   00711
	// RuntimeId: 06098
	// TypeInfo:  0x00000001427A9FD0
#ifndef _ServerGhostProjectileEntity_
#define _ServerGhostProjectileEntity_
	class ServerGhostProjectileEntity : public ServerProjectileEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 711;
		}
		char _0x0150[400];
	};//Size=0x02E0
#endif

	////////////////////////////////////////
	// ClassId:   00547
	// RuntimeId: 09233
	// TypeInfo:  0x00000001427EE860
#ifndef _ServerMissilePhysicsComponent_
#define _ServerMissilePhysicsComponent_
	class ServerMissilePhysicsComponent : public ServerGamePhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 547;
		}
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00562
	// RuntimeId: 09232
	// TypeInfo:  0x00000001427EE8B0
#ifndef _ServerMissileHealthComponent_
#define _ServerMissileHealthComponent_
	class ServerMissileHealthComponent : public ServerGameHealthComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 562;
		}
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00543
	// RuntimeId: 09231
	// TypeInfo:  0x00000001427EE900
#ifndef _ServerExplosionPackPhysicsComponent_
#define _ServerExplosionPackPhysicsComponent_
	class ServerExplosionPackPhysicsComponent : public ServerGamePhysicsComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 543;
		}
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00556
	// RuntimeId: 09230
	// TypeInfo:  0x00000001427EE950
#ifndef _ServerExplosionPackHealthComponent_
#define _ServerExplosionPackHealthComponent_
	class ServerExplosionPackHealthComponent : public ServerGameHealthComponent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 556;
		}
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00828
	// RuntimeId: 09229
	// TypeInfo:  0x00000001427EE150
#ifndef _ClientWeaponStateEntity_
#define _ClientWeaponStateEntity_
	class ClientWeaponStateEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 828;
		}
		char _0x0020[56];
	};//Size=0x0058
#endif

	////////////////////////////////////////
	// ClassId:   01325
	// RuntimeId: 09228
	// TypeInfo:  0x00000001427EE1F0
#ifndef _ClientPlayerLookAtEntity_
#define _ClientPlayerLookAtEntity_
	class ClientPlayerLookAtEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1325;
		}
		char _0x0020[16];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00684
	// RuntimeId: 09227
	// TypeInfo:  0x00000001427EE290
#ifndef _ClientTripwireEntity_
#define _ClientTripwireEntity_
	class ClientTripwireEntity : public ClientGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 684;
		}
		char _0x0060[288];
	};//Size=0x0180
#endif

	////////////////////////////////////////
	// ClassId:   00675
	// RuntimeId: 05485
	// TypeInfo:  0x0000000142798E60
#ifndef _ClientControllableEntity_
#define _ClientControllableEntity_
	class ClientControllableEntity : public ClientPhysicsEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 675;
		}
		char _0x0068[288];
	};//Size=0x0188
#endif

	////////////////////////////////////////
	// ClassId:   00648
	// RuntimeId: 09225
	// TypeInfo:  0x00000001427EE330
#ifndef _ClientPickupEntity_
#define _ClientPickupEntity_
	class ClientPickupEntity : public ClientGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 648;
		}
		char _0x0060[1008];
	};//Size=0x0450
#endif

	////////////////////////////////////////
	// ClassId:   00637
	// RuntimeId: 09224
	// TypeInfo:  0x00000001427EE3D0
#ifndef _ClientBlockAimAssistEntity_
#define _ClientBlockAimAssistEntity_
	class ClientBlockAimAssistEntity : public SpatialEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 637;
		}
		char _0x0028[120];
	};//Size=0x00A0
#endif

	////////////////////////////////////////
	// ClassId:   01171
	// RuntimeId: 06123
	// TypeInfo:  0x00000001427AAE10
#ifndef _ServerTriggerEntity_
#define _ServerTriggerEntity_
	class ServerTriggerEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1171;
		}
		char _0x0020[72];
	};//Size=0x0068
#endif

	////////////////////////////////////////
	// ClassId:   01183
	// RuntimeId: 09211
	// TypeInfo:  0x00000001427EDE20
#ifndef _ServerCharacterStateTriggerEntity_
#define _ServerCharacterStateTriggerEntity_
	class ServerCharacterStateTriggerEntity : public ServerTriggerEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1183;
		}
		char _0x0068[32];
	};//Size=0x0088
#endif

	////////////////////////////////////////
	// ClassId:   01294
	// RuntimeId: 09210
	// TypeInfo:  0x00000001427EDEC0
#ifndef _ServerWeaponStateEntity_
#define _ServerWeaponStateEntity_
	class ServerWeaponStateEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1294;
		}
		char _0x0020[48];
	};//Size=0x0050
#endif

	////////////////////////////////////////
	// ClassId:   03335
	// RuntimeId: 07535
	// TypeInfo:  0x00000001427CC930
#ifndef _WaypointData_
#define _WaypointData_
#pragma pack(push, 8)
	class WaypointData : public DataContainer
	{
	public:
		static __inline WaypointData* DefaultInstance()
		{
			return (WaypointData*)0x00000000463BCF20;
		}
		static __inline unsigned int ClassId()
		{
			return 3335;
		}
		__int32 m_SchematicsNameHash; //0x0010
		unsigned __int32 m_WaypointId; //0x0014
		bool m_UseClientsPosition; //0x0018
		char _0x0019[7];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02292
	// RuntimeId: 09207
	// TypeInfo:  0x00000001427ED660
#ifndef _RailRideHeliSegmentData_
#define _RailRideHeliSegmentData_
#pragma pack(push, 16)
	class RailRideHeliSegmentData : public EntityData
	{
	public:
		static __inline RailRideHeliSegmentData* DefaultInstance()
		{
			return (RailRideHeliSegmentData*)0x00000000463951C0;
		}
		static __inline unsigned int ClassId()
		{
			return 2292;
		}
		__int32 m_StartIndex; //0x0018
		char _0x001C[4];
		Vec4 m_EditorColor; //0x0020
		__int32 m_EndIndex; //0x0030
		__int32 m_NodeIndex1; //0x0034
		__int32 m_NodeIndex2; //0x0038
		__int32 m_NodeIndex3; //0x003C
		float m_ExternalTime; //0x0040
		float m_StartDelay; //0x0044
		float m_WaypointsSpeedScale; //0x0048
		bool m_Looping; //0x004C
		bool m_TeleportOnActivate; //0x004D
		bool m_ForceSpeedOnActivate; //0x004E
		bool m_ForceDirectionOnActivate; //0x004F
		bool m_TeleportOnLoop; //0x0050
		bool m_OldRailCompatibility; //0x0051
		char _0x0052[14];
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02362
	// RuntimeId: 09205
	// TypeInfo:  0x00000001427ED6C0
#ifndef _RailRideNodeHeliData_
#define _RailRideNodeHeliData_
#pragma pack(push, 16)
	class RailRideNodeHeliData : public GameComponentEntityData
	{
	public:
		static __inline RailRideNodeHeliData* DefaultInstance()
		{
			return (RailRideNodeHeliData*)0x00000000463974A0;
		}
		static __inline unsigned int ClassId()
		{
			return 2362;
		}
		float m_WindNoise; //0x0080
		float m_Speed; //0x0084
		float m_PointToDistance; //0x0088
		float m_Curvature; //0x008C
		float m_Constraint; //0x0090
		float m_ForcePitch; //0x0094
		float m_BankingScale; //0x0098
		bool m_LimitWindToHorizontal; //0x009C
		bool m_UseVelocityDirection; //0x009D
		bool m_PointForward; //0x009E
		bool m_WingMode; //0x009F
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02402
	// RuntimeId: 09203
	// TypeInfo:  0x00000001427ED720
#ifndef _RailRideNodePointToData_
#define _RailRideNodePointToData_
#pragma pack(push, 16)
	class RailRideNodePointToData : public GameComponentEntityData
	{
	public:
		static __inline RailRideNodePointToData* DefaultInstance()
		{
			return (RailRideNodePointToData*)0x000000004639A650;
		}
		static __inline unsigned int ClassId()
		{
			return 2402;
		}
		RailRideHeliPointToSide m_Side; //0x0080
		char _0x0084[12];
	};//Size=0x0090
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02404
	// RuntimeId: 09199
	// TypeInfo:  0x00000001427ED5A0
#ifndef _RailRideHeliData_
#define _RailRideHeliData_
#pragma pack(push, 16)
	class RailRideHeliData : public GameComponentEntityData
	{
	public:
		static __inline RailRideHeliData* DefaultInstance()
		{
			return (RailRideHeliData*)0x000000004639A820;
		}
		static __inline unsigned int ClassId()
		{
			return 2404;
		}
		LinearTransform m_RootTransform; //0x0080
		LinearTransform m_ReferenceTransform; //0x00C0
		LinearTransform m_BlendTransform; //0x0100
		Vec3 m_PointToOverride; //0x0140
		float m_AngularApproachSlow; //0x0150
		float m_AngularApproachFast; //0x0154
		float m_TiltMax; //0x0158
		float m_TiltAccelMult; //0x015C
		float m_TiltSpeedMult; //0x0160
		float m_VeerDurationMin; //0x0164
		float m_VeerDurationMax; //0x0168
		float m_VeerPositionOffsetMin; //0x016C
		float m_VeerPositionOffsetMax; //0x0170
		float m_VeerHeadingOffsetMin; //0x0174
		float m_VeerHeadingOffsetMax; //0x0178
		__int32 m_SimulationStepsPerFrame; //0x017C
		float m_SoundAccelToThrottleMult; //0x0180
		float m_SoundSpeedToThrottleMult; //0x0184
		float m_Blend; //0x0188
		float m_SpeedMultiplier; //0x018C
		bool m_EnablePointToOverride; //0x0190
		bool m_UseSegmentExternalTime; //0x0191
		bool m_Braking; //0x0192
		bool m_TransformWaypoints; //0x0193
		bool m_ApplySpeedFix; //0x0194
		char _0x0195[11];
	};//Size=0x01A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01295
	// RuntimeId: 09197
	// TypeInfo:  0x00000001427ED780
#ifndef _RailRideHeliSegment_
#define _RailRideHeliSegment_
	class RailRideHeliSegment : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1295;
		}
		char _0x0020[16];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00693
	// RuntimeId: 09196
	// TypeInfo:  0x00000001427ED820
#ifndef _ServerRailRideHeliEntity_
#define _ServerRailRideHeliEntity_
	class ServerRailRideHeliEntity : public ServerGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 693;
		}
		char _0x0060[1280];
	};//Size=0x0560
#endif

	////////////////////////////////////////
	// ClassId:   00685
	// RuntimeId: 09195
	// TypeInfo:  0x00000001427ED8C0
#ifndef _ClientRailRideHeliEntity_
#define _ClientRailRideHeliEntity_
	class ClientRailRideHeliEntity : public ClientGameComponentEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 685;
		}
		char _0x0060[1216];
	};//Size=0x0520
#endif

	////////////////////////////////////////
	// ClassId:   03689
	// RuntimeId: 09194
	// TypeInfo:  0x00000001427ED240
#ifndef _OriginSettings_
#define _OriginSettings_
#pragma pack(push, 8)
	class OriginSettings : public SystemSettings
	{
	public:
		static __inline OriginSettings* DefaultInstance()
		{
			return (OriginSettings*)0x00000000463C4380;
		}
		static __inline unsigned int ClassId()
		{
			return 3689;
		}
		char* m_ContentId; //0x0020
		char* m_Title; //0x0028
		char* m_MultiplayerId; //0x0030
		char* m_Language; //0x0038
		OriginTokenType m_TokenType; //0x0040
		char _0x0044[4];
		char* m_AuthCodeClientId; //0x0048
		bool m_Enabled; //0x0050
		bool m_Log; //0x0051
		bool m_AllowProductionEnvironment; //0x0052
		char _0x0053[5];
	};//Size=0x0058
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00001
	// RuntimeId: 09152
	// TypeInfo:  0x00000001427EBD10
#ifndef _PresenceRequestParameters_
#define _PresenceRequestParameters_
	class PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1;
		}
		char _0x0000[8];
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00011
	// RuntimeId: 09187
	// TypeInfo:  0x00000001427EC7C0
#ifndef _PresenceGetNativeDataByInviteTokenRequestParameters_
#define _PresenceGetNativeDataByInviteTokenRequestParameters_
	class PresenceGetNativeDataByInviteTokenRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 11;
		}
		char _0x0008[112];
	};//Size=0x0078
#endif

	////////////////////////////////////////
	// ClassId:   00061
	// RuntimeId: 09186
	// TypeInfo:  0x00000001427EC810
#ifndef _PresenceGetUserIdRequestParameters_
#define _PresenceGetUserIdRequestParameters_
	class PresenceGetUserIdRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 61;
		}
		char _0x0008[56];
	};//Size=0x0040
#endif

	////////////////////////////////////////
	// ClassId:   00015
	// RuntimeId: 09185
	// TypeInfo:  0x00000001427EC860
#ifndef _PresenceSetPlaygroupMemberAttributesRequestParameters_
#define _PresenceSetPlaygroupMemberAttributesRequestParameters_
	class PresenceSetPlaygroupMemberAttributesRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 15;
		}
		char _0x0008[56];
	};//Size=0x0040
#endif

	////////////////////////////////////////
	// ClassId:   00047
	// RuntimeId: 09184
	// TypeInfo:  0x00000001427EC8B0
#ifndef _PresenceLookupPlaygroupsByIdRequestParameters_
#define _PresenceLookupPlaygroupsByIdRequestParameters_
	class PresenceLookupPlaygroupsByIdRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 47;
		}
		char _0x0008[40];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00060
	// RuntimeId: 09183
	// TypeInfo:  0x00000001427EC900
#ifndef _PresenceViewInviteRequestParameters_
#define _PresenceViewInviteRequestParameters_
	class PresenceViewInviteRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 60;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00012
	// RuntimeId: 09182
	// TypeInfo:  0x00000001427EC950
#ifndef _PresenceKickFromPlaygroupRequestParameters_
#define _PresenceKickFromPlaygroupRequestParameters_
	class PresenceKickFromPlaygroupRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 12;
		}
		char _0x0008[80];
	};//Size=0x0058
#endif

	////////////////////////////////////////
	// ClassId:   00042
	// RuntimeId: 09181
	// TypeInfo:  0x00000001427EC9A0
#ifndef _PresenceSendInviteRequestParameters_
#define _PresenceSendInviteRequestParameters_
	class PresenceSendInviteRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 42;
		}
		char _0x0008[448];
	};//Size=0x01C8
#endif

	////////////////////////////////////////
	// ClassId:   00059
	// RuntimeId: 09180
	// TypeInfo:  0x00000001427EC9F0
#ifndef _PresenceJoinGameByOnlineNativeDataRequestParameters_
#define _PresenceJoinGameByOnlineNativeDataRequestParameters_
	class PresenceJoinGameByOnlineNativeDataRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 59;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00022
	// RuntimeId: 09179
	// TypeInfo:  0x00000001427ECA40
#ifndef _PresenceGetLeaderboardRequestParameters_
#define _PresenceGetLeaderboardRequestParameters_
	class PresenceGetLeaderboardRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 22;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00036
	// RuntimeId: 09178
	// TypeInfo:  0x00000001427ECA90
#ifndef _PresenceDownloadStatisticsRequestParameters_
#define _PresenceDownloadStatisticsRequestParameters_
	class PresenceDownloadStatisticsRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 36;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00005
	// RuntimeId: 09177
	// TypeInfo:  0x00000001427ECAE0
#ifndef _PresenceSetPlaygroupJoinabilityRequestParameters_
#define _PresenceSetPlaygroupJoinabilityRequestParameters_
	class PresenceSetPlaygroupJoinabilityRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 5;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00029
	// RuntimeId: 09176
	// TypeInfo:  0x00000001427ECB30
#ifndef _PresenceSetPlaygroupAttributeRequestParameters_
#define _PresenceSetPlaygroupAttributeRequestParameters_
	class PresenceSetPlaygroupAttributeRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 29;
		}
		char _0x0008[72];
	};//Size=0x0050
#endif

	////////////////////////////////////////
	// ClassId:   00065
	// RuntimeId: 09175
	// TypeInfo:  0x00000001427ECB80
#ifndef _PresenceDisbandPlaygroupRequestParameters_
#define _PresenceDisbandPlaygroupRequestParameters_
	class PresenceDisbandPlaygroupRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 65;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00057
	// RuntimeId: 09174
	// TypeInfo:  0x00000001427ECBD0
#ifndef _PresenceLeavePlaygroupRequestParameters_
#define _PresenceLeavePlaygroupRequestParameters_
	class PresenceLeavePlaygroupRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 57;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00048
	// RuntimeId: 09173
	// TypeInfo:  0x00000001427ECC20
#ifndef _PresenceJoinPlaygroupByInviteTokenRequestParameters_
#define _PresenceJoinPlaygroupByInviteTokenRequestParameters_
	class PresenceJoinPlaygroupByInviteTokenRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 48;
		}
		char _0x0008[104];
	};//Size=0x0070
#endif

	////////////////////////////////////////
	// ClassId:   00058
	// RuntimeId: 09172
	// TypeInfo:  0x00000001427ECC70
#ifndef _PresenceJoinPlaygroupByOnlineNativeDataRequestParameters_
#define _PresenceJoinPlaygroupByOnlineNativeDataRequestParameters_
	class PresenceJoinPlaygroupByOnlineNativeDataRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 58;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00004
	// RuntimeId: 09171
	// TypeInfo:  0x00000001427ECCC0
#ifndef _PresenceJoinPlaygroupByUsernameRequestParameters_
#define _PresenceJoinPlaygroupByUsernameRequestParameters_
	class PresenceJoinPlaygroupByUsernameRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 4;
		}
		char _0x0008[40];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00051
	// RuntimeId: 09170
	// TypeInfo:  0x00000001427ECD10
#ifndef _PresenceJoinPlaygroupRequestParameters_
#define _PresenceJoinPlaygroupRequestParameters_
	class PresenceJoinPlaygroupRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 51;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00031
	// RuntimeId: 09169
	// TypeInfo:  0x00000001427ECD60
#ifndef _PresenceCreatePlaygroupRequestParameters_
#define _PresenceCreatePlaygroupRequestParameters_
	class PresenceCreatePlaygroupRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 31;
		}
		char _0x0008[64];
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   00050
	// RuntimeId: 09168
	// TypeInfo:  0x00000001427ECDB0
#ifndef _PresenceHttpPostRequestParameters_
#define _PresenceHttpPostRequestParameters_
	class PresenceHttpPostRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 50;
		}
		char _0x0008[40];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00026
	// RuntimeId: 09167
	// TypeInfo:  0x00000001427ECE00
#ifndef _PresenceHttpGetRequestParameters_
#define _PresenceHttpGetRequestParameters_
	class PresenceHttpGetRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 26;
		}
		char _0x0008[40];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00013
	// RuntimeId: 09166
	// TypeInfo:  0x00000001427ECE50
#ifndef _PresenceGetBlockListRequestParameters_
#define _PresenceGetBlockListRequestParameters_
	class PresenceGetBlockListRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 13;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00002
	// RuntimeId: 09165
	// TypeInfo:  0x00000001427ECEA0
#ifndef _PresenceRemoveFriendRequestParameters_
#define _PresenceRemoveFriendRequestParameters_
	class PresenceRemoveFriendRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 2;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00049
	// RuntimeId: 09164
	// TypeInfo:  0x00000001427ECEF0
#ifndef _PresenceInviteFriendRequestParameters_
#define _PresenceInviteFriendRequestParameters_
	class PresenceInviteFriendRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 49;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00008
	// RuntimeId: 09163
	// TypeInfo:  0x00000001427ECF40
#ifndef _PresenceDownloadBlobRequestParameters_
#define _PresenceDownloadBlobRequestParameters_
	class PresenceDownloadBlobRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 8;
		}
		char _0x0008[24];
	};//Size=0x0020
#endif

	////////////////////////////////////////
	// ClassId:   00027
	// RuntimeId: 09162
	// TypeInfo:  0x00000001427ECF90
#ifndef _PresenceUpdateAchievementsRequestParameters_
#define _PresenceUpdateAchievementsRequestParameters_
	class PresenceUpdateAchievementsRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 27;
		}
		char _0x0008[48];
	};//Size=0x0038
#endif

	////////////////////////////////////////
	// ClassId:   00009
	// RuntimeId: 09161
	// TypeInfo:  0x00000001427ECFE0
#ifndef _PresenceUnlockAchievementsRequestParameters_
#define _PresenceUnlockAchievementsRequestParameters_
	class PresenceUnlockAchievementsRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 9;
		}
		char _0x0008[32];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00068
	// RuntimeId: 09151
	// TypeInfo:  0x00000001427EBD60
#ifndef _PresenceEvent_
#define _PresenceEvent_
	class PresenceEvent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 68;
		}
		char _0x0000[8];
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00070
	// RuntimeId: 09159
	// TypeInfo:  0x00000001427ED030
#ifndef _OnlineStatusEvent_
#define _OnlineStatusEvent_
	class OnlineStatusEvent : public PresenceEvent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 70;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00069
	// RuntimeId: 09158
	// TypeInfo:  0x00000001427EC5E0
#ifndef _FirstPartyNetworkStatusEvent_
#define _FirstPartyNetworkStatusEvent_
	class FirstPartyNetworkStatusEvent : public PresenceEvent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 69;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00074
	// RuntimeId: 09157
	// TypeInfo:  0x00000001427ED080
#ifndef _ActiveControllerUpdatedEvent_
#define _ActiveControllerUpdatedEvent_
	class ActiveControllerUpdatedEvent : public PresenceEvent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 74;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00075
	// RuntimeId: 09156
	// TypeInfo:  0x00000001427EC630
#ifndef _PlaygroupUpdatedEvent_
#define _PlaygroupUpdatedEvent_
	class PlaygroupUpdatedEvent : public PresenceEvent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 75;
		}
		char _0x0008[56];
	};//Size=0x0040
#endif

	////////////////////////////////////////
	// ClassId:   00071
	// RuntimeId: 09155
	// TypeInfo:  0x00000001427EC680
#ifndef _FriendUpdatedEvent_
#define _FriendUpdatedEvent_
	class FriendUpdatedEvent : public PresenceEvent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 71;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00077
	// RuntimeId: 08950
	// TypeInfo:  0x00000001427E8A80
#ifndef _PresenceBackend_
#define _PresenceBackend_
	class PresenceBackend
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 77;
		}
		char _0x0000[32];
	};//Size=0x0020
#endif

	////////////////////////////////////////
	// ClassId:   00079
	// RuntimeId: 09153
	// TypeInfo:  0x00000001427EC720
#ifndef _BlazePresenceBackend_
#define _BlazePresenceBackend_
	class BlazePresenceBackend : public PresenceBackend
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 79;
		}
		char _0x0020[144];
	};//Size=0x00B0
#endif

	////////////////////////////////////////
	// ClassId:   00067
	// RuntimeId: 09188
	// TypeInfo:  0x00000001427EC770
#ifndef _PresenceDownloadUpdateRequestParameters_
#define _PresenceDownloadUpdateRequestParameters_
	class PresenceDownloadUpdateRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 67;
		}
		char _0x0008[16];
	};//Size=0x0018
#endif

	////////////////////////////////////////
	// ClassId:   00076
	// RuntimeId: 09160
	// TypeInfo:  0x00000001427EC590
#ifndef _BlockListEvent_
#define _BlockListEvent_
	class BlockListEvent : public PresenceEvent
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 76;
		}
		char _0x0008[12952];
	};//Size=0x32A0
#endif

	////////////////////////////////////////
	// ClassId:   03700
	// RuntimeId: 09150
	// TypeInfo:  0x00000001427EB100
#ifndef _OnlineSettings_
#define _OnlineSettings_
#pragma pack(push, 8)
	class OnlineSettings : public SystemSettings
	{
	public:
		static __inline OnlineSettings* DefaultInstance()
		{
			return (OnlineSettings*)0x00000000463C4C90;
		}
		static __inline unsigned int ClassId()
		{
			return 3700;
		}
		BackendType m_Backend; //0x0020
		BackendType m_PeerBackend; //0x0024
		OnlineEnvironment m_Environment; //0x0028
		char _0x002C[4];
		OnlineProviderAsset* m_Provider; //0x0030
		Array<OnlinePlatformConfiguration> m_Platforms; //0x0038
		char* m_ServiceNameOverride; //0x0040
		__int32 m_BlazeLogLevel; //0x0048
		__int32 m_DirtySockLogLevel; //0x004C
		RichPresenceData* m_RichPresence; //0x0050
		LicenseConfiguration* m_LicenseConfig; //0x0058
		char* m_MatchmakingOptions; //0x0060
		char* m_MatchmakingMode; //0x0068
		char* m_Region; //0x0070
		char* m_Country; //0x0078
		char* m_PingSite; //0x0080
		char* m_MatchmakingToken; //0x0088
		unsigned __int32 m_NegativeUserCacheRefreshPeriod; //0x0090
		char _0x0094[4];
		char* m_ServerLoginEmail; //0x0098
		char* m_ServerLoginPassword; //0x00A0
		char* m_ServerLoginPersonaName; //0x00A8
		__int32 m_BlazeServerConnectionTimeout; //0x00B0
		__int32 m_BlazeServerTimeout; //0x00B4
		__int32 m_BlazeClientConnectionTimeout; //0x00B8
		__int32 m_BlazeClientTimeout; //0x00BC
		bool m_ClientIsPresenceEnabled; //0x00C0
		bool m_ServerIsPresenceEnabled; //0x00C1
		bool m_UseExternalLoginFlow; //0x00C2
		bool m_IsSecure; //0x00C3
		bool m_EnableQoS; //0x00C4
		bool m_MatchmakeImmediately; //0x00C5
		bool m_ServerIsReconfigurable; //0x00C6
		bool m_SupportHostMigration; //0x00C7
		bool m_ServerAllowAnyReputation; //0x00C8
		char _0x00C9[7];
	};//Size=0x00D0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01890
	// RuntimeId: 09146
	// TypeInfo:  0x00000001427EB160
#ifndef _OnlineServicesAsset_
#define _OnlineServicesAsset_
#pragma pack(push, 8)
	class OnlineServicesAsset : public Asset
	{
	public:
		static __inline OnlineServicesAsset* DefaultInstance()
		{
			return (OnlineServicesAsset*)0x000000004638C0E0;
		}
		static __inline unsigned int ClassId()
		{
			return 1890;
		}
		Array<PresenceServiceData*> m_OnlineServices; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01567
	// RuntimeId: 09130
	// TypeInfo:  0x00000001427EB460
#ifndef _PresenceServiceData_
#define _PresenceServiceData_
#pragma pack(push, 8)
	class PresenceServiceData : public Asset
	{
	public:
		static __inline PresenceServiceData* DefaultInstance()
		{
			return (PresenceServiceData*)0x0000000046384C40;
		}
		static __inline unsigned int ClassId()
		{
			return 1567;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01588
	// RuntimeId: 09142
	// TypeInfo:  0x00000001427EB220
#ifndef _PresenceUserIdServiceData_
#define _PresenceUserIdServiceData_
#pragma pack(push, 8)
	class PresenceUserIdServiceData : public PresenceServiceData
	{
	public:
		static __inline PresenceUserIdServiceData* DefaultInstance()
		{
			return (PresenceUserIdServiceData*)0x00000000463850E0;
		}
		static __inline unsigned int ClassId()
		{
			return 1588;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01584
	// RuntimeId: 09140
	// TypeInfo:  0x00000001427EB280
#ifndef _PresenceStatisticsServiceData_
#define _PresenceStatisticsServiceData_
#pragma pack(push, 8)
	class PresenceStatisticsServiceData : public PresenceServiceData
	{
	public:
		static __inline PresenceStatisticsServiceData* DefaultInstance()
		{
			return (PresenceStatisticsServiceData*)0x0000000046384F80;
		}
		static __inline unsigned int ClassId()
		{
			return 1584;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01568
	// RuntimeId: 09138
	// TypeInfo:  0x00000001427EB2E0
#ifndef _PresencePlaygroupServiceData_
#define _PresencePlaygroupServiceData_
#pragma pack(push, 8)
	class PresencePlaygroupServiceData : public PresenceServiceData
	{
	public:
		static __inline PresencePlaygroupServiceData* DefaultInstance()
		{
			return (PresencePlaygroupServiceData*)0x0000000046384C70;
		}
		static __inline unsigned int ClassId()
		{
			return 1568;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01590
	// RuntimeId: 09136
	// TypeInfo:  0x00000001427EB340
#ifndef _PresenceLeaderboardServiceData_
#define _PresenceLeaderboardServiceData_
#pragma pack(push, 8)
	class PresenceLeaderboardServiceData : public PresenceServiceData
	{
	public:
		static __inline PresenceLeaderboardServiceData* DefaultInstance()
		{
			return (PresenceLeaderboardServiceData*)0x0000000046385140;
		}
		static __inline unsigned int ClassId()
		{
			return 1590;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01581
	// RuntimeId: 09134
	// TypeInfo:  0x00000001427EB3A0
#ifndef _PresenceFriendsServiceData_
#define _PresenceFriendsServiceData_
#pragma pack(push, 8)
	class PresenceFriendsServiceData : public PresenceServiceData
	{
	public:
		static __inline PresenceFriendsServiceData* DefaultInstance()
		{
			return (PresenceFriendsServiceData*)0x0000000046384EF0;
		}
		static __inline unsigned int ClassId()
		{
			return 1581;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01575
	// RuntimeId: 09132
	// TypeInfo:  0x00000001427EB400
#ifndef _PresenceAchievementServiceData_
#define _PresenceAchievementServiceData_
#pragma pack(push, 8)
	class PresenceAchievementServiceData : public PresenceServiceData
	{
	public:
		static __inline PresenceAchievementServiceData* DefaultInstance()
		{
			return (PresenceAchievementServiceData*)0x0000000046384DD0;
		}
		static __inline unsigned int ClassId()
		{
			return 1575;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01578
	// RuntimeId: 09144
	// TypeInfo:  0x00000001427EB1C0
#ifndef _PresencePrivilegeServiceData_
#define _PresencePrivilegeServiceData_
#pragma pack(push, 8)
	class PresencePrivilegeServiceData : public PresenceServiceData
	{
	public:
		static __inline PresencePrivilegeServiceData* DefaultInstance()
		{
			return (PresencePrivilegeServiceData*)0x0000000046384E60;
		}
		static __inline unsigned int ClassId()
		{
			return 1578;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01467
	// RuntimeId: 09128
	// TypeInfo:  0x00000001427EB4C0
#ifndef _OnlineProviderAsset_
#define _OnlineProviderAsset_
#pragma pack(push, 8)
	class OnlineProviderAsset : public Asset
	{
	public:
		static __inline OnlineProviderAsset* DefaultInstance()
		{
			return (OnlineProviderAsset*)0x0000000046382A70;
		}
		static __inline unsigned int ClassId()
		{
			return 1467;
		}
		Array<OnlineProviderConfiguration> m_Configurations; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03118
	// RuntimeId: 09122
	// TypeInfo:  0x00000001427EB520
#ifndef _OnlineRichPresenceLevelDescriptionComponent_
#define _OnlineRichPresenceLevelDescriptionComponent_
#pragma pack(push, 8)
	class OnlineRichPresenceLevelDescriptionComponent : public LevelDescriptionComponent
	{
	public:
		static __inline OnlineRichPresenceLevelDescriptionComponent* DefaultInstance()
		{
			return (OnlineRichPresenceLevelDescriptionComponent*)0x00000000463B7D10;
		}
		static __inline unsigned int ClassId()
		{
			return 3118;
		}
		RichPresencePresenceString* m_PresenceMode; //0x0010
		Array<RichPresenceContextSetting> m_ContextValues; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01873
	// RuntimeId: 09102
	// TypeInfo:  0x00000001427EB6A0
#ifndef _ServerBackendData_
#define _ServerBackendData_
#pragma pack(push, 8)
	class ServerBackendData : public Asset
	{
	public:
		static __inline ServerBackendData* DefaultInstance()
		{
			return (ServerBackendData*)0x000000004638B8B0;
		}
		static __inline unsigned int ClassId()
		{
			return 1873;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01876
	// RuntimeId: 09106
	// TypeInfo:  0x00000001427EB5E0
#ifndef _LanServerBackendData_
#define _LanServerBackendData_
#pragma pack(push, 8)
	class LanServerBackendData : public ServerBackendData
	{
	public:
		static __inline LanServerBackendData* DefaultInstance()
		{
			return (LanServerBackendData*)0x000000004638B940;
		}
		static __inline unsigned int ClassId()
		{
			return 1876;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01874
	// RuntimeId: 09104
	// TypeInfo:  0x00000001427EB640
#ifndef _LocalServerBackendData_
#define _LocalServerBackendData_
#pragma pack(push, 8)
	class LocalServerBackendData : public ServerBackendData
	{
	public:
		static __inline LocalServerBackendData* DefaultInstance()
		{
			return (LocalServerBackendData*)0x000000004638B8E0;
		}
		static __inline unsigned int ClassId()
		{
			return 1874;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01878
	// RuntimeId: 09110
	// TypeInfo:  0x00000001427EB580
#ifndef _BlazeServerBackendData_
#define _BlazeServerBackendData_
#pragma pack(push, 8)
	class BlazeServerBackendData : public ServerBackendData
	{
	public:
		static __inline BlazeServerBackendData* DefaultInstance()
		{
			return (BlazeServerBackendData*)0x000000004638B9B0;
		}
		static __inline unsigned int ClassId()
		{
			return 1878;
		}
		BlazeCreateGameParameters m_CreateParameters; //0x0018
		OnlineEnvironmentConsoleUrl m_ConfigUrl; //0x0020
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01533
	// RuntimeId: 09068
	// TypeInfo:  0x00000001427EBA00
#ifndef _PresenceBackendData_
#define _PresenceBackendData_
#pragma pack(push, 8)
	class PresenceBackendData : public Asset
	{
	public:
		static __inline PresenceBackendData* DefaultInstance()
		{
			return (PresenceBackendData*)0x00000000463841A0;
		}
		static __inline unsigned int ClassId()
		{
			return 1533;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01542
	// RuntimeId: 09098
	// TypeInfo:  0x00000001427EB760
#ifndef _Ps4PresenceBackendData_
#define _Ps4PresenceBackendData_
#pragma pack(push, 8)
	class Ps4PresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline Ps4PresenceBackendData* DefaultInstance()
		{
			return (Ps4PresenceBackendData*)0x00000000463843C0;
		}
		static __inline unsigned int ClassId()
		{
			return 1542;
		}
		Ps4TitleData m_DefaultTitleData; //0x0018
		Array<Ps4TitleData> m_TitleData; //0x0028
		Ps4AgeSettings m_AgeSettings; //0x0030
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01543
	// RuntimeId: 09090
	// TypeInfo:  0x00000001427EB7C0
#ifndef _XenonPresenceBackendData_
#define _XenonPresenceBackendData_
#pragma pack(push, 8)
	class XenonPresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline XenonPresenceBackendData* DefaultInstance()
		{
			return (XenonPresenceBackendData*)0x0000000046384420;
		}
		static __inline unsigned int ClassId()
		{
			return 1543;
		}
		unsigned __int32 m_TitleId; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01540
	// RuntimeId: 09088
	// TypeInfo:  0x00000001427EB820
#ifndef _Ps3PresenceBackendData_
#define _Ps3PresenceBackendData_
#pragma pack(push, 8)
	class Ps3PresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline Ps3PresenceBackendData* DefaultInstance()
		{
			return (Ps3PresenceBackendData*)0x0000000046384320;
		}
		static __inline unsigned int ClassId()
		{
			return 1540;
		}
		char* m_CommunicationId; //0x0018
		char* m_CommunicationSignature; //0x0020
		Array<Ps3ParentalLockAgeSettings> m_ParentalLockAgeSettings; //0x0028
		Array<Ps3ServiceSettings> m_ServiceSettings; //0x0030
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03543
	// RuntimeId: 09080
	// TypeInfo:  0x00000001427EB880
#ifndef _Ps3ParentalLockAgeSettingsOverrides_
#define _Ps3ParentalLockAgeSettingsOverrides_
#pragma pack(push, 8)
	class Ps3ParentalLockAgeSettingsOverrides : public DataContainer
	{
	public:
		static __inline Ps3ParentalLockAgeSettingsOverrides* DefaultInstance()
		{
			return (Ps3ParentalLockAgeSettingsOverrides*)0x00000000463C1740;
		}
		static __inline unsigned int ClassId()
		{
			return 3543;
		}
		Array<Ps3ParentalLockAgeSettingsForCountry> m_Overrides; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01537
	// RuntimeId: 09074
	// TypeInfo:  0x00000001427EB8E0
#ifndef _LanPresenceBackendData_
#define _LanPresenceBackendData_
#pragma pack(push, 8)
	class LanPresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline LanPresenceBackendData* DefaultInstance()
		{
			return (LanPresenceBackendData*)0x0000000046384280;
		}
		static __inline unsigned int ClassId()
		{
			return 1537;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01536
	// RuntimeId: 09072
	// TypeInfo:  0x00000001427EB940
#ifndef _DirtySockPresenceBackendData_
#define _DirtySockPresenceBackendData_
#pragma pack(push, 8)
	class DirtySockPresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline DirtySockPresenceBackendData* DefaultInstance()
		{
			return (DirtySockPresenceBackendData*)0x0000000046384250;
		}
		static __inline unsigned int ClassId()
		{
			return 1536;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01541
	// RuntimeId: 09070
	// TypeInfo:  0x00000001427EB9A0
#ifndef _BlazePresenceBackendData_
#define _BlazePresenceBackendData_
#pragma pack(push, 8)
	class BlazePresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline BlazePresenceBackendData* DefaultInstance()
		{
			return (BlazePresenceBackendData*)0x0000000046384370;
		}
		static __inline unsigned int ClassId()
		{
			return 1541;
		}
		char* m_DefaultRoleName; //0x0018
		Array<MatchmakingSession*> m_MatchmakingSessions; //0x0020
		bool m_UseDemanglerService; //0x0028
		char _0x0029[7];
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01538
	// RuntimeId: 09100
	// TypeInfo:  0x00000001427EB700
#ifndef _DurangoPresenceBackendData_
#define _DurangoPresenceBackendData_
#pragma pack(push, 8)
	class DurangoPresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline DurangoPresenceBackendData* DefaultInstance()
		{
			return (DurangoPresenceBackendData*)0x00000000463842B0;
		}
		static __inline unsigned int ClassId()
		{
			return 1538;
		}
		unsigned __int32 m_TitleId; //0x0018
		char _0x001C[4];
		char* m_ServiceConfigId; //0x0020
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03397
	// RuntimeId: 09066
	// TypeInfo:  0x00000001427EBA60
#ifndef _MatchmakingSession_
#define _MatchmakingSession_
#pragma pack(push, 8)
	class MatchmakingSession : public DataContainer
	{
	public:
		static __inline MatchmakingSession* DefaultInstance()
		{
			return (MatchmakingSession*)0x00000000463BE5E0;
		}
		static __inline unsigned int ClassId()
		{
			return 3397;
		}
		MatchmakingSessionMode m_Mode; //0x0010
		unsigned __int32 m_DurationMs; //0x0014
		MatchmakingCriteria m_Criteria; //0x0018
		GameParametersData* m_CreateGameParams; //0x0088
		MatchmakingSession* m_OnNotFound; //0x0090
		Array<MatchmakingModifier*> m_Modifiers; //0x0098
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03400
	// RuntimeId: 09062
	// TypeInfo:  0x00000001427EBB20
#ifndef _MatchmakingModifier_
#define _MatchmakingModifier_
#pragma pack(push, 8)
	class MatchmakingModifier : public DataContainer
	{
	public:
		static __inline MatchmakingModifier* DefaultInstance()
		{
			return (MatchmakingModifier*)0x00000000463BE730;
		}
		static __inline unsigned int ClassId()
		{
			return 3400;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03401
	// RuntimeId: 09064
	// TypeInfo:  0x00000001427EBAC0
#ifndef _MatchmakingPlayerCapacityModifier_
#define _MatchmakingPlayerCapacityModifier_
#pragma pack(push, 8)
	class MatchmakingPlayerCapacityModifier : public MatchmakingModifier
	{
	public:
		static __inline MatchmakingPlayerCapacityModifier* DefaultInstance()
		{
			return (MatchmakingPlayerCapacityModifier*)0x00000000463BE760;
		}
		static __inline unsigned int ClassId()
		{
			return 3401;
		}
		char* m_Attribute; //0x0010
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01717
	// RuntimeId: 09000
	// TypeInfo:  0x00000001427EBB80
#ifndef _LicenseConfiguration_
#define _LicenseConfiguration_
#pragma pack(push, 8)
	class LicenseConfiguration : public Asset
	{
	public:
		static __inline LicenseConfiguration* DefaultInstance()
		{
			return (LicenseConfiguration*)0x0000000046387CF0;
		}
		static __inline unsigned int ClassId()
		{
			return 1717;
		}
		Array<LicenseInfo> m_Licenses; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01912
	// RuntimeId: 08992
	// TypeInfo:  0x00000001427EBBE0
#ifndef _GameParametersData_
#define _GameParametersData_
#pragma pack(push, 8)
	class GameParametersData : public Asset
	{
	public:
		static __inline GameParametersData* DefaultInstance()
		{
			return (GameParametersData*)0x000000004638C7F0;
		}
		static __inline unsigned int ClassId()
		{
			return 1912;
		}
		char* m_ServerName; //0x0018
		PersistenceGameType m_GameType; //0x0020
		unsigned __int32 m_QueueCapacity; //0x0024
		unsigned __int32 m_Mod; //0x0028
		unsigned __int32 m_MaxSpectators; //0x002C
		GameNetworkTopology m_GameTopology; //0x0030
		GamePeer2PeerMode m_PeerMode; //0x0034
		GameNetworkTopology m_VoipTopology; //0x0038
		char _0x003C[4];
		Array<GameAttributeData> m_Attributes; //0x0040
		Array<GameRoleInformation*> m_RoleConfiguration; //0x0048
		bool m_OpenToInvites; //0x0050
		bool m_OpenToMatchmaking; //0x0051
		bool m_OpenToJoinByPlayer; //0x0052
		bool m_OpenToBrowsing; //0x0053
		bool m_Ranked; //0x0054
		bool m_JoinInProgressSupported; //0x0055
		char _0x0056[2];
	};//Size=0x0058
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03420
	// RuntimeId: 08990
	// TypeInfo:  0x00000001427EBC40
#ifndef _GameRoleInformation_
#define _GameRoleInformation_
#pragma pack(push, 8)
	class GameRoleInformation : public DataContainer
	{
	public:
		static __inline GameRoleInformation* DefaultInstance()
		{
			return (GameRoleInformation*)0x00000000463BEC80;
		}
		static __inline unsigned int ClassId()
		{
			return 3420;
		}
		char* m_RoleName; //0x0010
		unsigned __int32 m_Capacity; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00078
	// RuntimeId: 09154
	// TypeInfo:  0x00000001427EC6D0
#ifndef _DirtySockPresenceBackend_
#define _DirtySockPresenceBackend_
	class DirtySockPresenceBackend : public PresenceBackend
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 78;
		}
		char _0x0020[128];
	};//Size=0x00A0
#endif

	////////////////////////////////////////
	// ClassId:   00084
	// RuntimeId: 08949
	// TypeInfo:  0x00000001427E8A30
#ifndef _GameParameters_
#define _GameParameters_
	class GameParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 84;
		}
		char _0x0000[960];
	};//Size=0x03C0
#endif

	////////////////////////////////////////
	// ClassId:   01589
	// RuntimeId: 08948
	// TypeInfo:  0x00000001427E7CD0
#ifndef _NickelServiceData_
#define _NickelServiceData_
#pragma pack(push, 8)
	class NickelServiceData : public PresenceServiceData
	{
	public:
		static __inline NickelServiceData* DefaultInstance()
		{
			return (NickelServiceData*)0x0000000046385110;
		}
		static __inline unsigned int ClassId()
		{
			return 1589;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01539
	// RuntimeId: 08944
	// TypeInfo:  0x00000001427E7D30
#ifndef _NickelPresenceBackendData_
#define _NickelPresenceBackendData_
#pragma pack(push, 8)
	class NickelPresenceBackendData : public PresenceBackendData
	{
	public:
		static __inline NickelPresenceBackendData* DefaultInstance()
		{
			return (NickelPresenceBackendData*)0x00000000463842F0;
		}
		static __inline unsigned int ClassId()
		{
			return 1539;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00046
	// RuntimeId: 08942
	// TypeInfo:  0x00000001427E7D90
#ifndef _PresenceOfferPlayStationPlusRequestParameters_
#define _PresenceOfferPlayStationPlusRequestParameters_
	class PresenceOfferPlayStationPlusRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 46;
		}
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00037
	// RuntimeId: 08941
	// TypeInfo:  0x00000001427E7DE0
#ifndef _PresenceRedeemCodeRequestParameters_
#define _PresenceRedeemCodeRequestParameters_
	class PresenceRedeemCodeRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 37;
		}
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00007
	// RuntimeId: 08940
	// TypeInfo:  0x00000001427E7E30
#ifndef _PresenceConsumeRequestParameters_
#define _PresenceConsumeRequestParameters_
	class PresenceConsumeRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 7;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00038
	// RuntimeId: 08939
	// TypeInfo:  0x00000001427E7E80
#ifndef _PresenceCheckoutRequestParameters_
#define _PresenceCheckoutRequestParameters_
	class PresenceCheckoutRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 38;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00035
	// RuntimeId: 08938
	// TypeInfo:  0x00000001427E7ED0
#ifndef _PresenceGetDetailedDescriptionRequestParameters_
#define _PresenceGetDetailedDescriptionRequestParameters_
	class PresenceGetDetailedDescriptionRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 35;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00043
	// RuntimeId: 08937
	// TypeInfo:  0x00000001427E7F20
#ifndef _PresenceGetBasicDescriptionRequestParameters_
#define _PresenceGetBasicDescriptionRequestParameters_
	class PresenceGetBasicDescriptionRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 43;
		}
		char _0x0008[8];
	};//Size=0x0010
#endif

	////////////////////////////////////////
	// ClassId:   00032
	// RuntimeId: 08936
	// TypeInfo:  0x00000001427E7F70
#ifndef _PresenceLoadConfigurationFileRequestParameters_
#define _PresenceLoadConfigurationFileRequestParameters_
	class PresenceLoadConfigurationFileRequestParameters : public PresenceRequestParameters
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 32;
		}
		char _0x0008[32];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00083
	// RuntimeId: 08935
	// TypeInfo:  0x00000001427E7C80
#ifndef _NickelPresenceBackend_
#define _NickelPresenceBackend_
	class NickelPresenceBackend : public PresenceBackend
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 83;
		}
		char _0x0020[352];
	};//Size=0x0180
#endif

	////////////////////////////////////////
	// ClassId:   01132
	// RuntimeId: 08934
	// TypeInfo:  0x00000001427E7820
#ifndef _LuaRunnerSharedVarsEntity_
#define _LuaRunnerSharedVarsEntity_
	class LuaRunnerSharedVarsEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1132;
		}
		char _0x0020[160];
	};//Size=0x00C0
#endif

	////////////////////////////////////////
	// ClassId:   00877
	// RuntimeId: 08933
	// TypeInfo:  0x00000001427E78C0
#ifndef _LuaRunnerScriptEntity_
#define _LuaRunnerScriptEntity_
	class LuaRunnerScriptEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 877;
		}
		char _0x0020[11392];
	};//Size=0x2CA0
#endif

	////////////////////////////////////////
	// ClassId:   00086
	// RuntimeId: 08932
	// TypeInfo:  0x00000001427E77D0
#ifndef _CompiledLuaResource_
#define _CompiledLuaResource_
	class CompiledLuaResource
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 86;
		}
		char _0x0000[88];
	};//Size=0x0058
#endif

	////////////////////////////////////////
	// ClassId:   02796
	// RuntimeId: 08931
	// TypeInfo:  0x00000001427E7600
#ifndef _LuaRunnerSharedVarsEntityData_
#define _LuaRunnerSharedVarsEntityData_
#pragma pack(push, 8)
	class LuaRunnerSharedVarsEntityData : public EntityData
	{
	public:
		static __inline LuaRunnerSharedVarsEntityData* DefaultInstance()
		{
			return (LuaRunnerSharedVarsEntityData*)0x00000000463A9DC0;
		}
		static __inline unsigned int ClassId()
		{
			return 2796;
		}
		Realm m_Realm; //0x0018
		bool m_AddToDebugDisplay; //0x001C
		char _0x001D[3];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02184
	// RuntimeId: 08929
	// TypeInfo:  0x00000001427E7660
#ifndef _LuaRunnerScriptEntityData_
#define _LuaRunnerScriptEntityData_
#pragma pack(push, 8)
	class LuaRunnerScriptEntityData : public EntityData
	{
	public:
		static __inline LuaRunnerScriptEntityData* DefaultInstance()
		{
			return (LuaRunnerScriptEntityData*)0x0000000046392BE0;
		}
		static __inline unsigned int ClassId()
		{
			return 2184;
		}
		char* m_Script; //0x0018
		Array<char*> m_InputEvents; //0x0020
		Array<char*> m_OutputEvents; //0x0028
		Array<char*> m_InputFloatProperties; //0x0030
		Array<char*> m_OutputFloatProperties; //0x0038
		Array<char*> m_InputIntProperties; //0x0040
		Array<char*> m_OutputIntProperties; //0x0048
		Array<char*> m_InputBoolProperties; //0x0050
		Array<char*> m_OutputBoolProperties; //0x0058
		Array<char*> m_InputStringProperties; //0x0060
		Array<char*> m_OutputStringProperties; //0x0068
		Array<char*> m_InputTransformProperties; //0x0070
		Array<char*> m_OutputTransformProperties; //0x0078
		Array<char*> m_InputVec3Properties; //0x0080
		Array<char*> m_OutputVec3Properties; //0x0088
		ExecuteOnPropertyChangeType m_ExecuteOnPropertyChange; //0x0090
		__int32 m_PriorityForExecutingPerFrame; //0x0094
		Realm m_Realm; //0x0098
		char _0x009C[4];
		LuaRunnerCompiledLua* m_CompiledLua; //0x00A0
		bool m_AutoStartExecutingPerFrame; //0x00A8
		bool m_AutoStartForInitialization; //0x00A9
		bool m_RunOnPropertyChange; //0x00AA
		bool m_AddToDebugDisplay; //0x00AB
		char _0x00AC[4];
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01521
	// RuntimeId: 08925
	// TypeInfo:  0x00000001427E76C0
#ifndef _LuaRunnerCompiledLua_
#define _LuaRunnerCompiledLua_
#pragma pack(push, 8)
	class LuaRunnerCompiledLua : public Asset
	{
	public:
		static __inline LuaRunnerCompiledLua* DefaultInstance()
		{
			return (LuaRunnerCompiledLua*)0x0000000046383DE0;
		}
		static __inline unsigned int ClassId()
		{
			return 1521;
		}
		// unhandled basic type ResourceRef m_CompiledLuaResource; //0x0018
		char _0x0018[8];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01474
	// RuntimeId: 08531
	// TypeInfo:  0x00000001427E23E0
#ifndef _UITextDatabase_
#define _UITextDatabase_
#pragma pack(push, 8)
	class UITextDatabase : public Asset
	{
	public:
		static __inline UITextDatabase* DefaultInstance()
		{
			return (UITextDatabase*)0x0000000046382C50;
		}
		static __inline unsigned int ClassId()
		{
			return 1474;
		}
		LanguageFormat m_Language; //0x0018
		Guid m_BinaryChunk; //0x001C
		char _0x001C[16];
		unsigned __int32 m_BinaryChunkSize; //0x002C
		Guid m_HistogramChunk; //0x0030
		char _0x0030[16];
		unsigned __int32 m_HistogramChunkSize; //0x0040
		char _0x0044[4];
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01482
	// RuntimeId: 08533
	// TypeInfo:  0x00000001427E2380
#ifndef _LocalizationAsset_
#define _LocalizationAsset_
#pragma pack(push, 8)
	class LocalizationAsset : public Asset
	{
	public:
		static __inline LocalizationAsset* DefaultInstance()
		{
			return (LocalizationAsset*)0x0000000046382F60;
		}
		static __inline unsigned int ClassId()
		{
			return 1482;
		}
		Array<UITextDatabase*> m_LocalizedTexts; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00585
	// RuntimeId: 08919
	// TypeInfo:  0x00000001427E7070
#ifndef _GroundHeightEntity_
#define _GroundHeightEntity_
	class GroundHeightEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 585;
		}
		char _0x0020[8240];
	};//Size=0x2050
#endif

	////////////////////////////////////////
	// ClassId:   01131
	// RuntimeId: 08918
	// TypeInfo:  0x00000001427E7110
#ifndef _DynamicEnvmapEntity_
#define _DynamicEnvmapEntity_
	class DynamicEnvmapEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1131;
		}
		char _0x0020[96];
	};//Size=0x0080
#endif

	////////////////////////////////////////
	// ClassId:   00616
	// RuntimeId: 08917
	// TypeInfo:  0x00000001427E71B0
#ifndef _DynamicEnlightenEntity_
#define _DynamicEnlightenEntity_
	class DynamicEnlightenEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 616;
		}
		char _0x0020[96];
	};//Size=0x0080
#endif

	////////////////////////////////////////
	// ClassId:   00092
	// RuntimeId: 08906
	// TypeInfo:  0x00000001427E6170
#ifndef _MeshEntityBase_
#define _MeshEntityBase_
	class MeshEntityBase
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 92;
		}
		char _0x0000[8];
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00632
	// RuntimeId: 05236
	// TypeInfo:  0x0000000142791420
#ifndef _LocalWindForceEntity_
#define _LocalWindForceEntity_
	class LocalWindForceEntity : public SpatialEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 632;
		}
		char _0x0028[152];
	};//Size=0x00C0
#endif

	////////////////////////////////////////
	// ClassId:   00087
	// RuntimeId: 08914
	// TypeInfo:  0x00000001427E6FD0
#ifndef _EnlightenProbeSet_
#define _EnlightenProbeSet_
	class EnlightenProbeSet
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 87;
		}
		char _0x0000[176];
	};//Size=0x00B0
#endif

	////////////////////////////////////////
	// ClassId:   00088
	// RuntimeId: 08913
	// TypeInfo:  0x00000001427E6EE0
#ifndef _EnlightenStaticDatabase_
#define _EnlightenStaticDatabase_
	class EnlightenStaticDatabase
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 88;
		}
		char _0x0000[40];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00089
	// RuntimeId: 08912
	// TypeInfo:  0x00000001427E6F30
#ifndef _EnlightenShaderDatabase_
#define _EnlightenShaderDatabase_
	class EnlightenShaderDatabase
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 89;
		}
		char _0x0000[48];
	};//Size=0x0030
#endif

	////////////////////////////////////////
	// ClassId:   00090
	// RuntimeId: 08911
	// TypeInfo:  0x00000001427E6F80
#ifndef _EnlightenDatabase_
#define _EnlightenDatabase_
	class EnlightenDatabase
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 90;
		}
		char _0x0000[128];
	};//Size=0x0080
#endif

	////////////////////////////////////////
	// ClassId:   00091
	// RuntimeId: 08910
	// TypeInfo:  0x00000001427E7020
#ifndef _EnlightenCubeMap_
#define _EnlightenCubeMap_
	class EnlightenCubeMap
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 91;
		}
		char _0x0000[592];
	};//Size=0x0250
#endif

	////////////////////////////////////////
	// ClassId:   00639
	// RuntimeId: 08909
	// TypeInfo:  0x00000001427E6300
#ifndef _ClientVisibleAreaEntity_
#define _ClientVisibleAreaEntity_
	class ClientVisibleAreaEntity : public SpatialEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 639;
		}
		char _0x0028[32];
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   00610
	// RuntimeId: 08908
	// TypeInfo:  0x00000001427E63A0
#ifndef _StaticEnlightenEntity_
#define _StaticEnlightenEntity_
	class StaticEnlightenEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 610;
		}
		char _0x0020[80];
	};//Size=0x0070
#endif

	////////////////////////////////////////
	// ClassId:   00093
	// RuntimeId: 08907
	// TypeInfo:  0x00000001427E6120
#ifndef _RigidMeshEntity_
#define _RigidMeshEntity_
	class RigidMeshEntity : public MeshEntityBase
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 93;
		}
		char _0x0008[120];
	};//Size=0x0080
#endif

	////////////////////////////////////////
	// ClassId:   00094
	// RuntimeId: 08916
	// TypeInfo:  0x00000001427E6E90
#ifndef _CompositeMeshEntity_
#define _CompositeMeshEntity_
	class CompositeMeshEntity : public MeshEntityBase
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 94;
		}
		char _0x0008[136];
	};//Size=0x0090
#endif

	////////////////////////////////////////
	// ClassId:   01283
	// RuntimeId: 08905
	// TypeInfo:  0x00000001427E6440
#ifndef _RadiosityModifierEntity_
#define _RadiosityModifierEntity_
	class RadiosityModifierEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1283;
		}
		char _0x0020[144];
	};//Size=0x00B0
#endif

	////////////////////////////////////////
	// ClassId:   00617
	// RuntimeId: 08904
	// TypeInfo:  0x00000001427E64E0
#ifndef _RadiosityMaterialEntity_
#define _RadiosityMaterialEntity_
	class RadiosityMaterialEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 617;
		}
		char _0x0020[96];
	};//Size=0x0080
#endif

	////////////////////////////////////////
	// ClassId:   00841
	// RuntimeId: 08901
	// TypeInfo:  0x00000001427E6580
#ifndef _LocalLightEntity_
#define _LocalLightEntity_
	class LocalLightEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 841;
		}
		char _0x0020[192];
	};//Size=0x00E0
#endif

	////////////////////////////////////////
	// ClassId:   00843
	// RuntimeId: 08902
	// TypeInfo:  0x00000001427E6260
#ifndef _PointLightEntity_
#define _PointLightEntity_
	class PointLightEntity : public LocalLightEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 843;
		}
	};//Size=0x00E0
#endif

	////////////////////////////////////////
	// ClassId:   00842
	// RuntimeId: 08903
	// TypeInfo:  0x00000001427E61C0
#ifndef _SpotLightEntity_
#define _SpotLightEntity_
	class SpotLightEntity : public LocalLightEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 842;
		}
		char _0x00E0[32];
	};//Size=0x0100
#endif

	////////////////////////////////////////
	// ClassId:   01139
	// RuntimeId: 08900
	// TypeInfo:  0x00000001427E6620
#ifndef _PlanarReflectionLocatorEntity_
#define _PlanarReflectionLocatorEntity_
	class PlanarReflectionLocatorEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1139;
		}
		char _0x0020[112];
	};//Size=0x0090
#endif

	////////////////////////////////////////
	// ClassId:   01203
	// RuntimeId: 08899
	// TypeInfo:  0x00000001427E66C0
#ifndef _OccluderVolumeEntity_
#define _OccluderVolumeEntity_
	class OccluderVolumeEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1203;
		}
		char _0x0020[96];
	};//Size=0x0080
#endif

	////////////////////////////////////////
	// ClassId:   00902
	// RuntimeId: 08898
	// TypeInfo:  0x00000001427E6760
#ifndef _OccluderMeshEntity_
#define _OccluderMeshEntity_
	class OccluderMeshEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 902;
		}
		char _0x0020[24];
	};//Size=0x0038
#endif

	////////////////////////////////////////
	// ClassId:   00745
	// RuntimeId: 08897
	// TypeInfo:  0x00000001427E6800
#ifndef _MeshProxyEntity_
#define _MeshProxyEntity_
	class MeshProxyEntity : public SpatialEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 745;
		}
		char _0x0028[152];
	};//Size=0x00C0
#endif

	////////////////////////////////////////
	// ClassId:   01272
	// RuntimeId: 08894
	// TypeInfo:  0x00000001427E69E0
#ifndef _RenderVolumeEntity_
#define _RenderVolumeEntity_
	class RenderVolumeEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1272;
		}
		char _0x0020[128];
	};//Size=0x00A0
#endif

	////////////////////////////////////////
	// ClassId:   01274
	// RuntimeId: 08895
	// TypeInfo:  0x00000001427E6940
#ifndef _DecalVolumeEntity_
#define _DecalVolumeEntity_
	class DecalVolumeEntity : public RenderVolumeEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1274;
		}
	};//Size=0x00A0
#endif

	////////////////////////////////////////
	// ClassId:   01273
	// RuntimeId: 08896
	// TypeInfo:  0x00000001427E68A0
#ifndef _MaskVolumeEntity_
#define _MaskVolumeEntity_
	class MaskVolumeEntity : public RenderVolumeEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1273;
		}
	};//Size=0x00A0
#endif

	////////////////////////////////////////
	// ClassId:   01292
	// RuntimeId: 08893
	// TypeInfo:  0x00000001427E6A80
#ifndef _LightProbeVolumeEntity_
#define _LightProbeVolumeEntity_
	class LightProbeVolumeEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1292;
		}
		char _0x0020[64];
	};//Size=0x0060
#endif

	////////////////////////////////////////
	// ClassId:   00858
	// RuntimeId: 08892
	// TypeInfo:  0x00000001427E6B20
#ifndef _LensFlareEntity_
#define _LensFlareEntity_
	class LensFlareEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 858;
		}
		char _0x0020[160];
	};//Size=0x00C0
#endif

	////////////////////////////////////////
	// ClassId:   01312
	// RuntimeId: 08891
	// TypeInfo:  0x00000001427E6BC0
#ifndef _IndirectCubeMapEntity_
#define _IndirectCubeMapEntity_
	class IndirectCubeMapEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 1312;
		}
		char _0x0020[144];
	};//Size=0x00B0
#endif

	////////////////////////////////////////
	// ClassId:   03318
	// RuntimeId: 08888
	// TypeInfo:  0x00000001427E4850
#ifndef _WorldRenderSettingsBase_
#define _WorldRenderSettingsBase_
#pragma pack(push, 16)
	class WorldRenderSettingsBase : public DataContainer
	{
	public:
		static __inline WorldRenderSettingsBase* DefaultInstance()
		{
			return (WorldRenderSettingsBase*)0x00000000463BC6F0;
		}
		static __inline unsigned int ClassId()
		{
			return 3318;
		}
		float m_CullScreenAreaScale; //0x0010
		float m_ViewportScale; //0x0014
		char _0x0018[8];
		Vec3 m_MotionBlurClearColor; //0x0020
		Vec3 m_DynamicEnvmapDefaultPosition; //0x0030
		float m_ShadowViewportScale; //0x0040
		float m_ShadowmapMinFov; //0x0044
		float m_ShadowmapSizeZScale; //0x0048
		unsigned __int32 m_ShadowmapResolution; //0x004C
		unsigned __int32 m_ShadowmapQuality; //0x0050
		float m_ShadowmapPoissonFilterScale; //0x0054
		unsigned __int32 m_ShadowmapSliceCount; //0x0058
		float m_ShadowmapSliceSchemeWeight; //0x005C
		float m_ShadowmapFirstSliceScale; //0x0060
		float m_ShadowmapViewDistance; //0x0064
		float m_ShadowmapExtrusionLength; //0x0068
		float m_ShadowmapTransitionBlendAmount; //0x006C
		float m_MotionBlurScale; //0x0070
		float m_MotionBlurFixedShutterTime; //0x0074
		float m_MotionBlurMax; //0x0078
		float m_MotionBlurRadialBlurMax; //0x007C
		float m_MotionBlurNoiseScale; //0x0080
		unsigned __int32 m_MotionBlurQuality; //0x0084
		unsigned __int32 m_MotionBlurDebugMode; //0x0088
		unsigned __int32 m_MotionBlurMaxSampleCount; //0x008C
		float m_ForceMotionBlurDepthCutoff; //0x0090
		float m_ForceMotionBlurCutoffGradientScale; //0x0094
		float m_MotionBlurDepthCheckThreshold; //0x0098
		float m_MotionBlurDepthCheckMaxDistance; //0x009C
		unsigned __int32 m_MultisampleCount; //0x00A0
		float m_MultisampleThreshold; //0x00A4
		__int32 m_OnlyShadowmapSlice; //0x00A8
		WorldViewMode m_ViewMode; //0x00AC
		float m_XenonHdrColorScale; //0x00B0
		float m_XenonHdrColorScaleFactor; //0x00B4
		float m_SkyEnvmapFilterWidth; //0x00B8
		unsigned __int32 m_SkyEnvmapResolution; //0x00BC
		__int32 m_DrawDebugSkyEnvmapMipLevel; //0x00C0
		MipmapFilterMode m_SkyEnvmapFilterMode; //0x00C4
		unsigned __int32 m_SkyEnvmapSidesPerFrameCount; //0x00C8
		float m_DynamicEnvmapFilterWidth; //0x00CC
		unsigned __int32 m_DynamicEnvmapResolution; //0x00D0
		__int32 m_DrawDebugDynamicEnvmapMipLevel; //0x00D4
		MipmapFilterMode m_DynamicEnvmapFilterMode; //0x00D8
		unsigned __int32 m_HudTextureWidth; //0x00DC
		unsigned __int32 m_HudTextureHeight; //0x00E0
		bool m_ShadowmapsEnable; //0x00E4
		bool m_TransparencyShadowmapsEnable; //0x00E5
		bool m_TransparencyShadowmapsHalfRes; //0x00E6
		bool m_ShadowmapFixedMovementEnable; //0x00E7
		bool m_ShadowmapFixedDepthEnable; //0x00E8
		bool m_ShadowmapViewDistanceScaleEnable; //0x00E9
		bool m_ShadowmapCullVolumeEnable; //0x00EA
		bool m_ShadowmapAccumEnable; //0x00EB
		bool m_ShadowmapAccumBilinearEnable; //0x00EC
		bool m_ShadowmapTransitionBlendEnable; //0x00ED
		bool m_Ps3ShadowmapTilingEnable; //0x00EE
		bool m_Ps3Shadowmap16BitEnable; //0x00EF
		bool m_Ps3SpotLightShadowmap16BitEnable; //0x00F0
		bool m_DxShadowmap16BitEnable; //0x00F1
		bool m_DxSpotLightShadowmap16BitEnable; //0x00F2
		bool m_ApplyShadowmapsEnable; //0x00F3
		bool m_GenerateShadowmapsEnable; //0x00F4
		bool m_SimpleShadowmapsEnable; //0x00F5
		bool m_EmitterShadowingBlendToggle; //0x00F6
		bool m_EmitterShadowingManySamplesToggle; //0x00F7
		bool m_DxLinearDepth32BitFormatEnable; //0x00F8
		bool m_DxDepthBuffer32BitEnable; //0x00F9
		bool m_MotionBlurEnable; //0x00FA
		bool m_MotionBlurForceOn; //0x00FB
		bool m_MotionBlurOptimalStableVelocityFormula; //0x00FC
		bool m_MotionBlurStencilPassEnable; //0x00FD
		bool m_MotionBlurGeometryPassEnable; //0x00FE
		bool m_MotionBlurBackgroundPassEnable; //0x00FF
		bool m_MotionBlurCenteredEnable; //0x0100
		bool m_DrawDebugMultisampleClassify; //0x0101
		bool m_DrawTransparent; //0x0102
		bool m_DrawTransparentDecal; //0x0103
		bool m_Enable; //0x0104
		bool m_HdrEnable; //0x0105
		bool m_ReadOnlyDepthEnable; //0x0106
		bool m_ConsoleRenderTargetPoolSharingEnable; //0x0107
		bool m_Ps3RenderTargetPoolGBufferOffsetEnable; //0x0108
		bool m_FastHdrEnable; //0x0109
		bool m_XenonFloatDepthBufferEnable; //0x010A
		bool m_Ps3HdrClearEnable; //0x010B
		bool m_Ps3TilingEnable; //0x010C
		bool m_Ps3ZCullEnable; //0x010D
		bool m_Ps3SCullEnable; //0x010E
		bool m_Ps3ColorCompressionEnable; //0x010F
		bool m_Ps3TiledHalfTargetEnable; //0x0110
		bool m_Ps3TiledSSAOTargetsEnable; //0x0111
		bool m_FinalPostEnable; //0x0112
		bool m_OutputGammaCorrectionEnable; //0x0113
		bool m_ScreenEffectEnable; //0x0114
		bool m_DrawLightSources; //0x0115
		bool m_DrawSolidBoundingBoxes; //0x0116
		bool m_DrawLineBoundingBoxes; //0x0117
		bool m_DrawBoundingSpheres; //0x0118
		bool m_DrawFrustums; //0x0119
		bool m_DrawDebugShadowmaps; //0x011A
		bool m_DrawDebugSpotLightShadowmaps; //0x011B
		bool m_DrawDebugSkyEnvmap; //0x011C
		bool m_DrawDebugVelocityBuffer; //0x011D
		bool m_DrawDebugZBufferEnable; //0x011E
		bool m_DrawDebugHalfResEnvironment; //0x011F
		bool m_DrawDebugDistortion; //0x0120
		bool m_DrawDebugVisibleEntityTypes; //0x0121
		bool m_DrawDebugSkyTextures; //0x0122
		bool m_DrawDebugMarschnerTextures; //0x0123
		bool m_DrawDebugDof; //0x0124
		bool m_DrawDebugDofFullscreen; //0x0125
		bool m_DrawDebugHalfResHdrTargets; //0x0126
		bool m_WireframeEnable; //0x0127
		bool m_ZPassEnable; //0x0128
		bool m_OccluderMeshZPrepassEnable; //0x0129
		bool m_OccluderMeshZPrepassDebugEnable; //0x012A
		bool m_HalfResEnable; //0x012B
		bool m_ForceFullResEnable; //0x012C
		bool m_HalfResLensFlaresEnable; //0x012D
		bool m_ForegroundEnable; //0x012E
		bool m_ForegroundDepthClearEnable; //0x012F
		bool m_ForegroundZPassEnable; //0x0130
		bool m_ForegroundTransparentEnable; //0x0131
		bool m_BilateralHalfResCompositeEnable; //0x0132
		bool m_TiledHalfResCompositeEnable; //0x0133
		bool m_TiledHalfResStencilOccludersEnable; //0x0134
		bool m_SkyEnable; //0x0135
		bool m_SkyFogEnable; //0x0136
		bool m_SkyHeightFogEnable; //0x0137
		bool m_SkyForwardScatteringEnable; //0x0138
		bool m_DistortionEnable; //0x0139
		bool m_DistortionHalfResEnable; //0x013A
		bool m_Distortion8BitEnable; //0x013B
		bool m_DistortionTilingEnable; //0x013C
		bool m_StaticEnvmapEnable; //0x013D
		bool m_CustomEnvmapEnable; //0x013E
		bool m_CustomEnvmapMipmapClampEnable; //0x013F
		bool m_SkyEnvmapEnable; //0x0140
		bool m_SkyEnvmapMipmapGenEnable; //0x0141
		bool m_SkyEnvmapUpdateEnable; //0x0142
		bool m_SkyEnvmapForceUpdateEnable; //0x0143
		bool m_SkyEnvmapUse8BitTexture; //0x0144
		bool m_DynamicEnvmapEnable; //0x0145
		bool m_DynamicEnvmapMipmapGenEnable; //0x0146
		bool m_DrawDebugDynamicEnvmap; //0x0147
		bool m_HairCoverageEnable; //0x0148
		bool m_SetupJobEnable; //0x0149
		bool m_FinishSyncJobsFirstEnable; //0x014A
		bool m_PrepareDispatchListJobEnable; //0x014B
		char _0x014C[4];
	};//Size=0x0150
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03319
	// RuntimeId: 08890
	// TypeInfo:  0x00000001427E47F0
#ifndef _WorldRenderSettings_
#define _WorldRenderSettings_
#pragma pack(push, 16)
	class WorldRenderSettings : public WorldRenderSettingsBase
	{
	public:
		static __inline WorldRenderSettings* DefaultInstance()
		{
			return (WorldRenderSettings*)0x00000000463BC860;
		}
		static __inline unsigned int ClassId()
		{
			return 3319;
		}
		Vec4 m_OverlayColor; //0x0150
		unsigned __int32 m_GenericEntityMaxVisibleEntityCount; //0x0160
		unsigned __int32 m_DrawDebugGroundHeight; //0x0164
		float m_DecalVolumeScale; //0x0168
		unsigned __int32 m_GBufferLayout; //0x016C
		unsigned __int32 m_GBufferTestCount; //0x0170
		float m_GBufferAlphaTestSimpleSmoothness; //0x0174
		float m_GBufferForceSmoothness; //0x0178
		float m_GBufferForceSpecularAlbedo; //0x017C
		QualityLevel m_SpotLightsAsConeLightsLevel; //0x0180
		float m_LightTileMinArea; //0x0184
		float m_LightStencilMinArea; //0x0188
		float m_LightNarrowAngleThreshold; //0x018C
		unsigned __int32 m_OutdoorLightTileBatchCount; //0x0190
		unsigned __int32 m_XenonDrawDebugLightTileGridMode; //0x0194
		unsigned __int32 m_XenonLightTileConstantBufferSize; //0x0198
		unsigned __int32 m_XenonLightTileMaxPointLightCount; //0x019C
		unsigned __int32 m_XenonLightTileMaxLineLightCount; //0x01A0
		unsigned __int32 m_XenonLightTileMaxSpotLightCount; //0x01A4
		unsigned __int32 m_Ps3LightTileMethod; //0x01A8
		unsigned __int32 m_Ps3LightTileJobCount; //0x01AC
		unsigned __int32 m_Ps3LightTileJobPriority; //0x01B0
		float m_Ps3LightTileJobYieldGranularity; //0x01B4
		float m_Ps3LightTileJobYieldAggressiveGranularity; //0x01B8
		unsigned __int32 m_Ps3LightTileJobMaxFbTileCount; //0x01BC
		__int32 m_OnlyLightTileIndex; //0x01C0
		unsigned __int32 m_SpotLightShadowmapResolution; //0x01C4
		unsigned __int32 m_SpotLightShadowmapQuality; //0x01C8
		float m_SpotLightShadowmapPoissonFilterScale; //0x01CC
		QualityLevel m_SpotLightShadowmapLevel; //0x01D0
		unsigned __int32 m_MaxPointLightCount; //0x01D4
		unsigned __int32 m_MaxSpotLightCount; //0x01D8
		unsigned __int32 m_MaxSpotLightShadowCount; //0x01DC
		unsigned __int32 m_MaxDestructionVolumeCount; //0x01E0
		unsigned __int32 m_MaxDecalVolumeCount; //0x01E4
		float m_SpotLightNearPlane; //0x01E8
		unsigned __int32 m_LightTileCsAvgLightCountPerTile; //0x01EC
		float m_LightLodFadeArea; //0x01F0
		float m_LightLodMinArea; //0x01F4
		float m_LightLodRadiusFactor; //0x01F8
		float m_LightLodSpecularFadeAreaStart; //0x01FC
		float m_LightLodSpecularFadeAreaEnd; //0x0200
		float m_LightForceIntensity; //0x0204
		float m_LightIntensityScale; //0x0208
		float m_LightRadiusScale; //0x020C
		float m_LightAttenuationThreshold; //0x0210
		unsigned __int32 m_ShadowOcclusionCullingWidth; //0x0214
		unsigned __int32 m_ShadowOcclusionCullingHeight; //0x0218
		unsigned __int32 m_ShadowOcclusionTriangleCount; //0x021C
		float m_FrustumSilhouetteCullingPadding; //0x0220
		__int32 m_OnlyTileIndex; //0x0224
		float m_PlanarReflectionViewScale; //0x0228
		float m_PlanarReflectionCullFOV; //0x022C
		float m_PlanarReflectionFarPlane; //0x0230
		unsigned __int32 m_DrawDebugPlanarReflectionMode; //0x0234
		float m_ReflectionLodScale; //0x0238
		PostProcessAAMode m_PostProcessAntialiasingMode; //0x023C
		__int32 m_FxaaForceVendor; //0x0240
		ScaleResampleMode m_RenderScaleResampleMode; //0x0244
		float m_LightCubeMapStencilMinArea; //0x0248
		unsigned __int32 m_DrawDebugIndirectCubeMapMipLevel; //0x024C
		unsigned __int32 m_DrawDebugIndirectCubeMapIndex; //0x0250
		bool m_SimpleRenderingEnable; //0x0254
		bool m_GenericEntityRendererEnable; //0x0255
		bool m_ZBufferShadowTestEnable; //0x0256
		bool m_DecalVolumeEnable; //0x0257
		bool m_DrawDebugDecalVolumes; //0x0258
		bool m_DrawDebugDestructionVolumes; //0x0259
		bool m_LensFlaresEnable; //0x025A
		bool m_DrawDebugLensFlareOccluders; //0x025B
		bool m_DrawDebugLensFlares; //0x025C
		bool m_LensFlareOcclusionEnable; //0x025D
		bool m_CloudShadowEnable; //0x025E
		bool m_OverrideDynamicAO; //0x025F
		bool m_DrawDebugDynamicAO; //0x0260
		bool m_EmissiveEnable; //0x0261
		bool m_UnlitEnable; //0x0262
		bool m_GBufferClearEnable; //0x0263
		bool m_DxGBufferLight16BitEnable; //0x0264
		bool m_DxGBufferNormal16BitEnable; //0x0265
		bool m_GBufferAlphaTestSimpleEnable; //0x0266
		bool m_Gen4aEsramEnable; //0x0267
		bool m_SpecularLightingEnable; //0x0268
		bool m_SkinLightingEnable; //0x0269
		bool m_TranslucencyLightingEnable; //0x026A
		bool m_DynamicEnvmapLightingEnable; //0x026B
		bool m_OutdoorLightEnable; //0x026C
		bool m_PointLightsEnable; //0x026D
		bool m_LineLightsEnable; //0x026E
		bool m_ConeLightsEnable; //0x026F
		bool m_SpotLightsEnable; //0x0270
		bool m_LightProbesEnable; //0x0271
		bool m_LightStencilMethodEnable; //0x0272
		bool m_LightVolumeMethodEnable; //0x0273
		bool m_LightVolumeDepthTestEnable; //0x0274
		bool m_OutdoorKeyLightEnable; //0x0275
		bool m_OutdoorSkyLightEnable; //0x0276
		bool m_OutdoorLightTilingEnable; //0x0277
		bool m_OutdoorLightTileRenderEnable; //0x0278
		bool m_OutdoorLightTileBlendEnable; //0x0279
		bool m_OutdoorLightTileSimpleShaderEnable; //0x027A
		bool m_XenonOutdoorLightTilingEnable; //0x027B
		bool m_XenonPointLightsTilingEnable; //0x027C
		bool m_XenonSpotLightsTilingEnable; //0x027D
		bool m_XenonLineLightsTilingEnable; //0x027E
		bool m_XenonAsyncLightJobsEnable; //0x027F
		bool m_XenonLightTileDownsampleSpecularCheckEnable; //0x0280
		bool m_XenonLightTileCpuPointLightCullingEnable; //0x0281
		bool m_XenonLightTileCpuSpotLightCullingEnable; //0x0282
		bool m_Ps3DepthBoundsLightCullingEnable; //0x0283
		bool m_Ps3LightTileJobYieldEnable; //0x0284
		bool m_Ps3LightTileClearAllEnable; //0x0285
		bool m_Ps3LightCullSpuJob; //0x0286
		bool m_SpotLightShadowmapEnable; //0x0287
		bool m_RadiositySpotLightShadowCullingEnable; //0x0288
		bool m_LightTileCsPathEnable; //0x0289
		bool m_LightTileMinMaxUseHTile; //0x028A
		bool m_LightTileSplitCullingAndLighting; //0x028B
		bool m_DrawDebugGBuffer; //0x028C
		bool m_DrawDebugLightSources; //0x028D
		bool m_DrawDebugLightShadowSources; //0x028E
		bool m_DrawDebugLightTextureSources; //0x028F
		bool m_DrawDebugLightStats; //0x0290
		bool m_DrawDebugLightTiles; //0x0291
		bool m_DrawDebugLightTileVolumes; //0x0292
		bool m_DrawDebugLightTileFbGrid; //0x0293
		bool m_DrawDebugLightTileGrid; //0x0294
		bool m_DrawDebugLightTileSources; //0x0295
		bool m_LightWidthEnable; //0x0296
		bool m_LightIntensityNormalizationEnable; //0x0297
		bool m_LightCullEnable; //0x0298
		bool m_LightOcclusionCullEnable; //0x0299
		bool m_LightDepthCullEnable; //0x029A
		bool m_LightNormalCullEnable; //0x029B
		bool m_LightConeCullEnable; //0x029C
		bool m_LightTileOverlayEnable; //0x029D
		bool m_LightAttenuationThresholdEnable; //0x029E
		bool m_SkyVisibilityEnvmapScalingEnable; //0x029F
		bool m_ShadowOcclusionCullingEnable; //0x02A0
		bool m_FrustumSilhouetteCullingEnable; //0x02A1
		bool m_SubSurfaceScatteringEnable; //0x02A2
		bool m_OpaqueSortBySolutionEnable; //0x02A3
		bool m_MainOpaqueZPassEnable; //0x02A4
		bool m_PlanarReflectionEnable; //0x02A5
		bool m_PlanarReflectionFastHdrEnable; //0x02A6
		bool m_PlanarReflectionBlur; //0x02A7
		bool m_PlanarReflectionClippingEnable; //0x02A8
		bool m_DrawDebugPlanarReflection; //0x02A9
		bool m_DrawDebugPlanarReflectionCullFrustum; //0x02AA
		bool m_OverlayEnable; //0x02AB
		bool m_SmaaVelocityReprojectionEnable; //0x02AC
		bool m_SmaaUseStencil; //0x02AD
		bool m_SmaaPredicatedThresholdingEnable; //0x02AE
		bool m_ViewFxEnable; //0x02AF
		bool m_RenderScaleResampleEnable; //0x02B0
		bool m_LightCubeMapStencilEnable; //0x02B1
		bool m_DrawDebugIndirectCubeMapEnable; //0x02B2
		char _0x02B3[13];
	};//Size=0x02C0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01425
	// RuntimeId: 08876
	// TypeInfo:  0x00000001427E48B0
#ifndef _VisualEnvironmentSettings_
#define _VisualEnvironmentSettings_
#pragma pack(push, 8)
	class VisualEnvironmentSettings : public DataContainer
	{
	public:
		static __inline VisualEnvironmentSettings* DefaultInstance()
		{
			return (VisualEnvironmentSettings*)0x0000000046381C60;
		}
		static __inline unsigned int ClassId()
		{
			return 1425;
		}
		float m_SunRotationX; //0x0010
		float m_SunRotationY; //0x0014
		bool m_DrawStats; //0x0018
		bool m_DrawOnlyVisibleStats; //0x0019
		char _0x001A[6];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03193
	// RuntimeId: 08874
	// TypeInfo:  0x00000001427E4910
#ifndef _SunFlareEffectState_
#define _SunFlareEffectState_
#pragma pack(push, 16)
	class SunFlareEffectState : public DataContainer
	{
	public:
		static __inline SunFlareEffectState* DefaultInstance()
		{
			return (SunFlareEffectState*)0x00000000463B9D30;
		}
		static __inline unsigned int ClassId()
		{
			return 3193;
		}
		float m_OccluderSize; //0x0010
		char _0x0014[4];
		SurfaceShaderBaseAsset* m_Element1Shader; //0x0018
		Vec4 m_Element1SizeOccluderCurve; //0x0020
		Vec4 m_Element1SizeScreenPosCurve; //0x0030
		Vec4 m_Element1AlphaOccluderCurve; //0x0040
		Vec4 m_Element1AlphaScreenPosCurve; //0x0050
		Vec4 m_Element2SizeOccluderCurve; //0x0060
		Vec4 m_Element2SizeScreenPosCurve; //0x0070
		Vec4 m_Element2AlphaOccluderCurve; //0x0080
		Vec4 m_Element2AlphaScreenPosCurve; //0x0090
		Vec4 m_Element3SizeOccluderCurve; //0x00A0
		Vec4 m_Element3SizeScreenPosCurve; //0x00B0
		Vec4 m_Element3AlphaOccluderCurve; //0x00C0
		Vec4 m_Element3AlphaScreenPosCurve; //0x00D0
		Vec4 m_Element4SizeOccluderCurve; //0x00E0
		Vec4 m_Element4SizeScreenPosCurve; //0x00F0
		Vec4 m_Element4AlphaOccluderCurve; //0x0100
		Vec4 m_Element4AlphaScreenPosCurve; //0x0110
		Vec4 m_Element5SizeOccluderCurve; //0x0120
		Vec4 m_Element5SizeScreenPosCurve; //0x0130
		Vec4 m_Element5AlphaOccluderCurve; //0x0140
		Vec4 m_Element5AlphaScreenPosCurve; //0x0150
		float m_Element1RayDistance; //0x0160
		Vec2 m_Element1Size; //0x0164
		char _0x016C[4];
		SurfaceShaderBaseAsset* m_Element2Shader; //0x0170
		float m_Element2RayDistance; //0x0178
		Vec2 m_Element2Size; //0x017C
		char _0x0184[4];
		SurfaceShaderBaseAsset* m_Element3Shader; //0x0188
		float m_Element3RayDistance; //0x0190
		Vec2 m_Element3Size; //0x0194
		char _0x019C[4];
		SurfaceShaderBaseAsset* m_Element4Shader; //0x01A0
		float m_Element4RayDistance; //0x01A8
		Vec2 m_Element4Size; //0x01AC
		char _0x01B4[4];
		SurfaceShaderBaseAsset* m_Element5Shader; //0x01B8
		float m_Element5RayDistance; //0x01C0
		Vec2 m_Element5Size; //0x01C4
		bool m_Enable; //0x01CC
		bool m_DebugDrawOccluder; //0x01CD
		bool m_Element1Enable; //0x01CE
		bool m_Element2Enable; //0x01CF
		bool m_Element3Enable; //0x01D0
		bool m_Element4Enable; //0x01D1
		bool m_Element5Enable; //0x01D2
		char _0x01D3[13];
	};//Size=0x01E0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02088
	// RuntimeId: 08872
	// TypeInfo:  0x00000001427E4970
#ifndef _SkyEffectState_
#define _SkyEffectState_
#pragma pack(push, 16)
	class SkyEffectState : public DataContainer
	{
	public:
		static __inline SkyEffectState* DefaultInstance()
		{
			return (SkyEffectState*)0x00000000463901E0;
		}
		static __inline unsigned int ClassId()
		{
			return 2088;
		}
		float m_SunSize; //0x0010
		float m_SunScale; //0x0014
		char _0x0018[8];
		Vec3 m_CloudLayerSunColor; //0x0020
		SkyCloudLayer m_CloudLayer1; //0x0030
		SkyCloudLayer m_CloudLayer2; //0x0070
		float m_SkyGradientScale; //0x00B0
		char _0x00B4[4];
		TextureAsset* m_SkyGradientTexture; //0x00B8
		float m_PanoramicUVMinX; //0x00C0
		float m_PanoramicUVMaxX; //0x00C4
		float m_PanoramicUVMinY; //0x00C8
		float m_PanoramicUVMaxY; //0x00CC
		float m_PanoramicTileFactor; //0x00D0
		float m_PanoramicRotation; //0x00D4
		TextureAsset* m_PanoramicTexture; //0x00D8
		TextureAsset* m_PanoramicAlphaTexture; //0x00E0
		TextureAsset* m_CloudLayerMaskTexture; //0x00E8
		TextureAsset* m_StaticEnvmapTexture; //0x00F0
		float m_WindDirection; //0x00F8
		bool m_Enable; //0x00FC
		char _0x00FD[3];
	};//Size=0x0100
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03396
	// RuntimeId: 08868
	// TypeInfo:  0x00000001427E49D0
#ifndef _FogEffectState_
#define _FogEffectState_
#pragma pack(push, 16)
	class FogEffectState : public DataContainer
	{
	public:
		static __inline FogEffectState* DefaultInstance()
		{
			return (FogEffectState*)0x00000000463BE520;
		}
		static __inline unsigned int ClassId()
		{
			return 3396;
		}
		float m_Start; //0x0010
		float m_End; //0x0014
		char _0x0018[8];
		Vec4 m_Curve; //0x0020
		Vec3 m_FogColor; //0x0030
		Vec4 m_FogColorCurve; //0x0040
		Vec3 m_ForwardLightScatteringColor; //0x0050
		float m_FogColorStart; //0x0060
		float m_FogColorEnd; //0x0064
		float m_TransparencyFadeStart; //0x0068
		float m_TransparencyFadeEnd; //0x006C
		float m_TransparencyFadeClamp; //0x0070
		float m_ForwardLightScatteringPhaseG; //0x0074
		float m_ForwardLightScatteringStrength; //0x0078
		float m_ForwardLightScatteringPresence; //0x007C
		float m_ForwardLightScatteringMaxBlurLength; //0x0080
		float m_ForwardLightScatteringExtinction; //0x0084
		float m_ForwardLightScatteringSmoothness; //0x0088
		float m_HeightFogFollowCamera; //0x008C
		float m_HeightFogAltitude; //0x0090
		float m_HeightFogDepth; //0x0094
		float m_HeightFogVisibilityRange; //0x0098
		bool m_Enable; //0x009C
		bool m_ForwardLightScatteringEnabled; //0x009D
		bool m_HeightFogEnable; //0x009E
		char _0x009F[1];
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03584
	// RuntimeId: 08866
	// TypeInfo:  0x00000001427E4A30
#ifndef _OutdoorLightEffectState_
#define _OutdoorLightEffectState_
#pragma pack(push, 16)
	class OutdoorLightEffectState : public DataContainer
	{
	public:
		static __inline OutdoorLightEffectState* DefaultInstance()
		{
			return (OutdoorLightEffectState*)0x00000000463C2780;
		}
		static __inline unsigned int ClassId()
		{
			return 3584;
		}
		float m_SunRotationX; //0x0010
		float m_SunRotationY; //0x0014
		char _0x0018[8];
		Vec3 m_SunColor; //0x0020
		Vec3 m_SkyColor; //0x0030
		Vec3 m_GroundColor; //0x0040
		float m_SkyLightAngleFactor; //0x0050
		float m_SunShadowHeightScale; //0x0054
		TextureAsset* m_CloudShadowTexture; //0x0058
		Vec2 m_CloudShadowSpeed; //0x0060
		float m_CloudShadowSize; //0x0068
		float m_CloudShadowCoverage; //0x006C
		float m_CloudShadowExponent; //0x0070
		bool m_Enable; //0x0074
		bool m_CloudShadowEnable; //0x0075
		char _0x0076[10];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02997
	// RuntimeId: 04943
	// TypeInfo:  0x000000014278D650
#ifndef _VisualEnvironmentComponentData_
#define _VisualEnvironmentComponentData_
#pragma pack(push, 16)
	class VisualEnvironmentComponentData : public GameComponentData
	{
	public:
		static __inline VisualEnvironmentComponentData* DefaultInstance()
		{
			return (VisualEnvironmentComponentData*)0x00000000463B1D00;
		}
		static __inline unsigned int ClassId()
		{
			return 2997;
		}
		Array<char*> m_PropertyOverrides; //0x0070
		Array<unsigned __int32> m_PropertyOverrideMasks; //0x0078
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03006
	// RuntimeId: 08860
	// TypeInfo:  0x00000001427E4AF0
#ifndef _MotionBlurComponentData_
#define _MotionBlurComponentData_
#pragma pack(push, 16)
	class MotionBlurComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline MotionBlurComponentData* DefaultInstance()
		{
			return (MotionBlurComponentData*)0x00000000463B27B0;
		}
		static __inline unsigned int ClassId()
		{
			return 3006;
		}
		Realm m_Realm; //0x0080
		float m_MotionBlurScale; //0x0084
		float m_MotionBlurCutoffRadius; //0x0088
		float m_CutoffGradientScale; //0x008C
		Vec2 m_RadialBlurCenter; //0x0090
		float m_RadialBlurOffset; //0x0098
		float m_RadialBlurScale; //0x009C
		bool m_MotionBlurEnable; //0x00A0
		bool m_MotionBlurCentered; //0x00A1
		bool m_RadialBlurEnable; //0x00A2
		char _0x00A3[13];
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03001
	// RuntimeId: 08858
	// TypeInfo:  0x00000001427E4B50
#ifndef _CharacterLightingComponentData_
#define _CharacterLightingComponentData_
#pragma pack(push, 16)
	class CharacterLightingComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline CharacterLightingComponentData* DefaultInstance()
		{
			return (CharacterLightingComponentData*)0x00000000463B20A0;
		}
		static __inline unsigned int ClassId()
		{
			return 3001;
		}
		Vec3 m_TopLight; //0x0080
		Vec3 m_BottomLight; //0x0090
		Realm m_Realm; //0x00A0
		float m_CameraUpRotation; //0x00A4
		CharacterLightingMode m_CharacterLightingMode; //0x00A8
		float m_BlendFactor; //0x00AC
		float m_TopLightDirX; //0x00B0
		float m_TopLightDirY; //0x00B4
		float m_StartFadeDistance; //0x00B8
		float m_EndFadeDistance; //0x00BC
		bool m_CharacterLightEnable; //0x00C0
		bool m_FirstPersonEnable; //0x00C1
		bool m_LockToCameraDirection; //0x00C2
		char _0x00C3[13];
	};//Size=0x00D0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03011
	// RuntimeId: 08854
	// TypeInfo:  0x00000001427E4BB0
#ifndef _DamageEffectComponentData_
#define _DamageEffectComponentData_
#pragma pack(push, 16)
	class DamageEffectComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline DamageEffectComponentData* DefaultInstance()
		{
			return (DamageEffectComponentData*)0x00000000463B2C20;
		}
		static __inline unsigned int ClassId()
		{
			return 3011;
		}
		Vec4 m_TopDamage; //0x0080
		Vec4 m_LeftDamage; //0x0090
		Vec4 m_BottomDamage; //0x00A0
		Vec4 m_RightDamage; //0x00B0
		Realm m_Realm; //0x00C0
		char _0x00C4[4];
		SurfaceShaderBaseAsset* m_Shader; //0x00C8
		float m_FrameWidth; //0x00D0
		float m_OuterFrameOpacity; //0x00D4
		float m_InnerFrameOpacity; //0x00D8
		float m_FallofTime; //0x00DC
		float m_MinDamagePercentageThreshold; //0x00E0
		float m_MaxOpacityDamagePercentage; //0x00E4
		float m_StartCriticalEffectHealthThreshold; //0x00E8
		float m_EndCriticalEffectHealthThreshold; //0x00EC
		bool m_DebugDamage; //0x00F0
		char _0x00F1[15];
	};//Size=0x0100
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03020
	// RuntimeId: 08852
	// TypeInfo:  0x00000001427E4C10
#ifndef _ScreenEffectComponentData_
#define _ScreenEffectComponentData_
#pragma pack(push, 16)
	class ScreenEffectComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline ScreenEffectComponentData* DefaultInstance()
		{
			return (ScreenEffectComponentData*)0x00000000463B3480;
		}
		static __inline unsigned int ClassId()
		{
			return 3020;
		}
		Vec4 m_ScreenEffectParams; //0x0080
		Realm m_Realm; //0x0090
		ScreenEffectFrameType m_FrameType; //0x0094
		SurfaceShaderBaseAsset* m_Shader; //0x0098
		float m_FrameWidth; //0x00A0
		float m_OuterFrameOpacity; //0x00A4
		float m_InnerFrameOpacity; //0x00A8
		float m_Angle; //0x00AC
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03007
	// RuntimeId: 08848
	// TypeInfo:  0x00000001427E4C70
#ifndef _CameraParamsComponentData_
#define _CameraParamsComponentData_
#pragma pack(push, 16)
	class CameraParamsComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline CameraParamsComponentData* DefaultInstance()
		{
			return (CameraParamsComponentData*)0x00000000463B2880;
		}
		static __inline unsigned int ClassId()
		{
			return 3007;
		}
		Realm m_Realm; //0x0080
		float m_ViewDistance; //0x0084
		float m_NearPlane; //0x0088
		float m_SunShadowmapViewDistance; //0x008C
	};//Size=0x0090
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03010
	// RuntimeId: 08846
	// TypeInfo:  0x00000001427E4CD0
#ifndef _ShaderParamsComponentData_
#define _ShaderParamsComponentData_
#pragma pack(push, 16)
	class ShaderParamsComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline ShaderParamsComponentData* DefaultInstance()
		{
			return (ShaderParamsComponentData*)0x00000000463B2B40;
		}
		static __inline unsigned int ClassId()
		{
			return 3010;
		}
		Vec4 m_Value; //0x0080
		Realm m_Realm; //0x0090
		char _0x0094[4];
		char* m_ParameterName; //0x0098
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03008
	// RuntimeId: 08844
	// TypeInfo:  0x00000001427E4D30
#ifndef _EnlightenComponentData_
#define _EnlightenComponentData_
#pragma pack(push, 16)
	class EnlightenComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline EnlightenComponentData* DefaultInstance()
		{
			return (EnlightenComponentData*)0x00000000463B2930;
		}
		static __inline unsigned int ClassId()
		{
			return 3008;
		}
		Vec3 m_TerrainColor; //0x0080
		Vec3 m_SkyBoxSkyColor; //0x0090
		Vec3 m_SkyBoxGroundColor; //0x00A0
		Vec3 m_SkyBoxSunLightColor; //0x00B0
		Vec3 m_SkyBoxBackLightColor; //0x00C0
		Vec3 m_OpaqueAlphaTestSimpleScale; //0x00D0
		Realm m_Realm; //0x00E0
		float m_BounceScale; //0x00E4
		float m_SunScale; //0x00E8
		float m_CullDistance; //0x00EC
		float m_CullRadius; //0x00F0
		float m_SkyBoxSunLightColorSize; //0x00F4
		float m_SkyBoxBackLightColorSize; //0x00F8
		float m_SkyBoxBackLightRotationX; //0x00FC
		float m_SkyBoxBackLightRotationY; //0x0100
		bool m_SkyBoxEnable; //0x0104
		char _0x0105[11];
	};//Size=0x0110
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03021
	// RuntimeId: 08842
	// TypeInfo:  0x00000001427E4D90
#ifndef _SubSurfaceScatteringComponentData_
#define _SubSurfaceScatteringComponentData_
#pragma pack(push, 16)
	class SubSurfaceScatteringComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline SubSurfaceScatteringComponentData* DefaultInstance()
		{
			return (SubSurfaceScatteringComponentData*)0x00000000463B3550;
		}
		static __inline unsigned int ClassId()
		{
			return 3021;
		}
		Vec3 m_SimpleSssColor; //0x0080
		Vec3 m_AdvancedSssMat0Width; //0x0090
		Vec3 m_AdvancedSssMat1Width; //0x00A0
		Vec3 m_AdvancedSssMat2Width; //0x00B0
		Vec3 m_AdvancedSssMat3Width; //0x00C0
		Vec3 m_AdvancedSssMat4Width; //0x00D0
		Realm m_Realm; //0x00E0
		float m_SimpleSssRolloffKeyLight; //0x00E4
		float m_SimpleSssRolloffLocalLight; //0x00E8
		bool m_AdvancedSssEnable; //0x00EC
		char _0x00ED[3];
	};//Size=0x00F0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03015
	// RuntimeId: 08840
	// TypeInfo:  0x00000001427E4DF0
#ifndef _DynamicAOComponentData_
#define _DynamicAOComponentData_
#pragma pack(push, 16)
	class DynamicAOComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline DynamicAOComponentData* DefaultInstance()
		{
			return (DynamicAOComponentData*)0x00000000463B3070;
		}
		static __inline unsigned int ClassId()
		{
			return 3015;
		}
		Realm m_Realm; //0x0080
		float m_SsaoFade; //0x0084
		float m_SsaoRadius; //0x0088
		float m_SsaoMaxDistanceInner; //0x008C
		float m_SsaoMaxDistanceOuter; //0x0090
		float m_HbaoRadius; //0x0094
		float m_HbaoAngleBias; //0x0098
		float m_HbaoAttenuation; //0x009C
		float m_HbaoContrast; //0x00A0
		float m_HbaoMaxFootprintRadius; //0x00A4
		float m_HbaoPowerExponent; //0x00A8
		bool m_Enable; //0x00AC
		char _0x00AD[3];
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03004
	// RuntimeId: 08838
	// TypeInfo:  0x00000001427E4E50
#ifndef _SunFlareComponentData_
#define _SunFlareComponentData_
#pragma pack(push, 16)
	class SunFlareComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline SunFlareComponentData* DefaultInstance()
		{
			return (SunFlareComponentData*)0x00000000463B23E0;
		}
		static __inline unsigned int ClassId()
		{
			return 3004;
		}
		Vec4 m_Element1SizeOccluderCurve; //0x0080
		Vec4 m_Element1SizeScreenPosCurve; //0x0090
		Vec4 m_Element1AlphaOccluderCurve; //0x00A0
		Vec4 m_Element1AlphaScreenPosCurve; //0x00B0
		Vec4 m_Element1RotationDistCurve; //0x00C0
		Vec4 m_Element2SizeOccluderCurve; //0x00D0
		Vec4 m_Element2SizeScreenPosCurve; //0x00E0
		Vec4 m_Element2AlphaOccluderCurve; //0x00F0
		Vec4 m_Element2AlphaScreenPosCurve; //0x0100
		Vec4 m_Element2RotationDistCurve; //0x0110
		Vec4 m_Element3SizeOccluderCurve; //0x0120
		Vec4 m_Element3SizeScreenPosCurve; //0x0130
		Vec4 m_Element3AlphaOccluderCurve; //0x0140
		Vec4 m_Element3AlphaScreenPosCurve; //0x0150
		Vec4 m_Element3RotationDistCurve; //0x0160
		Vec4 m_Element4SizeOccluderCurve; //0x0170
		Vec4 m_Element4SizeScreenPosCurve; //0x0180
		Vec4 m_Element4AlphaOccluderCurve; //0x0190
		Vec4 m_Element4AlphaScreenPosCurve; //0x01A0
		Vec4 m_Element4RotationDistCurve; //0x01B0
		Vec4 m_Element5SizeOccluderCurve; //0x01C0
		Vec4 m_Element5SizeScreenPosCurve; //0x01D0
		Vec4 m_Element5AlphaOccluderCurve; //0x01E0
		Vec4 m_Element5AlphaScreenPosCurve; //0x01F0
		Vec4 m_Element5RotationDistCurve; //0x0200
		Realm m_Realm; //0x0210
		float m_OccluderSize; //0x0214
		SurfaceShaderBaseAsset* m_Element1Shader; //0x0218
		float m_Element1RayDistance; //0x0220
		Vec2 m_Element1Size; //0x0224
		float m_Element1RotationLocal; //0x022C
		float m_Element1RotationDistMultiplier; //0x0230
		char _0x0234[4];
		SurfaceShaderBaseAsset* m_Element2Shader; //0x0238
		float m_Element2RayDistance; //0x0240
		Vec2 m_Element2Size; //0x0244
		float m_Element2RotationLocal; //0x024C
		float m_Element2RotationDistMultiplier; //0x0250
		char _0x0254[4];
		SurfaceShaderBaseAsset* m_Element3Shader; //0x0258
		float m_Element3RayDistance; //0x0260
		Vec2 m_Element3Size; //0x0264
		float m_Element3RotationLocal; //0x026C
		float m_Element3RotationDistMultiplier; //0x0270
		char _0x0274[4];
		SurfaceShaderBaseAsset* m_Element4Shader; //0x0278
		float m_Element4RayDistance; //0x0280
		Vec2 m_Element4Size; //0x0284
		float m_Element4RotationLocal; //0x028C
		float m_Element4RotationDistMultiplier; //0x0290
		char _0x0294[4];
		SurfaceShaderBaseAsset* m_Element5Shader; //0x0298
		float m_Element5RayDistance; //0x02A0
		Vec2 m_Element5Size; //0x02A4
		float m_Element5RotationLocal; //0x02AC
		float m_Element5RotationDistMultiplier; //0x02B0
		bool m_Enable; //0x02B4
		bool m_DebugDrawOccluder; //0x02B5
		bool m_Element1Enable; //0x02B6
		bool m_Element1RotationAlignedToRay; //0x02B7
		bool m_Element2Enable; //0x02B8
		bool m_Element2RotationAlignedToRay; //0x02B9
		bool m_Element3Enable; //0x02BA
		bool m_Element3RotationAlignedToRay; //0x02BB
		bool m_Element4Enable; //0x02BC
		bool m_Element4RotationAlignedToRay; //0x02BD
		bool m_Element5Enable; //0x02BE
		bool m_Element5RotationAlignedToRay; //0x02BF
	};//Size=0x02C0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03019
	// RuntimeId: 08836
	// TypeInfo:  0x00000001427E4EB0
#ifndef _WindComponentData_
#define _WindComponentData_
#pragma pack(push, 16)
	class WindComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline WindComponentData* DefaultInstance()
		{
			return (WindComponentData*)0x00000000463B33C0;
		}
		static __inline unsigned int ClassId()
		{
			return 3019;
		}
		Realm m_Realm; //0x0080
		float m_WindDirection; //0x0084
		float m_WindStrength; //0x0088
		float m_WindVariationMultiplier; //0x008C
		float m_WindVariationRateMultiplier; //0x0090
		float m_WindMicroVariationMultiplier; //0x0094
		float m_TurbulenceMultiplier; //0x0098
		float m_TurbulenceScale; //0x009C
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03012
	// RuntimeId: 08834
	// TypeInfo:  0x00000001427E4F10
#ifndef _DynamicEnvmapComponentData_
#define _DynamicEnvmapComponentData_
#pragma pack(push, 16)
	class DynamicEnvmapComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline DynamicEnvmapComponentData* DefaultInstance()
		{
			return (DynamicEnvmapComponentData*)0x00000000463B2D40;
		}
		static __inline unsigned int ClassId()
		{
			return 3012;
		}
		Vec3 m_KeyColorEnvmap; //0x0080
		Vec3 m_SkyColorEnvmap; //0x0090
		Vec3 m_GroundColorEnvmap; //0x00A0
		Realm m_Realm; //0x00B0
		bool m_Enable; //0x00B4
		bool m_TerrainReflectionsEnable; //0x00B5
		char _0x00B6[10];
	};//Size=0x00C0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03005
	// RuntimeId: 08832
	// TypeInfo:  0x00000001427E4F70
#ifndef _PlanarReflectionComponentData_
#define _PlanarReflectionComponentData_
#pragma pack(push, 16)
	class PlanarReflectionComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline PlanarReflectionComponentData* DefaultInstance()
		{
			return (PlanarReflectionComponentData*)0x00000000463B26C0;
		}
		static __inline unsigned int ClassId()
		{
			return 3005;
		}
		Vec3 m_KeyColorReflection; //0x0080
		Vec3 m_SkyColorReflection; //0x0090
		Vec3 m_GroundColorReflection; //0x00A0
		Realm m_Realm; //0x00B0
		float m_GroundHeight; //0x00B4
		float m_ViewDistance; //0x00B8
		BlurFilter m_VerticalBlurFilter; //0x00BC
		float m_VerticalDeviation; //0x00C0
		BlurFilter m_HorizontalBlurFilter; //0x00C4
		float m_HorizontalDeviation; //0x00C8
		bool m_Enable; //0x00CC
		bool m_TerrainReflectionsEnable; //0x00CD
		bool m_SkyRenderEnable; //0x00CE
		bool m_OverideOutdoorLightColors; //0x00CF
	};//Size=0x00D0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03014
	// RuntimeId: 08830
	// TypeInfo:  0x00000001427E4FD0
#ifndef _SkyComponentData_
#define _SkyComponentData_
#pragma pack(push, 16)
	class SkyComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline SkyComponentData* DefaultInstance()
		{
			return (SkyComponentData*)0x00000000463B2EE0;
		}
		static __inline unsigned int ClassId()
		{
			return 3014;
		}
		Vec3 m_CloudLayerSunColor; //0x0080
		Vec3 m_CloudLayer1Color; //0x0090
		Vec3 m_CloudLayer2Color; //0x00A0
		Realm m_Realm; //0x00B0
		float m_BrightnessScale; //0x00B4
		TextureAsset* m_SkyGradientTexture; //0x00B8
		float m_SunSize; //0x00C0
		float m_SunScale; //0x00C4
		float m_PanoramicUVMinX; //0x00C8
		float m_PanoramicUVMaxX; //0x00CC
		float m_PanoramicUVMinY; //0x00D0
		float m_PanoramicUVMaxY; //0x00D4
		float m_PanoramicTileFactor; //0x00D8
		float m_PanoramicRotation; //0x00DC
		TextureAsset* m_PanoramicTexture; //0x00E0
		TextureAsset* m_PanoramicAlphaTexture; //0x00E8
		TextureAsset* m_CloudLayerMaskTexture; //0x00F0
		float m_CloudLayer1Altitude; //0x00F8
		float m_CloudLayer1TileFactor; //0x00FC
		float m_CloudLayer1Rotation; //0x0100
		float m_CloudLayer1Speed; //0x0104
		float m_CloudLayer1SunLightIntensity; //0x0108
		float m_CloudLayer1SunLightPower; //0x010C
		float m_CloudLayer1AmbientLightIntensity; //0x0110
		float m_CloudLayer1AlphaMul; //0x0114
		TextureAsset* m_CloudLayer1Texture; //0x0118
		float m_CloudLayer2Altitude; //0x0120
		float m_CloudLayer2TileFactor; //0x0124
		float m_CloudLayer2Rotation; //0x0128
		float m_CloudLayer2Speed; //0x012C
		float m_CloudLayer2SunLightIntensity; //0x0130
		float m_CloudLayer2SunLightPower; //0x0134
		float m_CloudLayer2AmbientLightIntensity; //0x0138
		float m_CloudLayer2AlphaMul; //0x013C
		TextureAsset* m_CloudLayer2Texture; //0x0140
		TextureAsset* m_StaticEnvmapTexture; //0x0148
		float m_StaticEnvmapScale; //0x0150
		float m_SkyEnvmap8BitTexScale; //0x0154
		TextureAsset* m_CustomEnvmapTexture; //0x0158
		float m_CustomEnvmapScale; //0x0160
		float m_CustomEnvmapAmbient; //0x0164
		float m_SkyVisibilityExponent; //0x0168
		bool m_Enable; //0x016C
		bool m_IndirectCubeMapOverride; //0x016D
		char _0x016E[2];
	};//Size=0x0170
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03003
	// RuntimeId: 08828
	// TypeInfo:  0x00000001427E5030
#ifndef _FogComponentData_
#define _FogComponentData_
#pragma pack(push, 16)
	class FogComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline FogComponentData* DefaultInstance()
		{
			return (FogComponentData*)0x00000000463B2290;
		}
		static __inline unsigned int ClassId()
		{
			return 3003;
		}
		Vec4 m_Curve; //0x0080
		Vec3 m_FogColor; //0x0090
		Vec4 m_FogColorCurve; //0x00A0
		Vec4 m_TransparencyFadeCurve; //0x00B0
		Vec3 m_ForwardLightScatteringColor; //0x00C0
		Realm m_Realm; //0x00D0
		float m_FogDistanceMultiplier; //0x00D4
		float m_Start; //0x00D8
		float m_End; //0x00DC
		float m_FogColorStart; //0x00E0
		float m_FogColorEnd; //0x00E4
		float m_TransparencyFadeStart; //0x00E8
		float m_TransparencyFadeEnd; //0x00EC
		float m_TransparencyFadeClamp; //0x00F0
		float m_ForwardLightScatteringPhaseG; //0x00F4
		float m_ForwardLightScatteringStrength; //0x00F8
		float m_ForwardLightScatteringPresence; //0x00FC
		float m_ForwardLightScatteringMaxBlurLength; //0x0100
		float m_ForwardLightScatteringExtinction; //0x0104
		float m_ForwardLightScatteringSmoothness; //0x0108
		float m_HeightFogFollowCamera; //0x010C
		float m_HeightFogAltitude; //0x0110
		float m_HeightFogDepth; //0x0114
		float m_HeightFogVisibilityRange; //0x0118
		bool m_Enable; //0x011C
		bool m_FogGradientEnable; //0x011D
		bool m_FogColorEnable; //0x011E
		bool m_ForwardLightScatteringEnabled; //0x011F
		bool m_HeightFogEnable; //0x0120
		char _0x0121[15];
	};//Size=0x0130
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03000
	// RuntimeId: 08826
	// TypeInfo:  0x00000001427E5090
#ifndef _OutdoorLightComponentData_
#define _OutdoorLightComponentData_
#pragma pack(push, 16)
	class OutdoorLightComponentData : public VisualEnvironmentComponentData
	{
	public:
		static __inline OutdoorLightComponentData* DefaultInstance()
		{
			return (OutdoorLightComponentData*)0x00000000463B1F60;
		}
		static __inline unsigned int ClassId()
		{
			return 3000;
		}
		Vec3 m_SunColor; //0x0080
		Vec3 m_SkyColor; //0x0090
		Vec3 m_GroundColor; //0x00A0
		Realm m_Realm; //0x00B0
		float m_SunRotationX; //0x00B4
		float m_SunRotationY; //0x00B8
		float m_ShadowSunRotationX; //0x00BC
		float m_ShadowSunRotationY; //0x00C0
		float m_SkyLightAngleFactor; //0x00C4
		float m_SunSpecularScale; //0x00C8
		float m_SkyEnvmapShadowScale; //0x00CC
		float m_SunShadowHeightScale; //0x00D0
		char _0x00D4[4];
		TextureAsset* m_CloudShadowTexture; //0x00D8
		Vec2 m_CloudShadowSpeed; //0x00E0
		float m_CloudShadowSize; //0x00E8
		float m_CloudShadowCoverage; //0x00EC
		float m_CloudShadowExponent; //0x00F0
		float m_CloudShadowStartFade; //0x00F4
		float m_CloudShadowsFadeDistance; //0x00F8
		Vec2 m_CloudXZTranslation; //0x00FC
		TextureAddress m_CloudShadowAddressingMode; //0x0104
		float m_TranslucencyAmbient; //0x0108
		float m_TranslucencyScale; //0x010C
		float m_TranslucencyPower; //0x0110
		float m_TranslucencyDistortion; //0x0114
		bool m_Enable; //0x0118
		bool m_ShadowSunRotationEnable; //0x0119
		bool m_CloudShadowEnable; //0x011A
		bool m_CloudShadowIsTopDown; //0x011B
		char _0x011C[4];
	};//Size=0x0120
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02826
	// RuntimeId: 04827
	// TypeInfo:  0x000000014278E5B0
#ifndef _TimelineTrackData_
#define _TimelineTrackData_
#pragma pack(push, 8)
	class TimelineTrackData : public GameObjectData
	{
	public:
		static __inline TimelineTrackData* DefaultInstance()
		{
			return (TimelineTrackData*)0x00000000463AA7A0;
		}
		static __inline unsigned int ClassId()
		{
			return 2826;
		}
		Array<TimelineTrackDataConditionsBase*> m_Conditions; //0x0018
		bool m_ExposePins; //0x0020
		bool m_IsDisabled; //0x0021
		bool m_DependsOnAnimation; //0x0022
		char _0x0023[5];
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03278
	// RuntimeId: 08822
	// TypeInfo:  0x00000001427E5150
#ifndef _RenderFramesKeyframe_
#define _RenderFramesKeyframe_
#pragma pack(push, 8)
	class RenderFramesKeyframe : public DataContainer
	{
	public:
		static __inline RenderFramesKeyframe* DefaultInstance()
		{
			return (RenderFramesKeyframe*)0x00000000463BBB00;
		}
		static __inline unsigned int ClassId()
		{
			return 3278;
		}
		float m_Time; //0x0010
		float m_Length; //0x0014
		char* m_RenderFileName; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03334
	// RuntimeId: 08820
	// TypeInfo:  0x00000001427E51B0
#ifndef _OcclusionSettings_
#define _OcclusionSettings_
#pragma pack(push, 8)
	class OcclusionSettings : public DataContainer
	{
	public:
		static __inline OcclusionSettings* DefaultInstance()
		{
			return (OcclusionSettings*)0x00000000463BCEF0;
		}
		static __inline unsigned int ClassId()
		{
			return 3334;
		}
		bool m_Enable; //0x0010
		bool m_CoverageEnable; //0x0011
		bool m_DrawShadowZbuffer; //0x0012
		bool m_DrawZbuffer; //0x0013
		bool m_DrawSplitView; //0x0014
		bool m_DrawBinaryBuffer; //0x0015
		bool m_DrawCoverageBuffer; //0x0016
		char _0x0017[1];
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02480
	// RuntimeId: 08818
	// TypeInfo:  0x00000001427E5210
#ifndef _MeshProxyEntityData_
#define _MeshProxyEntityData_
#pragma pack(push, 16)
	class MeshProxyEntityData : public SpatialEntityData
	{
	public:
		static __inline MeshProxyEntityData* DefaultInstance()
		{
			return (MeshProxyEntityData*)0x000000004639E090;
		}
		static __inline unsigned int ClassId()
		{
			return 2480;
		}
		MeshAsset* m_Mesh; //0x0060
		Array<LinearTransform> m_BasePoseTransforms; //0x0068
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02355
	// RuntimeId: 08816
	// TypeInfo:  0x00000001427E5270
#ifndef _OccluderMeshEntityData_
#define _OccluderMeshEntityData_
#pragma pack(push, 16)
	class OccluderMeshEntityData : public SpatialEntityData
	{
	public:
		static __inline OccluderMeshEntityData* DefaultInstance()
		{
			return (OccluderMeshEntityData*)0x0000000046396E10;
		}
		static __inline unsigned int ClassId()
		{
			return 2355;
		}
		RigidMeshAsset* m_Mesh; //0x0060
		char _0x0068[8];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02435
	// RuntimeId: 08814
	// TypeInfo:  0x00000001427E52D0
#ifndef _IndirectCubeMapData_
#define _IndirectCubeMapData_
#pragma pack(push, 16)
	class IndirectCubeMapData : public SpatialEntityData
	{
	public:
		static __inline IndirectCubeMapData* DefaultInstance()
		{
			return (IndirectCubeMapData*)0x000000004639C030;
		}
		static __inline unsigned int ClassId()
		{
			return 2435;
		}
		unsigned __int32 m_Resolution; //0x0060
		float m_Scale; //0x0064
		float m_FadeDistance; //0x0068
		bool m_Enable; //0x006C
		char _0x006D[3];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02432
	// RuntimeId: 08812
	// TypeInfo:  0x00000001427E5330
#ifndef _LightProbeVolumeData_
#define _LightProbeVolumeData_
#pragma pack(push, 16)
	class LightProbeVolumeData : public SpatialEntityData
	{
	public:
		static __inline LightProbeVolumeData* DefaultInstance()
		{
			return (LightProbeVolumeData*)0x000000004639BE60;
		}
		static __inline unsigned int ClassId()
		{
			return 2432;
		}
		unsigned __int32 m_Xres; //0x0060
		unsigned __int32 m_Yres; //0x0064
		unsigned __int32 m_Zres; //0x0068
		float m_BlendDistance; //0x006C
		__int32 m_Priority; //0x0070
		char _0x0074[12];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02444
	// RuntimeId: 08806
	// TypeInfo:  0x00000001427E5450
#ifndef _LocalLightEntityData_
#define _LocalLightEntityData_
#pragma pack(push, 16)
	class LocalLightEntityData : public SpatialEntityData
	{
	public:
		static __inline LocalLightEntityData* DefaultInstance()
		{
			return (LocalLightEntityData*)0x000000004639C540;
		}
		static __inline unsigned int ClassId()
		{
			return 2444;
		}
		Vec3 m_Color; //0x0060
		Vec3 m_EnlightenColorScale; //0x0070
		Vec3 m_ParticleColorScale; //0x0080
		float m_Radius; //0x0090
		float m_Intensity; //0x0094
		float m_AttenuationOffset; //0x0098
		EnlightenColorMode m_EnlightenColorMode; //0x009C
		bool m_Visible; //0x00A0
		bool m_DirectLightEnable; //0x00A1
		bool m_SpecularEnable; //0x00A2
		bool m_EnlightenEnable; //0x00A3
		char _0x00A4[12];
	};//Size=0x00B0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02445
	// RuntimeId: 08808
	// TypeInfo:  0x00000001427E53F0
#ifndef _PointLightEntityData_
#define _PointLightEntityData_
#pragma pack(push, 16)
	class PointLightEntityData : public LocalLightEntityData
	{
	public:
		static __inline PointLightEntityData* DefaultInstance()
		{
			return (PointLightEntityData*)0x000000004639C610;
		}
		static __inline unsigned int ClassId()
		{
			return 2445;
		}
		float m_Width; //0x00B0
		float m_TranslucencyAmbient; //0x00B4
		float m_TranslucencyScale; //0x00B8
		float m_TranslucencyPower; //0x00BC
		float m_TranslucencyDistortion; //0x00C0
		char _0x00C4[12];
	};//Size=0x00D0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02446
	// RuntimeId: 08810
	// TypeInfo:  0x00000001427E5390
#ifndef _SpotLightEntityData_
#define _SpotLightEntityData_
#pragma pack(push, 16)
	class SpotLightEntityData : public LocalLightEntityData
	{
	public:
		static __inline SpotLightEntityData* DefaultInstance()
		{
			return (SpotLightEntityData*)0x000000004639C700;
		}
		static __inline unsigned int ClassId()
		{
			return 2446;
		}
		SpotLightShape m_Shape; //0x00B0
		float m_ConeInnerAngle; //0x00B4
		float m_ConeOuterAngle; //0x00B8
		float m_FrustumFov; //0x00BC
		float m_FrustumAspect; //0x00C0
		float m_OrthoWidth; //0x00C4
		float m_OrthoHeight; //0x00C8
		float m_NearPlane; //0x00CC
		TextureAsset* m_Texture; //0x00D0
		QualityScalableEnabled m_CastShadows; //0x00D8
		float m_ShadowRadius; //0x00DC
		float m_ShadowCullDistance; //0x00E0
		QualityScalableEnabled m_FrustumAsCone; //0x00E4
		float m_FrustumAsConeIntensityScale; //0x00E8
		QualityLevel m_CastShadowsMinLevel; //0x00EC
		bool m_FrustumAsConeAngle; //0x00F0
		bool m_CastShadowsEnable; //0x00F1
		char _0x00F2[14];
	};//Size=0x0100
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02466
	// RuntimeId: 08802
	// TypeInfo:  0x00000001427E54B0
#ifndef _LensFlareEntityData_
#define _LensFlareEntityData_
#pragma pack(push, 16)
	class LensFlareEntityData : public SpatialEntityData
	{
	public:
		static __inline LensFlareEntityData* DefaultInstance()
		{
			return (LensFlareEntityData*)0x000000004639D4E0;
		}
		static __inline unsigned int ClassId()
		{
			return 2466;
		}
		float m_OccluderSize; //0x0060
		float m_DepthBias; //0x0064
		Array<LensFlareElement> m_Elements; //0x0068
		bool m_Visible; //0x0070
		bool m_DebugDrawOccluder; //0x0071
		bool m_HalfRes; //0x0072
		char _0x0073[13];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02441
	// RuntimeId: 08798
	// TypeInfo:  0x00000001427E5510
#ifndef _GroundHeightEntityData_
#define _GroundHeightEntityData_
#pragma pack(push, 16)
	class GroundHeightEntityData : public SpatialEntityData
	{
	public:
		static __inline GroundHeightEntityData* DefaultInstance()
		{
			return (GroundHeightEntityData*)0x000000004639C390;
		}
		static __inline unsigned int ClassId()
		{
			return 2441;
		}
		GroundHeightData m_Data; //0x0060
		char _0x0078[8];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02438
	// RuntimeId: 08794
	// TypeInfo:  0x00000001427E5570
#ifndef _PlanarReflectionLocatorEntityData_
#define _PlanarReflectionLocatorEntityData_
#pragma pack(push, 16)
	class PlanarReflectionLocatorEntityData : public SpatialEntityData
	{
	public:
		static __inline PlanarReflectionLocatorEntityData* DefaultInstance()
		{
			return (PlanarReflectionLocatorEntityData*)0x000000004639C1D0;
		}
		static __inline unsigned int ClassId()
		{
			return 2438;
		}
		bool m_Enable; //0x0060
		char _0x0061[15];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02433
	// RuntimeId: 08792
	// TypeInfo:  0x00000001427E55D0
#ifndef _DynamicEnvmapEntityData_
#define _DynamicEnvmapEntityData_
#pragma pack(push, 16)
	class DynamicEnvmapEntityData : public SpatialEntityData
	{
	public:
		static __inline DynamicEnvmapEntityData* DefaultInstance()
		{
			return (DynamicEnvmapEntityData*)0x000000004639BF00;
		}
		static __inline unsigned int ClassId()
		{
			return 2433;
		}
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02447
	// RuntimeId: 08790
	// TypeInfo:  0x00000001427E5630
#ifndef _RadiosityModifierEntityData_
#define _RadiosityModifierEntityData_
#pragma pack(push, 16)
	class RadiosityModifierEntityData : public SpatialEntityData
	{
	public:
		static __inline RadiosityModifierEntityData* DefaultInstance()
		{
			return (RadiosityModifierEntityData*)0x000000004639C820;
		}
		static __inline unsigned int ClassId()
		{
			return 2447;
		}
		float m_BounceScale; //0x0060
		float m_SunScale; //0x0064
		char _0x0068[8];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02185
	// RuntimeId: 08788
	// TypeInfo:  0x00000001427E5690
#ifndef _RadiosityMaterialEntityData_
#define _RadiosityMaterialEntityData_
#pragma pack(push, 16)
	class RadiosityMaterialEntityData : public EntityData
	{
	public:
		static __inline RadiosityMaterialEntityData* DefaultInstance()
		{
			return (RadiosityMaterialEntityData*)0x0000000046392CB0;
		}
		static __inline unsigned int ClassId()
		{
			return 2185;
		}
		ObjectBlueprint* m_Blueprint; //0x0018
		Vec3 m_Color; //0x0020
		unsigned __int64 m_MaterialId; //0x0030
		bool m_Emissive; //0x0038
		char _0x0039[7];
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02799
	// RuntimeId: 08782
	// TypeInfo:  0x00000001427E57B0
#ifndef _EnlightenEntityData_
#define _EnlightenEntityData_
#pragma pack(push, 8)
	class EnlightenEntityData : public EntityData
	{
	public:
		static __inline EnlightenEntityData* DefaultInstance()
		{
			return (EnlightenEntityData*)0x00000000463A9E90;
		}
		static __inline unsigned int ClassId()
		{
			return 2799;
		}
		__int32 m_Priority; //0x0018
		Realm m_Realm; //0x001C
		bool m_Enable; //0x0020
		char _0x0021[7];
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02800
	// RuntimeId: 08784
	// TypeInfo:  0x00000001427E5750
#ifndef _DynamicEnlightenEntityData_
#define _DynamicEnlightenEntityData_
#pragma pack(push, 8)
	class DynamicEnlightenEntityData : public EnlightenEntityData
	{
	public:
		static __inline DynamicEnlightenEntityData* DefaultInstance()
		{
			return (DynamicEnlightenEntityData*)0x00000000463A9ED0;
		}
		static __inline unsigned int ClassId()
		{
			return 2800;
		}
		EnlightenDataAsset* m_EnlightenData; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02801
	// RuntimeId: 08786
	// TypeInfo:  0x00000001427E56F0
#ifndef _StaticEnlightenEntityData_
#define _StaticEnlightenEntityData_
#pragma pack(push, 8)
	class StaticEnlightenEntityData : public EnlightenEntityData
	{
	public:
		static __inline StaticEnlightenEntityData* DefaultInstance()
		{
			return (StaticEnlightenEntityData*)0x00000000463A9F20;
		}
		static __inline unsigned int ClassId()
		{
			return 2801;
		}
		StaticEnlightenData* m_EnlightenData; //0x0028
		EnlightenDataAsset* m_DynamicEnlightenData; //0x0030
		ObjectBlueprint* m_VisualEnvironment; //0x0038
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02213
	// RuntimeId: 08780
	// TypeInfo:  0x00000001427E5810
#ifndef _RadiosityEntityData_
#define _RadiosityEntityData_
#pragma pack(push, 8)
	class RadiosityEntityData : public EntityData
	{
	public:
		static __inline RadiosityEntityData* DefaultInstance()
		{
			return (RadiosityEntityData*)0x0000000046393700;
		}
		static __inline unsigned int ClassId()
		{
			return 2213;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02410
	// RuntimeId: 08774
	// TypeInfo:  0x00000001427E5930
#ifndef _RenderVolumeEntityData_
#define _RenderVolumeEntityData_
#pragma pack(push, 16)
	class RenderVolumeEntityData : public SpatialEntityData
	{
	public:
		static __inline RenderVolumeEntityData* DefaultInstance()
		{
			return (RenderVolumeEntityData*)0x000000004639ADA0;
		}
		static __inline unsigned int ClassId()
		{
			return 2410;
		}
		Vec4 m_UserMasks; //0x0060
		SurfaceShaderInstanceDataStruct m_Shader; //0x0070
		RenderVolumeTransformType m_TransformType; //0x0098
		bool m_Enabled; //0x009C
		char _0x009D[3];
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02411
	// RuntimeId: 08776
	// TypeInfo:  0x00000001427E58D0
#ifndef _DecalVolumeEntityData_
#define _DecalVolumeEntityData_
#pragma pack(push, 16)
	class DecalVolumeEntityData : public RenderVolumeEntityData
	{
	public:
		static __inline DecalVolumeEntityData* DefaultInstance()
		{
			return (DecalVolumeEntityData*)0x000000004639AE60;
		}
		static __inline unsigned int ClassId()
		{
			return 2411;
		}
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02412
	// RuntimeId: 08778
	// TypeInfo:  0x00000001427E5870
#ifndef _MaskVolumeEntityData_
#define _MaskVolumeEntityData_
#pragma pack(push, 16)
	class MaskVolumeEntityData : public RenderVolumeEntityData
	{
	public:
		static __inline MaskVolumeEntityData* DefaultInstance()
		{
			return (MaskVolumeEntityData*)0x000000004639AF20;
		}
		static __inline unsigned int ClassId()
		{
			return 2412;
		}
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02357
	// RuntimeId: 08770
	// TypeInfo:  0x00000001427E5990
#ifndef _OccluderVolumeEntityData_
#define _OccluderVolumeEntityData_
#pragma pack(push, 16)
	class OccluderVolumeEntityData : public SpatialEntityData
	{
	public:
		static __inline OccluderVolumeEntityData* DefaultInstance()
		{
			return (OccluderVolumeEntityData*)0x0000000046396F60;
		}
		static __inline unsigned int ClassId()
		{
			return 2357;
		}
		float m_CoverageValue; //0x0060
		bool m_OccluderHighPriority; //0x0064
		bool m_OccluderIsConservative; //0x0065
		bool m_Visible; //0x0066
		char _0x0067[9];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02350
	// RuntimeId: 05151
	// TypeInfo:  0x0000000142790650
#ifndef _LocalWindForceEntityBaseData_
#define _LocalWindForceEntityBaseData_
#pragma pack(push, 16)
	class LocalWindForceEntityBaseData : public SpatialEntityData
	{
	public:
		static __inline LocalWindForceEntityBaseData* DefaultInstance()
		{
			return (LocalWindForceEntityBaseData*)0x0000000046396A90;
		}
		static __inline unsigned int ClassId()
		{
			return 2350;
		}
		float m_Strength; //0x0060
		float m_Variation; //0x0064
		float m_VariationRate; //0x0068
		float m_MicroVariation; //0x006C
		float m_Hardness; //0x0070
		float m_ForceAsInstantVelocity; //0x0074
		char _0x0078[8];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03636
	// RuntimeId: 08766
	// TypeInfo:  0x00000001427E5A50
#ifndef _EnlightenState_
#define _EnlightenState_
#pragma pack(push, 16)
	class EnlightenState : public DataContainer
	{
	public:
		static __inline EnlightenState* DefaultInstance()
		{
			return (EnlightenState*)0x00000000463C3590;
		}
		static __inline unsigned int ClassId()
		{
			return 3636;
		}
		float m_BounceScale; //0x0010
		float m_SunScale; //0x0014
		char _0x0018[8];
		Vec3 m_SkyBoxSkyColor; //0x0020
		Vec3 m_SkyBoxGroundColor; //0x0030
		Vec3 m_SkyBoxSunLightColor; //0x0040
		Vec3 m_SkyBoxBackLightColor; //0x0050
		float m_OutputScale; //0x0060
		float m_SkyBoxSunLightColorSize; //0x0064
		float m_SkyBoxBackLightColorSize; //0x0068
		float m_SkyBoxBackLightRotationX; //0x006C
		float m_SkyBoxBackLightRotationY; //0x0070
		bool m_SkyBoxEnable; //0x0074
		char _0x0075[11];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01513
	// RuntimeId: 08764
	// TypeInfo:  0x00000001427E5AB0
#ifndef _EnlightenRuntimeConfig_
#define _EnlightenRuntimeConfig_
#pragma pack(push, 8)
	class EnlightenRuntimeConfig : public Asset
	{
	public:
		static __inline EnlightenRuntimeConfig* DefaultInstance()
		{
			return (EnlightenRuntimeConfig*)0x0000000046383B10;
		}
		static __inline unsigned int ClassId()
		{
			return 1513;
		}
		unsigned __int32 m_JobCount; //0x0018
		char _0x001C[4];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03717
	// RuntimeId: 08762
	// TypeInfo:  0x00000001427E5B10
#ifndef _EnlightenRuntimeSettings_
#define _EnlightenRuntimeSettings_
#pragma pack(push, 16)
	class EnlightenRuntimeSettings : public SystemSettings
	{
	public:
		static __inline EnlightenRuntimeSettings* DefaultInstance()
		{
			return (EnlightenRuntimeSettings*)0x00000000463C5990;
		}
		static __inline unsigned int ClassId()
		{
			return 3717;
		}
		Vec3 m_AlbedoDefaultColor; //0x0020
		float m_TemporalCoherenceThreshold; //0x0030
		float m_SkyBoxScale; //0x0034
		float m_MaxPerFrameSolveTime; //0x0038
		unsigned __int32 m_MinSystemUpdateCount; //0x003C
		unsigned __int32 m_JobCount; //0x0040
		unsigned __int32 m_CubeMapMaxUpdateCount; //0x0044
		unsigned __int32 m_CubeMapConvolutionSampleCount; //0x0048
		float m_CubeMapForceGlobalScale; //0x004C
		unsigned __int32 m_LightProbeMaxSourceSolveCount; //0x0050
		unsigned __int32 m_LightProbeMaxInstanceUpdateCount; //0x0054
		unsigned __int32 m_LightProbeLookupTableGridRes; //0x0058
		float m_LocalLightForceRadius; //0x005C
		__int32 m_DrawDebugSystemDependenciesEnable; //0x0060
		__int32 m_DrawDebugSystemBoundingBoxEnable; //0x0064
		float m_DrawDebugLightProbeSize; //0x0068
		bool m_Enable; //0x006C
		bool m_ForceDynamic; //0x006D
		bool m_ForceUpdateStaticLightingBuffersEnable; //0x006E
		bool m_SaveRadiosityTexturesEnable; //0x006F
		bool m_JobsEnable; //0x0070
		bool m_ShadowsEnable; //0x0071
		bool m_SpotLightShadowsEnable; //0x0072
		bool m_CubeMapsEnable; //0x0073
		bool m_CubeMapMip0OnlyEnable; //0x0074
		bool m_CubeMapCpuMipMapGenerationEnable; //0x0075
		bool m_CubeMapConvolutionEnable; //0x0076
		bool m_CompensateSunShadowHeightScale; //0x0077
		bool m_LightMapsEnable; //0x0078
		bool m_LightProbeEnable; //0x0079
		bool m_LightProbeNewSamplingEnable; //0x007A
		bool m_LightProbeForceUpdate; //0x007B
		bool m_LightProbeJobsEnable; //0x007C
		bool m_LocalLightsEnable; //0x007D
		bool m_LocalLightCullingEnable; //0x007E
		bool m_LocalLightCustumFalloff; //0x007F
		bool m_DrawDebugCubeMaps; //0x0080
		bool m_DrawDebugEntities; //0x0081
		bool m_DrawDebugSystemsEnable; //0x0082
		bool m_DrawDebugLightProbes; //0x0083
		bool m_DrawDebugLightProbeGrid; //0x0084
		bool m_DrawDebugLightProbeOcclusion; //0x0085
		bool m_DrawDebugLightProbeStats; //0x0086
		bool m_DrawDebugLightProbeBoundingBoxes; //0x0087
		bool m_DrawSolveTaskPerformance; //0x0088
		bool m_DrawDebugColoringEnable; //0x0089
		bool m_DrawDebugTextures; //0x008A
		bool m_DrawDebugBackFaces; //0x008B
		bool m_DrawDebugTargetMeshes; //0x008C
		bool m_DrawWarningsEnable; //0x008D
		bool m_AlbedoForceUpdateEnable; //0x008E
		bool m_AlbedoForceColorEnable; //0x008F
		bool m_TerrainMapEnable; //0x0090
		bool m_EmissiveEnable; //0x0091
		char _0x0092[14];
	};//Size=0x00A0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02929
	// RuntimeId: 08760
	// TypeInfo:  0x00000001427E5B70
#ifndef _DestructionVolumeComponentData_
#define _DestructionVolumeComponentData_
#pragma pack(push, 16)
	class DestructionVolumeComponentData : public GameComponentData
	{
	public:
		static __inline DestructionVolumeComponentData* DefaultInstance()
		{
			return (DestructionVolumeComponentData*)0x00000000463ADC20;
		}
		static __inline unsigned int ClassId()
		{
			return 2929;
		}
		DestructionVolumeData* m_DestructionVolumeData; //0x0070
		char _0x0078[8];
	};//Size=0x0080
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03617
	// RuntimeId: 08758
	// TypeInfo:  0x00000001427E5BD0
#ifndef _DestructionVolumeData_
#define _DestructionVolumeData_
#pragma pack(push, 16)
	class DestructionVolumeData : public DataContainer
	{
	public:
		static __inline DestructionVolumeData* DefaultInstance()
		{
			return (DestructionVolumeData*)0x00000000463C3060;
		}
		static __inline unsigned int ClassId()
		{
			return 3617;
		}
		DestructionVolumeAsset* m_Asset; //0x0010
		Array<Vec4> m_Impacts; //0x0018
		AxisAlignedBox m_BoundingBox; //0x0020
		Array<unsigned __int32> m_PartToImpactIndices; //0x0040
		char _0x0048[8];
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01512
	// RuntimeId: 08756
	// TypeInfo:  0x00000001427E5C30
#ifndef _DestructionVolumeAsset_
#define _DestructionVolumeAsset_
#pragma pack(push, 8)
	class DestructionVolumeAsset : public Asset
	{
	public:
		static __inline DestructionVolumeAsset* DefaultInstance()
		{
			return (DestructionVolumeAsset*)0x0000000046383AC0;
		}
		static __inline unsigned int ClassId()
		{
			return 1512;
		}
		TextureAsset* m_DiffuseAtlas; //0x0018
		TextureAsset* m_NormalmapAtlas; //0x0020
		float m_AtlasTextureScale; //0x0028
		char _0x002C[4];
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03683
	// RuntimeId: 08754
	// TypeInfo:  0x00000001427E5C90
#ifndef _DestructionVolumeSettings_
#define _DestructionVolumeSettings_
#pragma pack(push, 8)
	class DestructionVolumeSettings : public DataContainer
	{
	public:
		static __inline DestructionVolumeSettings* DefaultInstance()
		{
			return (DestructionVolumeSettings*)0x00000000463C4160;
		}
		static __inline unsigned int ClassId()
		{
			return 3683;
		}
		float m_PixelsPerMeter; //0x0010
		float m_DistanceFieldMultiplier; //0x0014
		__int32 m_TexturePoolSize; //0x0018
		__int32 m_TexturePoolHeadroomSize; //0x001C
		__int32 m_TexturePoolDefragTransferLimit; //0x0020
		bool m_JobsEnable; //0x0024
		bool m_ForceUpdateEnable; //0x0025
		bool m_DrawDebugVolumes; //0x0026
		bool m_DrawDebugImpacts; //0x0027
		bool m_DrawDebugTexturePool; //0x0028
		char _0x0029[7];
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00262
	// RuntimeId: 05244
	// TypeInfo:  0x0000000142791850
#ifndef _TimelineTrack_
#define _TimelineTrack_
	class TimelineTrack
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 262;
		}
		char _0x0000[104];
	};//Size=0x0068
#endif

	////////////////////////////////////////
	// ClassId:   00095
	// RuntimeId: 08751
	// TypeInfo:  0x00000001427E2C80
#ifndef _OccluderMesh_
#define _OccluderMesh_
	class OccluderMesh
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 95;
		}
		char _0x0000[40];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   01932
	// RuntimeId: 08750
	// TypeInfo:  0x00000001427E2BB0
#ifndef _PathfindingObjectCategoryAsset_
#define _PathfindingObjectCategoryAsset_
#pragma pack(push, 8)
	class PathfindingObjectCategoryAsset : public Asset
	{
	public:
		static __inline PathfindingObjectCategoryAsset* DefaultInstance()
		{
			return (PathfindingObjectCategoryAsset*)0x000000004638CE70;
		}
		static __inline unsigned int ClassId()
		{
			return 1932;
		}
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02091
	// RuntimeId: 08748
	// TypeInfo:  0x00000001427E2850
#ifndef _VegetationSystemSettings_
#define _VegetationSystemSettings_
#pragma pack(push, 8)
	class VegetationSystemSettings : public DataContainer
	{
	public:
		static __inline VegetationSystemSettings* DefaultInstance()
		{
			return (VegetationSystemSettings*)0x00000000463903A0;
		}
		static __inline unsigned int ClassId()
		{
			return 2091;
		}
		float m_WindVariation; //0x0010
		float m_WindVariationRate; //0x0014
		float m_WindStrength; //0x0018
		float m_WindMicroVariation; //0x001C
		float m_MaxActiveDistance; //0x0020
		float m_MaxEffectDistance; //0x0024
		unsigned __int32 m_MaxActiveBones; //0x0028
		unsigned __int32 m_SimulationMemKbServer; //0x002C
		unsigned __int32 m_SimulationMemKbClient; //0x0030
		unsigned __int32 m_MaxPreSimsPerJob; //0x0034
		float m_MaxWiggleDistance; //0x0038
		__int32 m_ForceShadowLod; //0x003C
		float m_TimeScale; //0x0040
		unsigned __int32 m_JobCount; //0x0044
		__int32 m_JointTensionLimitIndex; //0x0048
		float m_JointTensionLimit; //0x004C
		bool m_SimulateServerSide; //0x0050
		bool m_DestructionEnabled; //0x0051
		bool m_SubDestructionEnabled; //0x0052
		bool m_LocalInfluencesEnabled; //0x0053
		bool m_UseShadowLodOffset; //0x0054
		bool m_ShadowMeshEnable; //0x0055
		bool m_DissolveEnable; //0x0056
		bool m_Enable; //0x0057
		bool m_EnableJobs; //0x0058
		bool m_DrawNodes; //0x0059
		bool m_DrawNodeIDs; //0x005A
		bool m_DrawNodeStiffness; //0x005B
		bool m_DrawEnable; //0x005C
		bool m_BatchDrawEnable; //0x005D
		bool m_DrawNonSimulatedAsRigid; //0x005E
		bool m_DrawActiveInstanceBoxesEnable; //0x005F
		bool m_DrawEffectDebugInfoEnable; //0x0060
		bool m_DrawDamageDebugInfoEnable; //0x0061
		bool m_DrawStatsEnable; //0x0062
		bool m_ProceduralAnimationEnable; //0x0063
		char _0x0064[4];
	};//Size=0x0068
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02360
	// RuntimeId: 08742
	// TypeInfo:  0x00000001427E2910
#ifndef _VegetationBaseEntityData_
#define _VegetationBaseEntityData_
#pragma pack(push, 16)
	class VegetationBaseEntityData : public GameComponentEntityData
	{
	public:
		static __inline VegetationBaseEntityData* DefaultInstance()
		{
			return (VegetationBaseEntityData*)0x0000000046397120;
		}
		static __inline unsigned int ClassId()
		{
			return 2360;
		}
		Array<LinearTransform> m_BasePoseTransforms; //0x0080
		Array<__int32> m_Hierarchy; //0x0088
		Array<LinearTransform> m_LowResBasePoseTransforms; //0x0090
		Array<__int32> m_LowResHierarchy; //0x0098
		Array<__int32> m_PartIndirection; //0x00A0
		Array<__int32> m_PartHierarchy; //0x00A8
		Array<float> m_PartInitialHealths; //0x00B0
		SkinnedMeshAsset* m_Mesh; //0x00B8
		SkinnedMeshAsset* m_ShadowMesh; //0x00C0
		Array<bool> m_BoneIsStem; //0x00C8
		PhysicsEntityData* m_PhysicsData; //0x00D0
		char _0x00D8[8];
	};//Size=0x00E0
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02361
	// RuntimeId: 08746
	// TypeInfo:  0x00000001427E28B0
#ifndef _VegetationTreeEntityData_
#define _VegetationTreeEntityData_
#pragma pack(push, 16)
	class VegetationTreeEntityData : public VegetationBaseEntityData
	{
	public:
		static __inline VegetationTreeEntityData* DefaultInstance()
		{
			return (VegetationTreeEntityData*)0x0000000046397220;
		}
		static __inline unsigned int ClassId()
		{
			return 2361;
		}
		Vec3 m_InertiaModifier; //0x00E0
		Vec3 m_TranslucencyVolumeCenter; //0x00F0
		float m_Stiffness; //0x0100
		float m_Damping; //0x0104
		float m_StemMass; //0x0108
		float m_StiffnessSpread; //0x010C
		float m_DampingSpread; //0x0110
		float m_MassSpread; //0x0114
		float m_StemLockedUpTo; //0x0118
		__int32 m_StemBoneCount; //0x011C
		float m_BreakableJointThreshold; //0x0120
		float m_BoundingBoxScaleFactor; //0x0124
		float m_PartsTimeToLive; //0x0128
		float m_LinearVelocityDamping; //0x012C
		float m_AngularVelocityDamping; //0x0130
		float m_Friction; //0x0134
		float m_Restitution; //0x0138
		float m_StemPhysicsWidth; //0x013C
		float m_StemPhysicsHeightScale; //0x0140
		float m_BranchPhysicsWidth; //0x0144
		float m_BranchPhysicsHeightScale; //0x0148
		float m_DestructionMassScale; //0x014C
		float m_CenterOfMassVerticalScale; //0x0150
		char _0x0154[4];
		VegetationEffectSlot m_StemBreakEffect; //0x0158
		VegetationEffectSlot m_BranchBreakEffect; //0x0170
		VegetationEffectSlot m_ImpactEffect; //0x0188
		EffectBlueprint* m_WindEffect; //0x01A0
		float m_MinRespawnTime; //0x01A8
		unsigned __int32 m_StemEffectNodeThreshold; //0x01AC
		unsigned __int32 m_ShadowLODOffset; //0x01B0
		float m_ColiPlaneDepth; //0x01B4
		float m_StemHitpoints; //0x01B8
		float m_BranchHitpoints; //0x01BC
		float m_BranchL2Hitpoints; //0x01C0
		float m_StemStiffness; //0x01C4
		float m_StemStiffnessSpread; //0x01C8
		float m_StemStiffnessInherit; //0x01CC
		float m_BranchStiffness; //0x01D0
		float m_BranchStiffnessInherit; //0x01D4
		float m_BranchStiffnessL2; //0x01D8
		float m_BranchStiffnessL2Inherit; //0x01DC
		EffectBlueprint* m_BulletImpactEffect; //0x01E0
		EffectBlueprint* m_CollisionEffect; //0x01E8
		EffectBlueprint* m_SplashNearEffect; //0x01F0
		EffectBlueprint* m_SplashDistantEffect; //0x01F8
		EffectBlueprint* m_LocalWindEffect; //0x0200
		EffectBlueprint* m_StemRipEffect; //0x0208
		EffectBlueprint* m_TreeFallEffect; //0x0210
		EffectBlueprint* m_GroundImpactEffect; //0x0218
		float m_WindStem; //0x0220
		float m_WindBranch; //0x0224
		float m_WindBranchL2; //0x0228
		float m_WindEndPoints; //0x022C
		float m_InheritParentEndPoints; //0x0230
		float m_ImpactThreshold; //0x0234
		float m_CollisionImpactMultiplier; //0x0238
		float m_WindMicroVariationMultiplier; //0x023C
		float m_WindEPMicroVariationMultiplier; //0x0240
		float m_FallDirectionStart; //0x0244
		float m_FallDirectionEnd; //0x0248
		bool m_ConstantFalloff; //0x024C
		bool m_Indestructable; //0x024D
		bool m_TranslucencyEnabled; //0x024E
		bool m_ClientSideOnly; //0x024F
		bool m_UsePhysicsShapes; //0x0250
		bool m_ConstraintStemB1; //0x0251
		bool m_ConstraintStemB2; //0x0252
		bool m_ForceFullSim; //0x0253
		bool m_UseImpactThreshold; //0x0254
		char _0x0255[11];
	};//Size=0x0260
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00746
	// RuntimeId: 08740
	// TypeInfo:  0x00000001427E2970
#ifndef _VegetationTreeEntity_
#define _VegetationTreeEntity_
	class VegetationTreeEntity : public SpatialEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 746;
		}
		char _0x0028[104];
	};//Size=0x0090
#endif

	////////////////////////////////////////
	// ClassId:   00747
	// RuntimeId: 08739
	// TypeInfo:  0x00000001427E2AB0
#ifndef _ServerVegetationTreeEntity_
#define _ServerVegetationTreeEntity_
	class ServerVegetationTreeEntity : public VegetationTreeEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 747;
		}
		char _0x0090[224];
	};//Size=0x0170
#endif

	////////////////////////////////////////
	// ClassId:   00748
	// RuntimeId: 08738
	// TypeInfo:  0x00000001427E2A10
#ifndef _ClientVegetationTreeEntity_
#define _ClientVegetationTreeEntity_
	class ClientVegetationTreeEntity : public VegetationTreeEntity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 748;
		}
		char _0x0090[256];
	};//Size=0x0190
#endif

	////////////////////////////////////////
	// ClassId:   00096
	// RuntimeId: 08736
	// TypeInfo:  0x00000001427E25C0
#ifndef _ISwfMovie_
#define _ISwfMovie_
	class ISwfMovie
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 96;
		}
		char _0x0000[8];
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00097
	// RuntimeId: 08737
	// TypeInfo:  0x00000001427E2570
#ifndef _SwfMovie_
#define _SwfMovie_
	class SwfMovie : public ISwfMovie
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 97;
		}
		char _0x0008[32];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   02165
	// RuntimeId: 08671
	// TypeInfo:  0x00000001427E1180
#ifndef _UIGraphEntityData_
#define _UIGraphEntityData_
#pragma pack(push, 8)
	class UIGraphEntityData : public EntityData
	{
	public:
		static __inline UIGraphEntityData* DefaultInstance()
		{
			return (UIGraphEntityData*)0x0000000046392530;
		}
		static __inline unsigned int ClassId()
		{
			return 2165;
		}
		Array<EventSpec> m_Events; //0x0018
		UIGraphAsset* m_GraphAsset; //0x0020
		UIGraphPriority m_GraphPriority; //0x0028
		UIState m_State; //0x002C
		bool m_PopPreviousGraph; //0x0030
		char _0x0031[7];
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03548
	// RuntimeId: 08589
	// TypeInfo:  0x00000001427E1D80
#ifndef _UINodeData_
#define _UINodeData_
#pragma pack(push, 8)
	class UINodeData : public DataContainer
	{
	public:
		static __inline UINodeData* DefaultInstance()
		{
			return (UINodeData*)0x00000000463C1890;
		}
		static __inline unsigned int ClassId()
		{
			return 3548;
		}
		char* m_Name; //0x0010
		UIGraphAsset* m_ParentGraph; //0x0018
		bool m_IsRootNode; //0x0020
		bool m_ParentIsScreen; //0x0021
		char _0x0022[6];
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03562
	// RuntimeId: 08665
	// TypeInfo:  0x00000001427E1240
#ifndef _ScreenVisibilityNode_
#define _ScreenVisibilityNode_
#pragma pack(push, 8)
	class ScreenVisibilityNode : public UINodeData
	{
	public:
		static __inline ScreenVisibilityNode* DefaultInstance()
		{
			return (ScreenVisibilityNode*)0x00000000463C1E40;
		}
		static __inline unsigned int ClassId()
		{
			return 3562;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		unsigned __int32 m_ScreenCount; //0x0038
		unsigned __int32 m_SkipCount; //0x003C
		bool m_Visible; //0x0040
		char _0x0041[7];
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03563
	// RuntimeId: 08663
	// TypeInfo:  0x00000001427E12A0
#ifndef _JumpNode_
#define _JumpNode_
#pragma pack(push, 8)
	class JumpNode : public UINodeData
	{
	public:
		static __inline JumpNode* DefaultInstance()
		{
			return (JumpNode*)0x00000000463C1EA0;
		}
		static __inline unsigned int ClassId()
		{
			return 3563;
		}
		UINodePort* m_In; //0x0028
		UINodeData* m_TargetNode; //0x0030
		UINodePort* m_TargetPort; //0x0038
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03571
	// RuntimeId: 08613
	// TypeInfo:  0x00000001427E1A80
#ifndef _StateNode_
#define _StateNode_
#pragma pack(push, 8)
	class StateNode : public UINodeData
	{
	public:
		static __inline StateNode* DefaultInstance()
		{
			return (StateNode*)0x00000000463C21C0;
		}
		static __inline unsigned int ClassId()
		{
			return 3571;
		}
		UIViewBaseAsset* m_Screen; //0x0028
		UINodePort* m_In; //0x0030
		UINodePort* m_Show; //0x0038
		UINodePort* m_Hide; //0x0040
		Array<UINodePort*> m_Inputs; //0x0048
		Array<UINodePort*> m_Outputs; //0x0050
		__int32 m_RenderToRootView; //0x0058
		bool m_RenderToTexture; //0x005C
		char _0x005D[3];
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03570
	// RuntimeId: 08659
	// TypeInfo:  0x00000001427E1360
#ifndef _GlobalNode_
#define _GlobalNode_
#pragma pack(push, 8)
	class GlobalNode : public UINodeData
	{
	public:
		static __inline GlobalNode* DefaultInstance()
		{
			return (GlobalNode*)0x00000000463C2170;
		}
		static __inline unsigned int ClassId()
		{
			return 3570;
		}
		Array<UINodePort*> m_Outputs; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03549
	// RuntimeId: 08655
	// TypeInfo:  0x00000001427E13C0
#ifndef _ScreenOutputEventNode_
#define _ScreenOutputEventNode_
#pragma pack(push, 8)
	class ScreenOutputEventNode : public UINodeData
	{
	public:
		static __inline ScreenOutputEventNode* DefaultInstance()
		{
			return (ScreenOutputEventNode*)0x00000000463C18D0;
		}
		static __inline unsigned int ClassId()
		{
			return 3549;
		}
		UINodePort* m_Out; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03567
	// RuntimeId: 08653
	// TypeInfo:  0x00000001427E1420
#ifndef _ScreenInputEventNode_
#define _ScreenInputEventNode_
#pragma pack(push, 8)
	class ScreenInputEventNode : public UINodeData
	{
	public:
		static __inline ScreenInputEventNode* DefaultInstance()
		{
			return (ScreenInputEventNode*)0x00000000463C2060;
		}
		static __inline unsigned int ClassId()
		{
			return 3567;
		}
		UINodePort* m_In; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03568
	// RuntimeId: 08651
	// TypeInfo:  0x00000001427E1480
#ifndef _InstanceOutputNode_
#define _InstanceOutputNode_
#pragma pack(push, 8)
	class InstanceOutputNode : public UINodeData
	{
	public:
		static __inline InstanceOutputNode* DefaultInstance()
		{
			return (InstanceOutputNode*)0x00000000463C20B0;
		}
		static __inline unsigned int ClassId()
		{
			return 3568;
		}
		UINodePort* m_In; //0x0028
		__int32 m_Id; //0x0030
		bool m_DestroyGraph; //0x0034
		char _0x0035[3];
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03553
	// RuntimeId: 08649
	// TypeInfo:  0x00000001427E14E0
#ifndef _InstanceInputNode_
#define _InstanceInputNode_
#pragma pack(push, 8)
	class InstanceInputNode : public UINodeData
	{
	public:
		static __inline InstanceInputNode* DefaultInstance()
		{
			return (InstanceInputNode*)0x00000000463C1A30;
		}
		static __inline unsigned int ClassId()
		{
			return 3553;
		}
		UINodePort* m_Out; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03560
	// RuntimeId: 08647
	// TypeInfo:  0x00000001427E1540
#ifndef _InstanceNode_
#define _InstanceNode_
#pragma pack(push, 8)
	class InstanceNode : public UINodeData
	{
	public:
		static __inline InstanceNode* DefaultInstance()
		{
			return (InstanceNode*)0x00000000463C1D60;
		}
		static __inline unsigned int ClassId()
		{
			return 3560;
		}
		UIGraphAsset* m_UIGraph; //0x0028
		Array<UINodePort*> m_Inputs; //0x0030
		Array<UINodePort*> m_Outputs; //0x0038
	};//Size=0x0040
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03559
	// RuntimeId: 08645
	// TypeInfo:  0x00000001427E15A0
#ifndef _ActionNode_
#define _ActionNode_
#pragma pack(push, 8)
	class ActionNode : public UINodeData
	{
	public:
		static __inline ActionNode* DefaultInstance()
		{
			return (ActionNode*)0x00000000463C1CE0;
		}
		static __inline unsigned int ClassId()
		{
			return 3559;
		}
		__int32 m_ActionKey; //0x0028
		char _0x002C[4];
		Array<char*> m_Params; //0x0030
		Asset* m_ActionAsset; //0x0038
		UINodePort* m_In; //0x0040
		Array<UINodePort*> m_DataInputs; //0x0048
		UINodePort* m_Out; //0x0050
		bool m_AppendIncomingParams; //0x0058
		char _0x0059[7];
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03554
	// RuntimeId: 08643
	// TypeInfo:  0x00000001427E1600
#ifndef _OperandLogicNode_
#define _OperandLogicNode_
#pragma pack(push, 8)
	class OperandLogicNode : public UINodeData
	{
	public:
		static __inline OperandLogicNode* DefaultInstance()
		{
			return (OperandLogicNode*)0x00000000463C1A80;
		}
		static __inline unsigned int ClassId()
		{
			return 3554;
		}
		UISimpleDataSource m_LeftDataSourceInfo; //0x0028
		UILogicOperator m_Operator; //0x0038
		char _0x003C[4];
		UISimpleDataSource m_RightDataSourceInfo; //0x0040
		double m_RightLiteralOperand; //0x0050
		UINodePort* m_In; //0x0058
		UINodePort* m_True; //0x0060
		UINodePort* m_False; //0x0068
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03557
	// RuntimeId: 08641
	// TypeInfo:  0x00000001427E1660
#ifndef _ComparisonLogicNode_
#define _ComparisonLogicNode_
#pragma pack(push, 8)
	class ComparisonLogicNode : public UINodeData
	{
	public:
		static __inline ComparisonLogicNode* DefaultInstance()
		{
			return (ComparisonLogicNode*)0x00000000463C1C00;
		}
		static __inline unsigned int ClassId()
		{
			return 3557;
		}
		UINodePort* m_In; //0x0028
		Array<UINodePort*> m_Outputs; //0x0030
		UISimpleDataSource m_DataSourceInfo; //0x0038
		bool m_SkipFractionals; //0x0048
		char _0x0049[7];
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03558
	// RuntimeId: 08639
	// TypeInfo:  0x00000001427E16C0
#ifndef _BinaryLogicNode_
#define _BinaryLogicNode_
#pragma pack(push, 8)
	class BinaryLogicNode : public UINodeData
	{
	public:
		static __inline BinaryLogicNode* DefaultInstance()
		{
			return (BinaryLogicNode*)0x00000000463C1C70;
		}
		static __inline unsigned int ClassId()
		{
			return 3558;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_True; //0x0030
		UINodePort* m_False; //0x0038
		UISimpleDataSource m_DataSourceInfo; //0x0040
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03555
	// RuntimeId: 08637
	// TypeInfo:  0x00000001427E1720
#ifndef _MovieNavigationNode_
#define _MovieNavigationNode_
#pragma pack(push, 8)
	class MovieNavigationNode : public UINodeData
	{
	public:
		static __inline MovieNavigationNode* DefaultInstance()
		{
			return (MovieNavigationNode*)0x00000000463C1B10;
		}
		static __inline unsigned int ClassId()
		{
			return 3555;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		char* m_MovieClipPath; //0x0038
		char* m_FrameLabel; //0x0040
		unsigned __int32 m_Frame; //0x0048
		bool m_UseLabel; //0x004C
		bool m_Play; //0x004D
		char _0x004E[2];
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03566
	// RuntimeId: 08635
	// TypeInfo:  0x00000001427E1780
#ifndef _DataBindingNode_
#define _DataBindingNode_
#pragma pack(push, 8)
	class DataBindingNode : public UINodeData
	{
	public:
		static __inline DataBindingNode* DefaultInstance()
		{
			return (DataBindingNode*)0x00000000463C2000;
		}
		static __inline unsigned int ClassId()
		{
			return 3566;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		UIDataBinding* m_DataBinding; //0x0038
		UIWidgetEventID m_WidgetEvent; //0x0040
		char _0x0044[4];
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03552
	// RuntimeId: 08633
	// TypeInfo:  0x00000001427E17E0
#ifndef _RefreshNode_
#define _RefreshNode_
#pragma pack(push, 8)
	class RefreshNode : public UINodeData
	{
	public:
		static __inline RefreshNode* DefaultInstance()
		{
			return (RefreshNode*)0x00000000463C19D0;
		}
		static __inline unsigned int ClassId()
		{
			return 3552;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		UISimpleDataSource m_DataSource; //0x0038
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03561
	// RuntimeId: 08631
	// TypeInfo:  0x00000001427E1840
#ifndef _DataStepNode_
#define _DataStepNode_
#pragma pack(push, 8)
	class DataStepNode : public UINodeData
	{
	public:
		static __inline DataStepNode* DefaultInstance()
		{
			return (DataStepNode*)0x00000000463C1DC0;
		}
		static __inline unsigned int ClassId()
		{
			return 3561;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		Array<float> m_Steps; //0x0038
		UISimpleDataSource m_CurrentStepDataSource; //0x0040
		UISimpleDataSource m_DataSource; //0x0050
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03565
	// RuntimeId: 08629
	// TypeInfo:  0x00000001427E18A0
#ifndef _DataIncrementNode_
#define _DataIncrementNode_
#pragma pack(push, 8)
	class DataIncrementNode : public UINodeData
	{
	public:
		static __inline DataIncrementNode* DefaultInstance()
		{
			return (DataIncrementNode*)0x00000000463C1F90;
		}
		static __inline unsigned int ClassId()
		{
			return 3565;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		float m_Max; //0x0038
		float m_Min; //0x003C
		float m_IncrementSize; //0x0040
		char _0x0044[4];
		UISimpleDataSource m_DataSource; //0x0048
	};//Size=0x0058
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03550
	// RuntimeId: 08627
	// TypeInfo:  0x00000001427E1900
#ifndef _DataToggleNode_
#define _DataToggleNode_
#pragma pack(push, 8)
	class DataToggleNode : public UINodeData
	{
	public:
		static __inline DataToggleNode* DefaultInstance()
		{
			return (DataToggleNode*)0x00000000463C1920;
		}
		static __inline unsigned int ClassId()
		{
			return 3550;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		UISimpleDataSource m_DataSource; //0x0038
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03556
	// RuntimeId: 08625
	// TypeInfo:  0x00000001427E1960
#ifndef _DataSetNode_
#define _DataSetNode_
#pragma pack(push, 8)
	class DataSetNode : public UINodeData
	{
	public:
		static __inline DataSetNode* DefaultInstance()
		{
			return (DataSetNode*)0x00000000463C1B80;
		}
		static __inline unsigned int ClassId()
		{
			return 3556;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		char* m_Param; //0x0038
		DataSetParamType m_ParamType; //0x0040
		char _0x0044[4];
		UISimpleDataSource m_DataSource; //0x0048
		bool m_SetToEmptyString; //0x0058
		bool m_ForceUpdate; //0x0059
		char _0x005A[6];
	};//Size=0x0060
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03569
	// RuntimeId: 08621
	// TypeInfo:  0x00000001427E19C0
#ifndef _DataGetNode_
#define _DataGetNode_
#pragma pack(push, 8)
	class DataGetNode : public UINodeData
	{
	public:
		static __inline DataGetNode* DefaultInstance()
		{
			return (DataGetNode*)0x00000000463C2100;
		}
		static __inline unsigned int ClassId()
		{
			return 3569;
		}
		UINodePort* m_In; //0x0028
		UINodePort* m_Out; //0x0030
		UISimpleDataSource m_DataSource; //0x0038
		UIWidgetEventID m_WidgetEvent; //0x0048
		char _0x004C[4];
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03564
	// RuntimeId: 08619
	// TypeInfo:  0x00000001427E1A20
#ifndef _WidgetNode_
#define _WidgetNode_
#pragma pack(push, 8)
	class WidgetNode : public UINodeData
	{
	public:
		static __inline WidgetNode* DefaultInstance()
		{
			return (WidgetNode*)0x00000000463C1F00;
		}
		static __inline unsigned int ClassId()
		{
			return 3564;
		}
		UIWidgetAsset* m_WidgetAsset; //0x0028
		__int32 m_FocusIndex; //0x0030
		WidgetVerticalAlignment m_VerticalAlign; //0x0034
		WidgetHorisontalAlignment m_HorisontalAlign; //0x0038
		__int32 m_ZDepthLevel; //0x003C
		UIDataBinding* m_DataBinding; //0x0040
		char* m_InstanceName; //0x0048
		Array<UIWidgetProperty> m_WidgetProperties; //0x0050
		Array<UINodePort*> m_Outputs; //0x0058
		Array<UINodePort*> m_Inputs; //0x0060
		bool m_AlwaysInFocus; //0x0068
		bool m_IsDisabled; //0x0069
		char _0x006A[6];
	};//Size=0x0070
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03572
	// RuntimeId: 08661
	// TypeInfo:  0x00000001427E1300
#ifndef _DialogNode_
#define _DialogNode_
#pragma pack(push, 8)
	class DialogNode : public StateNode
	{
	public:
		static __inline DialogNode* DefaultInstance()
		{
			return (DialogNode*)0x00000000463C2240;
		}
		static __inline unsigned int ClassId()
		{
			return 3572;
		}
		char* m_DialogTitle; //0x0060
		char* m_DialogText; //0x0068
		Array<UIPopupButton> m_Buttons; //0x0070
	};//Size=0x0078
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01455
	// RuntimeId: 08535
	// TypeInfo:  0x00000001427E2320
#ifndef _UIAsset_
#define _UIAsset_
#pragma pack(push, 8)
	class UIAsset : public Asset
	{
	public:
		static __inline UIAsset* DefaultInstance()
		{
			return (UIAsset*)0x0000000046382660;
		}
		static __inline unsigned int ClassId()
		{
			return 1455;
		}
		// unhandled basic type ResourceRef m_SwfMovieResource; //0x0018
		char _0x0018[8];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01896
	// RuntimeId: 08591
	// TypeInfo:  0x00000001427E1D20
#ifndef _UIGraphAsset_
#define _UIGraphAsset_
#pragma pack(push, 8)
	class UIGraphAsset : public Asset
	{
	public:
		static __inline UIGraphAsset* DefaultInstance()
		{
			return (UIGraphAsset*)0x000000004638C270;
		}
		static __inline unsigned int ClassId()
		{
			return 1896;
		}
		Array<UINodeData*> m_Nodes; //0x0018
		GlobalNode* m_GlobalNode; //0x0020
		Array<UINodeConnection*> m_Connections; //0x0028
		UIAudioEventAsset* m_AudioEventMappings; //0x0030
		char* m_BundleAssetName; //0x0038
		Array<UIEventAsset*> m_EventList; //0x0040
		bool m_ProtectScreens; //0x0048
		bool m_Modal; //0x0049
		bool m_IsWin32UIGraphAsset; //0x004A
		bool m_IsXenonUIGraphAsset; //0x004B
		bool m_IsPs3UIGraphAsset; //0x004C
		bool m_IsGen4aUIGraphAsset; //0x004D
		bool m_IsGen4bUIGraphAsset; //0x004E
		char _0x004F[1];
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01897
	// RuntimeId: 08603
	// TypeInfo:  0x00000001427E1C00
#ifndef _UIViewBaseAsset_
#define _UIViewBaseAsset_
#pragma pack(push, 8)
	class UIViewBaseAsset : public UIGraphAsset
	{
	public:
		static __inline UIViewBaseAsset* DefaultInstance()
		{
			return (UIViewBaseAsset*)0x000000004638C2E0;
		}
		static __inline unsigned int ClassId()
		{
			return 1897;
		}
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01898
	// RuntimeId: 08607
	// TypeInfo:  0x00000001427E1B40
#ifndef _UIViewAsset_
#define _UIViewAsset_
#pragma pack(push, 8)
	class UIViewAsset : public UIViewBaseAsset
	{
	public:
		static __inline UIViewAsset* DefaultInstance()
		{
			return (UIViewAsset*)0x000000004638C350;
		}
		static __inline unsigned int ClassId()
		{
			return 1898;
		}
	};//Size=0x0050
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03158
	// RuntimeId: 08595
	// TypeInfo:  0x00000001427E1CC0
#ifndef _UIDataBinding_
#define _UIDataBinding_
#pragma pack(push, 8)
	class UIDataBinding : public DataContainer
	{
	public:
		static __inline UIDataBinding* DefaultInstance()
		{
			return (UIDataBinding*)0x00000000463B8ED0;
		}
		static __inline unsigned int ClassId()
		{
			return 3158;
		}
	};//Size=0x0010
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03162
	// RuntimeId: 08601
	// TypeInfo:  0x00000001427E1C60
#ifndef _UIDynamicDataBinding_
#define _UIDynamicDataBinding_
#pragma pack(push, 8)
	class UIDynamicDataBinding : public UIDataBinding
	{
	public:
		static __inline UIDynamicDataBinding* DefaultInstance()
		{
			return (UIDynamicDataBinding*)0x00000000463B9050;
		}
		static __inline unsigned int ClassId()
		{
			return 3162;
		}
		Array<UIDataSourceInfo> m_Bindings; //0x0010
		bool m_Refresh; //0x0018
		char _0x0019[7];
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01900
	// RuntimeId: 08605
	// TypeInfo:  0x00000001427E1BA0
#ifndef _UIScreenAsset_
#define _UIScreenAsset_
#pragma pack(push, 8)
	class UIScreenAsset : public UIViewBaseAsset
	{
	public:
		static __inline UIScreenAsset* DefaultInstance()
		{
			return (UIScreenAsset*)0x000000004638C450;
		}
		static __inline unsigned int ClassId()
		{
			return 1900;
		}
		UIAsset* m_UIAsset; //0x0050
		char* m_SwfPath; //0x0058
		UIScreenPurpose m_Purpose; //0x0060
		char _0x0064[4];
	};//Size=0x0068
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03551
	// RuntimeId: 08667
	// TypeInfo:  0x00000001427E11E0
#ifndef _SplitterNode_
#define _SplitterNode_
#pragma pack(push, 8)
	class SplitterNode : public UINodeData
	{
	public:
		static __inline SplitterNode* DefaultInstance()
		{
			return (SplitterNode*)0x00000000463C1980;
		}
		static __inline unsigned int ClassId()
		{
			return 3551;
		}
		UINodePort* m_In; //0x0028
		Array<UINodePort*> m_Outputs; //0x0030
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03684
	// RuntimeId: 08587
	// TypeInfo:  0x00000001427E1DE0
#ifndef _UINodeConnection_
#define _UINodeConnection_
#pragma pack(push, 8)
	class UINodeConnection : public DataContainer
	{
	public:
		static __inline UINodeConnection* DefaultInstance()
		{
			return (UINodeConnection*)0x00000000463C41B0;
		}
		static __inline unsigned int ClassId()
		{
			return 3684;
		}
		UINodeData* m_SourceNode; //0x0010
		UINodeData* m_TargetNode; //0x0018
		UINodePort* m_SourcePort; //0x0020
		UINodePort* m_TargetPort; //0x0028
		char* m_SourcePortName; //0x0030
		char* m_TargetPortName; //0x0038
		__int32 m_NumScreensToPop; //0x0040
		char _0x0044[4];
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03546
	// RuntimeId: 08583
	// TypeInfo:  0x00000001427E1EA0
#ifndef _UINodePort_
#define _UINodePort_
#pragma pack(push, 8)
	class UINodePort : public DataContainer
	{
	public:
		static __inline UINodePort* DefaultInstance()
		{
			return (UINodePort*)0x00000000463C1800;
		}
		static __inline unsigned int ClassId()
		{
			return 3546;
		}
		char* m_Name; //0x0010
		char* m_InstanceName; //0x0018
		UIWidgetEventID m_Query; //0x0020
		bool m_AllowManualRemove; //0x0024
		bool m_IsReferencePort; //0x0025
		char _0x0026[2];
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   03547
	// RuntimeId: 08585
	// TypeInfo:  0x00000001427E1E40
#ifndef _UIInputEventNodePort_
#define _UIInputEventNodePort_
#pragma pack(push, 8)
	class UIInputEventNodePort : public UINodePort
	{
	public:
		static __inline UIInputEventNodePort* DefaultInstance()
		{
			return (UIInputEventNodePort*)0x00000000463C1840;
		}
		static __inline unsigned int ClassId()
		{
			return 3547;
		}
		UIInputAction m_InputEventType; //0x0028
		char _0x002C[4];
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01818
	// RuntimeId: 08581
	// TypeInfo:  0x00000001427E1F00
#ifndef _UIInterruptFlow_
#define _UIInterruptFlow_
#pragma pack(push, 8)
	class UIInterruptFlow : public Asset
	{
	public:
		static __inline UIInterruptFlow* DefaultInstance()
		{
			return (UIInterruptFlow*)0x000000004638A4C0;
		}
		static __inline unsigned int ClassId()
		{
			return 1818;
		}
		Array<InterruptFlow> m_interruptFlow; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01473
	// RuntimeId: 08577
	// TypeInfo:  0x00000001427E1F60
#ifndef _UIAudioEventAsset_
#define _UIAudioEventAsset_
#pragma pack(push, 8)
	class UIAudioEventAsset : public Asset
	{
	public:
		static __inline UIAudioEventAsset* DefaultInstance()
		{
			return (UIAudioEventAsset*)0x0000000046382C10;
		}
		static __inline unsigned int ClassId()
		{
			return 1473;
		}
		Array<UIAudioEventMapping> m_AudioEventMappings; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01621
	// RuntimeId: 08565
	// TypeInfo:  0x00000001427E1FC0
#ifndef _UIEventAsset_
#define _UIEventAsset_
#pragma pack(push, 8)
	class UIEventAsset : public Asset
	{
	public:
		static __inline UIEventAsset* DefaultInstance()
		{
			return (UIEventAsset*)0x0000000046385E10;
		}
		static __inline unsigned int ClassId()
		{
			return 1621;
		}
		char* m_Category; //0x0018
		Array<char*> m_EventList; //0x0020
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01884
	// RuntimeId: 08563
	// TypeInfo:  0x00000001427E2020
#ifndef _UIActionData_
#define _UIActionData_
#pragma pack(push, 8)
	class UIActionData : public Asset
	{
	public:
		static __inline UIActionData* DefaultInstance()
		{
			return (UIActionData*)0x000000004638BB50;
		}
		static __inline unsigned int ClassId()
		{
			return 1884;
		}
		Array<char*> m_ActionKeys; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01998
	// RuntimeId: 08559
	// TypeInfo:  0x00000001427E2080
#ifndef _UIGraphPipelineSettings_
#define _UIGraphPipelineSettings_
#pragma pack(push, 8)
	class UIGraphPipelineSettings : public DataContainer
	{
	public:
		static __inline UIGraphPipelineSettings* DefaultInstance()
		{
			return (UIGraphPipelineSettings*)0x000000004638E500;
		}
		static __inline unsigned int ClassId()
		{
			return 1998;
		}
		bool m_OneBundlePerGraph; //0x0010
		char _0x0011[7];
	};//Size=0x0018
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01741
	// RuntimeId: 08557
	// TypeInfo:  0x00000001427E20E0
#ifndef _UIResourceTable_
#define _UIResourceTable_
#pragma pack(push, 8)
	class UIResourceTable : public Asset
	{
	public:
		static __inline UIResourceTable* DefaultInstance()
		{
			return (UIResourceTable*)0x00000000463885C0;
		}
		static __inline unsigned int ClassId()
		{
			return 1741;
		}
		Array<UIResourceTableEntry> m_Entries; //0x0018
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01426
	// RuntimeId: 08553
	// TypeInfo:  0x00000001427E2140
#ifndef _UIColor_
#define _UIColor_
#pragma pack(push, 16)
	class UIColor : public DataContainer
	{
	public:
		static __inline UIColor* DefaultInstance()
		{
			return (UIColor*)0x0000000046381CA0;
		}
		static __inline unsigned int ClassId()
		{
			return 1426;
		}
		UIColorType m_ColorType; //0x0010
		char _0x0014[12];
		Vec4 m_Color; //0x0020
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01885
	// RuntimeId: 08549
	// TypeInfo:  0x00000001427E21A0
#ifndef _UIFontMappingCollection_
#define _UIFontMappingCollection_
#pragma pack(push, 8)
	class UIFontMappingCollection : public Asset
	{
	public:
		static __inline UIFontMappingCollection* DefaultInstance()
		{
			return (UIFontMappingCollection*)0x000000004638BB90;
		}
		static __inline unsigned int ClassId()
		{
			return 1885;
		}
		Array<UIFontMapping> m_Fonts; //0x0018
		Array<UITextDatabase*> m_TextDatabase; //0x0020
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01718
	// RuntimeId: 08545
	// TypeInfo:  0x00000001427E2200
#ifndef _UIFontAsset_
#define _UIFontAsset_
#pragma pack(push, 8)
	class UIFontAsset : public Asset
	{
	public:
		static __inline UIFontAsset* DefaultInstance()
		{
			return (UIFontAsset*)0x0000000046387D30;
		}
		static __inline unsigned int ClassId()
		{
			return 1718;
		}
		char* m_SourceFile; //0x0018
		UITextDatabase* m_TextDatabase; //0x0020
		Array<char*> m_ScaleformFontName; //0x0028
		bool m_NumericsOnly; //0x0030
		bool m_Bold; //0x0031
		bool m_CompleteKorean; //0x0032
		bool m_CompleteJapanese; //0x0033
		bool m_CompleteTraditionalChinese; //0x0034
		char _0x0035[3];
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01889
	// RuntimeId: 08543
	// TypeInfo:  0x00000001427E2260
#ifndef _UIBundlesAsset_
#define _UIBundlesAsset_
#pragma pack(push, 8)
	class UIBundlesAsset : public Asset
	{
	public:
		static __inline UIBundlesAsset* DefaultInstance()
		{
			return (UIBundlesAsset*)0x000000004638C090;
		}
		static __inline unsigned int ClassId()
		{
			return 1889;
		}
		Array<UIBundleAssetState> m_UIBundleAssetStateList; //0x0018
		Array<FontCollectionLookupEntry> m_FontCollectionLookups; //0x0020
		char* m_RootMovieClipPath; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01456
	// RuntimeId: 08537
	// TypeInfo:  0x00000001427E22C0
#ifndef _UIActionscriptLibraryAsset_
#define _UIActionscriptLibraryAsset_
#pragma pack(push, 8)
	class UIActionscriptLibraryAsset : public UIAsset
	{
	public:
		static __inline UIActionscriptLibraryAsset* DefaultInstance()
		{
			return (UIActionscriptLibraryAsset*)0x00000000463826A0;
		}
		static __inline unsigned int ClassId()
		{
			return 1456;
		}
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01457
	// RuntimeId: 08611
	// TypeInfo:  0x00000001427E1AE0
#ifndef _UIWidgetAsset_
#define _UIWidgetAsset_
#pragma pack(push, 8)
	class UIWidgetAsset : public UIAsset
	{
	public:
		static __inline UIWidgetAsset* DefaultInstance()
		{
			return (UIWidgetAsset*)0x00000000463826E0;
		}
		static __inline unsigned int ClassId()
		{
			return 1457;
		}
		Array<WidgetEventQueryPair> m_WidgetEvents; //0x0020
	};//Size=0x0028
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01483
	// RuntimeId: 08921
	// TypeInfo:  0x00000001427E7410
#ifndef _FsLocalizationAsset_
#define _FsLocalizationAsset_
#pragma pack(push, 8)
	class FsLocalizationAsset : public LocalizationAsset
	{
	public:
		static __inline FsLocalizationAsset* DefaultInstance()
		{
			return (FsLocalizationAsset*)0x0000000046382FA0;
		}
		static __inline unsigned int ClassId()
		{
			return 1483;
		}
	};//Size=0x0020
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01475
	// RuntimeId: 08923
	// TypeInfo:  0x00000001427E73B0
#ifndef _FsUITextDatabase_
#define _FsUITextDatabase_
#pragma pack(push, 8)
	class FsUITextDatabase : public UITextDatabase
	{
	public:
		static __inline FsUITextDatabase* DefaultInstance()
		{
			return (FsUITextDatabase*)0x0000000046382CB0;
		}
		static __inline unsigned int ClassId()
		{
			return 1475;
		}
	};//Size=0x0048
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01886
	// RuntimeId: 08511
	// TypeInfo:  0x00000001427E2440
#ifndef _UIStateAsset_
#define _UIStateAsset_
#pragma pack(push, 8)
	class UIStateAsset : public Asset
	{
	public:
		static __inline UIStateAsset* DefaultInstance()
		{
			return (UIStateAsset*)0x000000004638BBD0;
		}
		static __inline unsigned int ClassId()
		{
			return 1886;
		}
		Array<UIComponentData*> m_UIComponents; //0x0018
		Array<char*> m_ActionscriptNames; //0x0020
		char* m_StateName; //0x0028
		char* m_StatePath; //0x0030
	};//Size=0x0038
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   01623
	// RuntimeId: 08507
	// TypeInfo:  0x00000001427E24A0
#ifndef _UIComponentData_
#define _UIComponentData_
#pragma pack(push, 8)
	class UIComponentData : public Asset
	{
	public:
		static __inline UIComponentData* DefaultInstance()
		{
			return (UIComponentData*)0x0000000046385E90;
		}
		static __inline unsigned int ClassId()
		{
			return 1623;
		}
		char* m_ShortName; //0x0018
		Array<char*> m_DataSources; //0x0020
		__int32 m_UpdatesPerSecond; //0x0028
		UIUpdateType m_UpdateType; //0x002C
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00098
	// RuntimeId: 08503
	// TypeInfo:  0x00000001427DDA90
#ifndef _TerrainTextureTree_
#define _TerrainTextureTree_
	class TerrainTextureTree
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 98;
		}
		char _0x0000[720];
	};//Size=0x02D0
#endif

	////////////////////////////////////////
	// ClassId:   00099
	// RuntimeId: 08502
	// TypeInfo:  0x00000001427DDAE0
#ifndef _MeshScatteringTree_
#define _MeshScatteringTree_
	class MeshScatteringTree
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 99;
		}
		char _0x0000[1280];
	};//Size=0x0500
#endif

	////////////////////////////////////////
	// ClassId:   00613
	// RuntimeId: 08501
	// TypeInfo:  0x00000001427DDB30
#ifndef _VisualTerrainEntity_
#define _VisualTerrainEntity_
	class VisualTerrainEntity : public Entity
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 613;
		}
		char _0x0020[40];
	};//Size=0x0048
#endif

	////////////////////////////////////////
	// ClassId:   03132
	// RuntimeId: 08500
	// TypeInfo:  0x00000001427DD980
#ifndef _VisualTerrainSettings_
#define _VisualTerrainSettings_
#pragma pack(push, 8)
	class VisualTerrainSettings : public DataContainer
	{
	public:
		static __inline VisualTerrainSettings* DefaultInstance()
		{
			return (VisualTerrainSettings*)0x00000000463B8370;
		}
		static __inline unsigned int ClassId()
		{
			return 3132;
		}
		QualityLevel m_MeshScatteringQualityLevel; //0x0010
		TerrainRenderMode m_RenderMode; //0x0014
		float m_TriangleSizeMin; //0x0018
		float m_LodScale; //0x001C
		float m_LodCenterExtrapolationDistanceMax; //0x0020
		float m_LodCenterExtrapolationTime; //0x0024
		float m_TextureSkipMipSpeed; //0x0028
		float m_DxTessellatedTriWidth; //0x002C
		float m_DxTessellationPatchShrink; //0x0030
		unsigned __int32 m_DxTessellationPatchFacesPerSide; //0x0034
		unsigned __int32 m_TextureAtlasSampleCountXFactor; //0x0038
		unsigned __int32 m_TextureAtlasSampleCountYFactor; //0x003C
		float m_TextureSamplesPerMeterMax; //0x0040
		float m_TextureDetailFalloffFactor; //0x0044
		float m_TextureDetailFalloffDistance; //0x0048
		float m_TextureDetailFalloffCurve; //0x004C
		float m_TextureInvisibleDetailReductionFactor; //0x0050
		float m_TextureOccludedDetailReductionFactor; //0x0054
		unsigned __int32 m_TextureRenderJobCount; //0x0058
		unsigned __int32 m_TextureRenderJobsLaunchedPerFrameCountMax; //0x005C
		unsigned __int32 m_TextureTileSamplesPerSide; //0x0060
		unsigned __int32 m_TextureTileBorderWidth; //0x0064
		__int32 m_TextureLevelOffset; //0x0068
		unsigned __int32 m_TextureClodFrameCount; //0x006C
		float m_TextureClodCutoffPriority; //0x0070
		unsigned __int32 m_TextureStreamableTextureInstanceBufferSize; //0x0074
		unsigned __int32 m_TextureCompressJobCount; //0x0078
		__int32 m_TextureCompressionQuality; //0x007C
		float m_TextureDetailSlopeBoost; //0x0080
		float m_TextureGenerationMipBias; //0x0084
		float m_TextureDirtyRetryRate; //0x0088
		__int32 m_TextureForceDrawPass; //0x008C
		unsigned __int32 m_TextureQuadsPerTileLevel; //0x0090
		float m_DecalZPassDrawDistance; //0x0094
		float m_DecalOffsetY; //0x0098
		float m_Decal3dFarDrawDistanceScaleFactor; //0x009C
		__int32 m_DrawQuadtreeZoomIndex; //0x00A0
		float m_PatchErrorFov; //0x00A4
		float m_ZPassDistance; //0x00A8
		float m_DebugOverlayGridSize; //0x00AC
		float m_DebugOverlayIsolineSpacing; //0x00B0
		unsigned __int32 m_SlotReuseWaitCount; //0x00B4
		unsigned __int32 m_BuildJobCount; //0x00B8
		float m_DynamicMaskDecalWidthScale; //0x00BC
		unsigned __int32 m_MaxNonVisibleTextureUpdateCount; //0x00C0
		unsigned __int32 m_PatchFacesPerSide; //0x00C4
		unsigned __int32 m_TessellationFacesPerSideMin; //0x00C8
		unsigned __int32 m_PatchSlotCount; //0x00CC
		unsigned __int32 m_OccluderJobCount; //0x00D0
		unsigned __int32 m_OccluderPatchFacesPerSide; //0x00D4
		float m_OccluderLodScale; //0x00D8
		float m_OccludedMinDistance; //0x00DC
		unsigned __int32 m_MeshScatteringCellPoolCapacity; //0x00E0
		unsigned __int32 m_MeshScatteringTreeNodePoolCapacity; //0x00E4
		float m_MeshScatteringInvisibleCellFovFactor; //0x00E8
		unsigned __int32 m_MeshScatteringCullRecordCount; //0x00EC
		unsigned __int32 m_MeshScatteringBuildChannelCount; //0x00F0
		unsigned __int32 m_MeshScatteringBuildChannelsLaunchedPerFrameCountMax; //0x00F4
		unsigned __int32 m_MeshScatteringClodFrameCount; //0x00F8
		float m_MeshScatteringWindSpeed; //0x00FC
		unsigned __int32 m_MeshScatteringInstancesPerCellMax; //0x0100
		float m_MeshScatteringDensityMarginFactor; //0x0104
		float m_MeshScatteringPregenerationDistanceRatio; //0x0108
		float m_MeshScatteringKeepDistanceRatio; //0x010C
		__int32 m_MeshScatteringVirtualTextureBlurriness; //0x0110
		float m_MeshScatteringDistanceScaleFactor; //0x0114
		unsigned __int32 m_MeshScatteringInstanceCullJobCount; //0x0118
		unsigned __int32 m_MeshScatteringInstanceCullListCount; //0x011C
		float m_MeshScatteringSnappingGridMultiplierVertical; //0x0120
		float m_MeshScatteringSnappingGridMultiplierHorizontal; //0x0124
		bool m_WireframeEnable; //0x0128
		bool m_Enable; //0x0129
		bool m_EditServiceEnable; //0x012A
		bool m_DxDisplacementMappingEnable; //0x012B
		bool m_DxDensityMapEnable; //0x012C
		bool m_VertexBufferHeightsEnable; //0x012D
		bool m_DrawVertexYTextureEnable; //0x012E
		bool m_TextureVtIndirectionJobEnable; //0x012F
		bool m_TextureVtIndirectionSpuJobEnable; //0x0130
		bool m_TextureStreamingPrioritizationJobEnable; //0x0131
		bool m_TextureStreamingPrioritizationSpuJobEnable; //0x0132
		bool m_TextureClodEnable; //0x0133
		bool m_TextureForceUpdateEnable; //0x0134
		bool m_TextureCompressFastAlgorithmEnable; //0x0135
		bool m_TextureCompressSpuJobsEnable; //0x0136
		bool m_DrawTextureDebugColors; //0x0137
		bool m_TextureDrawTerrainLayersEnable; //0x0138
		bool m_TextureKeepPoolFullEnable; //0x0139
		bool m_TextureLayerCullingEnable; //0x013A
		bool m_GpuTextureCompressionEnable; //0x013B
		bool m_TextureStreamingPrioritizationEnable; //0x013C
		bool m_DetailTextureStreamingPrioritizationEnable; //0x013D
		bool m_MeshScatteringMeshStreamingPrioritizationEnable; //0x013E
		bool m_PrioritizationSpuJobEnable; //0x013F
		bool m_PrioritizationOcclusionEnable; //0x0140
		bool m_DrawEnable; //0x0141
		bool m_DrawPatchesEnable; //0x0142
		bool m_DetailOverlayEnable; //0x0143
		bool m_DecalEnable; //0x0144
		bool m_ForceDecalReducedQuality; //0x0145
		bool m_DrawDecal2dEnable; //0x0146
		bool m_DrawDecal3dEnable; //0x0147
		bool m_DrawDecalZPassEnable; //0x0148
		bool m_DrawOnlyDecalZPassEnable; //0x0149
		bool m_DrawPatchBoxesEnable; //0x014A
		bool m_DrawBadPatchesEnable; //0x014B
		bool m_DrawTextureTileBoxesEnable; //0x014C
		bool m_DrawDebugTextEnable; //0x014D
		bool m_DrawDebugTexturesEnable; //0x014E
		bool m_DrawQuadtreesEnable; //0x014F
		bool m_DrawQuadtreeStatsEnable; //0x0150
		bool m_DrawQuadtreeAtlasTexturesEnable; //0x0151
		bool m_DrawDestructionMask; //0x0152
		bool m_DrawWaterEnable; //0x0153
		bool m_PatchErrorFovEnable; //0x0154
		bool m_DebugOverlayGridEnable; //0x0155
		bool m_DebugOverlayIsolinesEnable; //0x0156
		bool m_DebugOverlayWireframeEnable; //0x0157
		bool m_DebugOverlaySketchTextureEnable; //0x0158
		bool m_DebugOverlayBrushEnable; //0x0159
		bool m_ForceGraphicsDriverCrash; //0x015A
		bool m_ForcePatchRebuildEnable; //0x015B
		bool m_DestroyAll; //0x015C
		bool m_SlotDebugOutputEnable; //0x015D
		bool m_UpdateJobsEnable; //0x015E
		bool m_CullSpuJobEnable; //0x015F
		bool m_PrepareBuildSpuJobEnable; //0x0160
		bool m_BuildSpuJobEnable; //0x0161
		bool m_RegenerateTexturesEnable; //0x0162
		bool m_DynamicMaskEnable; //0x0163
		bool m_PatchLodTransitionsEnable; //0x0164
		bool m_PatchMaterialSortingEnable; //0x0165
		bool m_CullSampleBoundingBoxHeightEnable; //0x0166
		bool m_CastShadowsEnable; //0x0167
		bool m_CastPlanarReflectionEnable; //0x0168
		bool m_CastEnvmapReflectionEnable; //0x0169
		bool m_CastDecal3dPlanarReflectionEnable; //0x016A
		bool m_CastDecal3dEnvmapReflectionEnable; //0x016B
		bool m_GlobalColormapEnable; //0x016C
		bool m_OccluderEnable; //0x016D
		bool m_OccluderJobEnable; //0x016E
		bool m_OccluderSpuJobEnable; //0x016F
		bool m_OccludedEnable; //0x0170
		bool m_MeshScatteringEnable; //0x0171
		bool m_MeshScatteringJobsEnable; //0x0172
		bool m_MeshScatteringCastShadowsEnable; //0x0173
		bool m_DrawMeshScatteringEnable; //0x0174
		bool m_DrawMeshScatteringCellBoxesEnable; //0x0175
		bool m_DrawMeshScatteringBatchBoxesEnable; //0x0176
		bool m_DrawMeshScatteringNodeBoxesEnable; //0x0177
		bool m_DrawMeshScatteringCulledCellBoxesEnable; //0x0178
		bool m_DrawMeshScatteringDebugMaskScaleTexturesEnable; //0x0179
		bool m_DrawMeshScatteringStatsEnable; //0x017A
		bool m_DrawMeshScatteringQuadtreeEnable; //0x017B
		bool m_MeshScatteringForceUpdateEnable; //0x017C
		bool m_MeshScatteringBuildVisibleFirst; //0x017D
		bool m_MeshScatteringCullSpuJobEnable; //0x017E
		bool m_MeshScatteringMergeInstanceLists; //0x017F
		bool m_MeshScatteringInstanceCullSpuJobEnable; //0x0180
		bool m_MeshScatteringPrioritizationSpuJobEnable; //0x0181
		bool m_MeshScatteringSpuJobEnable; //0x0182
		bool m_MeshScatteringInstanceCullBoxTestEnable; //0x0183
		bool m_MeshScatteringInstanceNewCodeEnable; //0x0184
		bool m_MeshScatteringInstanceFrustumCullEnable; //0x0185
		bool m_MeshScatteringInstanceOcclusionCullEnable; //0x0186
		bool m_MeshScatteringInstanceAdditionalCullEnable; //0x0187
		bool m_DrawMeshScatteringInstanceBoxesEnable; //0x0188
		bool m_MeshScatteringInstanceCullDynamicAllocEnable; //0x0189
		bool m_Ps3MeshScatteringInstanceCellMemoryEnable; //0x018A
		bool m_MeshScatteringWindEnable; //0x018B
		char _0x018C[4];
	};//Size=0x0190
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   02206
	// RuntimeId: 08496
	// TypeInfo:  0x00000001427DD800
#ifndef _VisualTerrainEntityData_
#define _VisualTerrainEntityData_
#pragma pack(push, 8)
	class VisualTerrainEntityData : public EntityData
	{
	public:
		static __inline VisualTerrainEntityData* DefaultInstance()
		{
			return (VisualTerrainEntityData*)0x0000000046393460;
		}
		static __inline unsigned int ClassId()
		{
			return 2206;
		}
		TerrainData* m_Terrain; //0x0018
		// unhandled basic type ResourceRef m_DecalsResource; //0x0020
		char _0x0020[8];
		VisualTerrainSettings* m_Settings; //0x0028
	};//Size=0x0030
#pragma pack(pop)
#endif

	////////////////////////////////////////
	// ClassId:   00103
	// RuntimeId: 08488
	// TypeInfo:  0x00000001427DD580
#ifndef _ITerrain_
#define _ITerrain_
	class ITerrain
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 103;
		}
		char _0x0000[8];
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00100
	// RuntimeId: 08493
	// TypeInfo:  0x00000001427DD760
#ifndef _TerrainLayerCombinations_
#define _TerrainLayerCombinations_
	class TerrainLayerCombinations
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 100;
		}
		char _0x0000[120];
	};//Size=0x0078
#endif

	////////////////////////////////////////
	// ClassId:   00101
	// RuntimeId: 08492
	// TypeInfo:  0x00000001427DD7B0
#ifndef _TerrainDecals_
#define _TerrainDecals_
	class TerrainDecals
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 101;
		}
		char _0x0000[392];
	};//Size=0x0188
#endif

	////////////////////////////////////////
	// ClassId:   00105
	// RuntimeId: 08491
	// TypeInfo:  0x00000001427DD860
#ifndef _IVisualTerrain_
#define _IVisualTerrain_
	class IVisualTerrain : public ITerrain
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 105;
		}
	};//Size=0x0008
#endif

	////////////////////////////////////////
	// ClassId:   00102
	// RuntimeId: 08490
	// TypeInfo:  0x00000001427DD4E0
#ifndef _TerrainStreamingTree_
#define _TerrainStreamingTree_
	class TerrainStreamingTree
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 102;
		}
		char _0x0000[296];
	};//Size=0x0128
#endif

	////////////////////////////////////////
	// ClassId:   00104
	// RuntimeId: 08489
	// TypeInfo:  0x00000001427DD530
#ifndef _Terrain_
#define _Terrain_
	class Terrain : public ITerrain
	{
	public:
		static __inline unsigned int ClassId()
		{
			return 104;
		}
		char _0x0008[32];
	};//Size=0x0028
#endif

	////////////////////////////////////////
	// ClassId:   00106
	// RuntimeId: 08494
	// TypeInfo:  0x00000001427DD710
#ifndef _VisualTerrain_
#define _VisualTerrain_
	class VisualTerrain : public IVisualTerrain
